{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2020256030000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2020-25603 on Ubuntu 18.04 ESM (bionic) - medium",
		"description": "An issue was discovered in Xen through 4.14.x. There are missing memorybarriers when accessing/allocating an event channel. Event channels controlstructures can be accessed lockless as long as the port is considered to bevalid. Such a sequence is missing an appropriate memory barrier (e.g.,smp_*mb()) to prevent both the compiler and CPU from re-ordering access. Amalicious guest may be able to cause a hypervisor crash resulting in aDenial of Service (DoS). Information leak and privilege escalation cannotbe excluded. Systems running all versions of Xen are affected. Whether asystem is vulnerable will depend on the CPU and compiler used to build Xen.For all systems, the presence and the scope of the vulnerability depend onthe precise re-ordering performed by the compiler used to build Xen. Wehave not been able to survey compilers; consequently we cannot say whichcompiler(s) might produce vulnerable code (with which code generationoptions). GCC documentation clearly suggests that re-ordering is possible.Arm systems will also be vulnerable if the CPU is able to re-order memoryaccess. Please consult your CPU vendor. x86 systems are only vulnerable ifa compiler performs re-ordering.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-25603",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-25603"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2020 Canonical Ltd.",
			"public_date": "2020-09-23 22:15:00 UTC",
			"cve": {
				"text": "CVE-2020-25603",
				"href": "https://ubuntu.com/security/CVE-2020-25603",
				"public": "20200923",
				"cvss_score": "7.8",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
				"usns": "5617-1"
			},
			"public_date_at_usn": "2020-09-23 22:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-5617-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2018109820000000",
						"comment": "xen package in esm-infra/bionic is affected and needs fixing."
					}
				]
			}
		]
	}
}
