{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2021212900000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-21290 on Ubuntu 18.04 ESM (bionic) - medium",
		"Description": "Netty is an open-source, asynchronous event-driven network applicationframework for rapid development of maintainable high performance protocolservers & clients. In Netty before version 4.1.59.Final there is avulnerability on Unix-like systems involving an insecure temp file. Whennetty's multipart decoders are used local information disclosure can occurvia the local system temporary directory if temporary storing uploads onthe disk is enabled. On unix-like systems, the temporary directory isshared between all user. As such, writing to this directory using APIs thatdo not explicitly set the file/directory permissions can lead toinformation disclosure. Of note, this does not impact modern MacOSOperating Systems. The method \"File.createTempFile\" on unix-like systemscreates a random file, but, by default will create this file with thepermissions \"-rw-r--r--\". Thus, if sensitive information is written to thisfile, other local users can read this information. This is the case innetty's \"AbstractDiskHttpData\" is vulnerable. This has been fixed inversion 4.1.59.Final. As a workaround, one may specify your own\"java.io.tmpdir\" when you start the JVM or use\"DefaultHttpDataFactory.setBaseDir(...)\" to set the directory to somethingthat is only readable by the current user.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 18.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-21290",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-21290"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2021 Canonical Ltd.",
			"PublicDate": "2021-02-08 20:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2021-21290",
				"href": "https://ubuntu.com/security/CVE-2021-21290",
				"public": "20210208",
				"cvss_score": "5.5",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N",
				"usns": "6049-1"
			},
			"PublicDateAtUsn": "2021-02-08 20:15:00 UTC",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": [
				"https://ubuntu.com/security/notices/USN-6049-1"
			]
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2019168690000000",
						"comment": "netty: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needs-triage')."
					}
				]
			}
		]
	}
}
