{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2023458030000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-45803 on Ubuntu 18.04 ESM (bionic) - medium",
		"description": "urllib3 is a user-friendly HTTP client library for Python. urllib3previously wouldn't remove the HTTP request body when an HTTP redirectresponse using status 301, 302, or 303 after the request had its methodchanged from one that could accept a request body (like `POST`) to `GET` asis required by HTTP RFCs. Although this behavior is not specified in thesection for redirects, it can be inferred by piecing together informationfrom different sections and we have observed the behavior in other majorHTTP client implementations like curl and web browsers. Because thevulnerability requires a previously trusted service to become compromisedin order to have an impact on confidentiality we believe the exploitabilityof this vulnerability is low. Additionally, many users aren't puttingsensitive data in HTTP request bodies, if this is the case then thisvulnerability isn't exploitable. Both of the following conditions must betrue to be affected by this vulnerability: 1. Using urllib3 and submittingsensitive information in the HTTP request body (such as form data or JSON)and 2. The origin service is compromised and starts redirecting using 301,302, or 303 to a malicious peer or the redirected-to service becomescompromised. This issue has been addressed in versions 1.26.18 and 2.0.7and users are advised to update to resolve this issue. Users unable toupdate should disable redirects for services that aren't expecting torespond with redirects with `redirects=False` and disable automaticredirects with `redirects=False` and handle 301, 302, and 303 redirectsmanually by stripping the HTTP request body.\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2023-45803` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\npython-urllib3 - 1.22-1ubuntu0.18.04.2+esm1\npython3-urllib3 - 1.22-1ubuntu0.18.04.2+esm1\nAvailable with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-45803",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-45803"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-10-17 20:15:00 UTC",
			"cve": {
				"text": "CVE-2023-45803",
				"href": "https://ubuntu.com/security/CVE-2023-45803",
				"public": "20231017",
				"cvss_score": "4.2",
				"cvss_vector": "CVSS:3.1/AV:A/AC:H/PR:H/UI:N/S:U/C:H/I:N/A:N",
				"usns": "6473-1,6473-2"
			},
			"public_date_at_usn": "2023-10-17 20:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-6473-1",
				"https://ubuntu.com/security/notices/USN-6473-2"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2018250910000000",
						"comment": "python-urllib3 package in esm-infra/bionic was vulnerable but has been fixed (note: '1.22-1ubuntu0.18.04.2+esm1')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2018202250000000",
						"comment": "python-pip: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
