{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.noble:def:2024477410000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-47741 on Ubuntu 24.04 LTS (noble) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:btrfs: fix race setting file private on concurrent lseek using same fdWhen doing concurrent lseek(2) system calls against the same filedescriptor, using multiple threads belonging to the same process, we havea short time window where a race happens and can result in a memory leak.The race happens like this:1) A program opens a file descriptor for a file and then spawns two   threads (with the pthreads library for example), lets call them   task A and task B;2) Task A calls lseek with SEEK_DATA or SEEK_HOLE and ends up at   file.c:find_desired_extent() while holding a read lock on the inode;3) At the start of find_desired_extent(), it extracts the file's   private_data pointer into a local variable named 'private', which has   a value of NULL;4) Task B also calls lseek with SEEK_DATA or SEEK_HOLE, locks the inode   in shared mode and enters file.c:find_desired_extent(), where it also   extracts file->private_data into its local variable 'private', which   has a NULL value;5) Because it saw a NULL file private, task A allocates a private   structure and assigns to the file structure;6) Task B also saw a NULL file private so it also allocates its own file   private and then assigns it to the same file structure, since both   tasks are using the same file descriptor.   At this point we leak the private structure allocated by task A.Besides the memory leak, there's also the detail that both tasks end upusing the same cached state record in the private structure (structbtrfs_file_private::llseek_cached_state), which can result in ause-after-free problem since one task can free it while the other isstill using it (only one task took a reference count on it). Also, sharingthe cached state is not a good idea since it could result in incorrectresults in the future - right now it should not be a problem because itend ups being used only in extent-io-tree.c:count_range_bits() where we dorange validation before using the cached state.Fix this by protecting the private assignment and check of a file whileholding the inode's spinlock and keep track of the task that allocatedthe private, so that it's used only by that task in order to preventuser-after-free issues with the cached state record as well as potentiallyusing it incorrectly in the future.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-47741",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-47741"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-10-21 13:15:00 UTC",
			"cve": {
				"text": "CVE-2024-47741",
				"href": "https://ubuntu.com/security/CVE-2024-47741",
				"public": "20241021",
				"cvss_score": "7.0",
				"cvss_vector": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000000",
						"comment": "linux package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-53.55')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000010",
						"comment": "linux-aws package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1022.24')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000030",
						"comment": "linux-azure package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1022.26')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000040",
						"comment": "linux-gcp package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1022.24')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000020",
						"comment": "linux-gke package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1018.22')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000070",
						"comment": "linux-ibm package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1020.20')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000080",
						"comment": "linux-lowlatency package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-53.55.2')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000050",
						"comment": "linux-oracle package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1020.21')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000090",
						"comment": "linux-oem-6.8 package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1021.21')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000060",
						"comment": "linux-raspi package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1019.23')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000110",
						"comment": "linux-raspi-realtime package in realtime/noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-2018.19')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000120",
						"comment": "linux-realtime package in realtime/noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.1-1016.17')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000100",
						"comment": "linux-intel package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1019.26')."
					}
				]
			}
		]
	}
}
