{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2022217020000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-21702 on Ubuntu Pro FIPS 16.04 LTS (xenial) - medium",
		"description": "Grafana is an open-source platform for monitoring and observability. Inaffected versions an attacker could serve HTML content thru the Grafanadatasource or plugin proxy and trick a user to visit this HTML page using aspecially crafted link and execute a Cross-site Scripting (XSS) attack. Theattacker could either compromise an existing datasource for a specificGrafana instance or either set up its own public service and instructanyone to set it up in their Grafana instance. To be impacted, all of thefollowing must be applicable. For the data source proxy: A GrafanaHTTP-based datasource configured with Server as Access Mode and a URL set,the attacker has to be in control of the HTTP server serving the URL ofabove datasource, and a specially crafted link pointing at the attackercontrolled data source must be clicked on by an authenticated user. For theplugin proxy: A Grafana HTTP-based app plugin configured and enabled with aURL set, the attacker has to be in control of the HTTP server serving theURL of above app, and a specially crafted link pointing at the attackercontrolled plugin must be clocked on by an authenticated user. For thebackend plugin resource: An attacker must be able to navigate anauthenticated user to a compromised plugin through a crafted link. Usersare advised to update to a patched version. There are no known workaroundsfor this vulnerability.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-21702",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2022-21702"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-02-08 20:15:00 UTC",
			"cve": {
				"text": "CVE-2022-21702",
				"href": "https://ubuntu.com/security/CVE-2022-21702",
				"public": "20220208",
				"cvss_score": "5.4",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:L/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201810008160000000",
						"comment": "grafana package in xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
