{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2024500170000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-50017 on Ubuntu Pro FIPS 16.04 LTS (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:x86/mm/ident_map: Use gbpages only where full GB page should be mapped.When ident_pud_init() uses only GB pages to create identity maps, largeranges of addresses not actually requested can be included in the resultingtable; a 4K request will map a full GB.  This can include a lot of extraaddress space past that requested, including areas marked reserved by theBIOS.  That allows processor speculation into reserved regions, that on UVsystems can cause system halts.Only use GB pages when map creation requests include the full GB page ofspace.  Fall back to using smaller 2M pages when only portions of a GB pageare included in the request.No attempt is made to coalesce mapping requests. If a request requires amap entry at the 2M (pmd) level, subsequent mapping requests within thesame 1G region will also be at the pmd level, even if adjacent oroverlapping such requests could have been combined to map a full GB page.Existing usage starts with larger regions and then adds smaller regions, sothis should not have any great consequence.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-50017",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-50017"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-10-22",
			"cve": {
				"text": "CVE-2024-50017",
				"href": "https://ubuntu.com/security/CVE-2024-50017",
				"public": "20241022"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000000",
						"comment": "linux package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000040",
						"comment": "linux-hwe package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000070",
						"comment": "linux-kvm package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000030",
						"comment": "linux-aws package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000080",
						"comment": "linux-aws-hwe package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000050",
						"comment": "linux-azure package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000100",
						"comment": "linux-fips package in fips/xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000060",
						"comment": "linux-gcp package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000090",
						"comment": "linux-oracle package in xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
