{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.focal:def:2021252160000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2021-25216 on Ubuntu 20.04 ESM (focal) - medium.",
    "Description": "In BIND 9.5.0 -> 9.11.29, 9.12.0 -> 9.16.13, and versions BIND 9.11.3-S1 -> 9.11.29-S1 and 9.16.8-S1 -> 9.16.13-S1 of BIND Supported Preview Edition, as well as release versions 9.17.0 -> 9.17.1 of the BIND 9.17 development branch, BIND servers are vulnerable if they are running an affected version and are configured to use GSS-TSIG features. In a configuration which uses BIND's default settings the vulnerable code path is not exposed, but a server can be rendered vulnerable by explicitly setting values for the tkey-gssapi-keytab or tkey-gssapi-credential configuration options. Although the default configuration is not vulnerable, GSS-TSIG is frequently used in networks where BIND is integrated with Samba, as well as in mixed-server environments that combine BIND servers with Active Directory domain controllers. For servers that meet these conditions, the ISC SPNEGO implementation is vulnerable to various attacks, depending on the CPU architecture for which BIND was built: For named binaries compiled for 64-bit platforms, this flaw can be used to trigger a buffer over-read, leading to a server crash. For named binaries compiled for 32-bit platforms, this flaw can be used to trigger a server crash due to a buffer overflow and possibly also to achieve remote code execution. We have determined that standard SPNEGO implementations are available in the MIT and Heimdal Kerberos libraries, which support a broad range of operating systems, rendering the ISC implementation unnecessary and obsolete. Therefore, to reduce the attack surface for BIND users, we will be removing the ISC SPNEGO implementation in the April releases of BIND 9.11 and 9.16 (it had already been dropped from BIND 9.17). We would not normally remove something from a stable ESV (Extended Support Version) of BIND, but since system libraries can replace the ISC SPNEGO implementation, we have made an exception in this case for reasons of stability and security.\n\nUpdate Instructions:\n\nRun `sudo pro fix CVE-2021-25216` to fix the vulnerability. The problem can be corrected\nby updating your system to the following package versions:\n\nbind9 - 1:9.16.1-0ubuntu2.8\nbind9-dnsutils - 1:9.16.1-0ubuntu2.8\nbind9-host - 1:9.16.1-0ubuntu2.8\nbind9-libs - 1:9.16.1-0ubuntu2.8\nbind9-utils - 1:9.16.1-0ubuntu2.8\nbind9utils - 1:9.16.1-0ubuntu2.8\ndnsutils - 1:9.16.1-0ubuntu2.8\nNo subscription required",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 20.04 ESM"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2021-25216",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-25216"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2021 Canonical Ltd.",
      "PublicDate": "2021-04-28",
      "Bug": null,
      "cve": {
        "text": "CVE-2021-25216",
        "href": "https://ubuntu.com/security/CVE-2021-25216",
        "public": "20210428",
        "cvss_score": "9.8",
        "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
        "usns": "4929-1"
      },
      "PublicDateAtUsn": "2021-04-28",
      "AssignedTo": "mdeslaur",
      "DiscoveredBy": "",
      "Crd": "2021-04-28",
      "Ref": null
    }
  },
  "notes": {
    "Note": "mdeslaur> only affects 9.5.0+"
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.focal:tst:2021252140000000",
        "comment": "bind9 package in focal was vulnerable but has been fixed (note: '1:9.16.1-0ubuntu2.8')."
      }
    ]
  }
}
