{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2021252170000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-25217 on Ubuntu 20.04 ESM (focal) - medium.",
		"Description": "In ISC DHCP 4.1-ESV-R1 -> 4.1-ESV-R16, ISC DHCP 4.4.0 -> 4.4.2 (Other branches of ISC DHCP (i.e., releases in the 4.0.x series or lower and releases in the 4.3.x series) are beyond their End-of-Life (EOL) and no longer supported by ISC. From inspection it is clear that the defect is also present in releases from those series, but they have not been officially tested for the vulnerability), The outcome of encountering the defect while reading a lease that will trigger it varies, according to: the component being affected (i.e., dhclient or dhcpd) whether the package was built as a 32-bit or 64-bit binary whether the compiler flag -fstack-protection-strong was used when compiling In dhclient, ISC has not successfully reproduced the error on a 64-bit system. However, on a 32-bit system it is possible to cause dhclient to crash when reading an improper lease, which could cause network connectivity problems for an affected system due to the absence of a running DHCP client process. In dhcpd, when run in DHCPv4 or DHCPv6 mode: if the dhcpd server binary was built for a 32-bit architecture AND the -fstack-protection-strong flag was specified to the compiler, dhcpd may exit while parsing a lease file containing an objectionable lease, resulting in lack of service to clients. Additionally, the offending lease and the lease immediately following it in the lease database may be improperly deleted. if the dhcpd server binary was built for a 64-bit architecture OR if the -fstack-protection-strong compiler flag was NOT specified, the crash will not occur, but it is possible for the offending lease and the lease which immediately followed it to be improperly deleted.\n\nUpdate Instructions:\n\nRun `sudo pro fix CVE-2021-25217` to fix the vulnerability. The problem can be corrected\nby updating your system to the following package versions:\n\nisc-dhcp-client - 4.4.1-2.1ubuntu5.20.04.2\nisc-dhcp-client-ddns - 4.4.1-2.1ubuntu5.20.04.2\nisc-dhcp-common - 4.4.1-2.1ubuntu5.20.04.2\nisc-dhcp-relay - 4.4.1-2.1ubuntu5.20.04.2\nisc-dhcp-server - 4.4.1-2.1ubuntu5.20.04.2\nisc-dhcp-server-ldap - 4.4.1-2.1ubuntu5.20.04.2\nNo subscription required",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 20.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-25217",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-25217"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2021 Canonical Ltd.",
			"PublicDate": "2021-05-26",
			"Bug": null,
			"cve": {
				"text": "CVE-2021-25217",
				"href": "https://ubuntu.com/security/CVE-2021-25217",
				"public": "20210526",
				"cvss_score": "7.4",
				"cvss_vector": "CVSS:3.1/AV:A/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H",
				"usns": "4969-1,4969-2"
			},
			"PublicDateAtUsn": "2021-05-26",
			"AssignedTo": "mdeslaur",
			"DiscoveredBy": "Jon Franklin and Pawel Wieczorkiewicz",
			"Crd": "2021-05-26",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.focal:tst:2021252170000000",
				"comment": "isc-dhcp package in focal was vulnerable but has been fixed (note: '4.4.1-2.1ubuntu5.20.04.2')."
			}
		]
	}
}
