{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2023458030000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2023-45803 on Ubuntu 20.04 ESM (focal) - medium.",
		"Description": "urllib3 is a user-friendly HTTP client library for Python. urllib3 previously wouldn't remove the HTTP request body when an HTTP redirect response using status 301, 302, or 303 after the request had its method changed from one that could accept a request body (like `POST`) to `GET` as is required by HTTP RFCs. Although this behavior is not specified in the section for redirects, it can be inferred by piecing together information from different sections and we have observed the behavior in other major HTTP client implementations like curl and web browsers. Because the vulnerability requires a previously trusted service to become compromised in order to have an impact on confidentiality we believe the exploitability of this vulnerability is low. Additionally, many users aren't putting sensitive data in HTTP request bodies, if this is the case then this vulnerability isn't exploitable. Both of the following conditions must be true to be affected by this vulnerability: 1. Using urllib3 and submitting sensitive information in the HTTP request body (such as form data or JSON) and 2. The origin service is compromised and starts redirecting using 301, 302, or 303 to a malicious peer or the redirected-to service becomes compromised. This issue has been addressed in versions 1.26.18 and 2.0.7 and users are advised to update to resolve this issue. Users unable to update should disable redirects for services that aren't expecting to respond with redirects with `redirects=False` and disable automatic redirects with `redirects=False` and handle 301, 302, and 303 redirects manually by stripping the HTTP request body.\n\nUpdate Instructions:\n\nRun `sudo pro fix CVE-2023-45803` to fix the vulnerability. The problem can be corrected\nby updating your system to the following package versions:\n\npython-pip-whl - 20.0.2-5ubuntu1.10\npython3-pip - 20.0.2-5ubuntu1.10\nNo subscription required\n\npython3-urllib3 - 1.25.8-2ubuntu0.3\nNo subscription required",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 20.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-45803",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-45803"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2023 Canonical Ltd.",
			"PublicDate": "2023-10-17 20:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2023-45803",
				"href": "https://ubuntu.com/security/CVE-2023-45803",
				"public": "20231017",
				"cvss_score": "4.2",
				"cvss_vector": "CVSS:3.1/AV:A/AC:H/PR:H/UI:N/S:U/C:H/I:N/A:N",
				"usns": "6473-1,6473-2"
			},
			"PublicDateAtUsn": "2023-10-17 20:15:00 UTC",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": "mdeslaur> On focal and earlier, the python-pip package bundles python-urllib3 binaries when built. After updating python-urllib3, a no-change rebuild of python-pip is required. On jammy and later, python-urllib3 is bundled in the python-pip package and needs to be patched."
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2018250910000000",
						"comment": "python-pip package in focal, is related to the CVE in some way and has been fixed (note: '20.0.2-5ubuntu1.10')."
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2023438040000010",
						"comment": "python-urllib3 package in focal was vulnerable but has been fixed (note: '1.25.8-2ubuntu0.3')."
					}
				]
			}
		]
	}
}
