{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2022216680000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2022-21668 on Ubuntu 20.04 ESM (focal) - medium.",
		"Description": "pipenv is a Python development workflow tool. Starting with version 2018.10.9 and prior to version 2022.1.8, a flaw in pipenv's parsing of requirements files allows an attacker to insert a specially crafted string inside a comment anywhere within a requirements.txt file, which will cause victims who use pipenv to install the requirements file to download dependencies from a package index server controlled by the attacker. By embedding malicious code in packages served from their malicious index server, the attacker can trigger arbitrary remote code execution (RCE) on the victims' systems. If an attacker is able to hide a malicious `--index-url` option in a requirements file that a victim installs with pipenv, the attacker can embed arbitrary malicious code in packages served from their malicious index server that will be executed on the victim's host during installation (remote code execution/RCE). When pip installs from a source distribution, any code in the setup.py is executed by the install process. This issue is patched in version 2022.1.8. The GitHub Security Advisory contains more information about this vulnerability.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 20.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-21668",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-21668"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2022 Canonical Ltd.",
			"PublicDate": "2022-01-10 21:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2022-21668",
				"href": "https://ubuntu.com/security/CVE-2022-21668",
				"public": "20220110",
				"cvss_score": "8.6",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.focal:tst:2022216680000000",
				"comment": "pipenv package in focal is affected and may need fixing."
			}
		]
	}
}
