{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.xenial:def:2023405870000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2023-40587 on Ubuntu 16.04 ESM (xenial) - low.",
    "Description": "Pyramid is an open source Python web framework. A path traversal vulnerability in Pyramid versions 2.0.0 and 2.0.1 impacts users of Python 3.11 that are using a Pyramid static view with a full filesystem path and have a `index.html` file that is located exactly one directory above the location of the static view's file system path. No further path traversal exists, and the only file that could be disclosed accidentally is `index.html`. Pyramid version 2.0.2 rejects any path that contains a null-byte out of caution. While valid in directory/file names, we would strongly consider it a mistake to use null-bytes in naming files/directories. Secondly, Python 3.11, and 3.12 has fixed the underlying issue in `os.path.normpath` to no longer truncate on the first `0x00` found, returning the behavior to pre-3.11 Python, un an as of yet unreleased version. Fixes will be available in:Python 3.12.0rc2 and 3.11.5. Some workarounds are available. Use a version of Python 3 that is not affected, downgrade to Python 3.10 series temporarily, or wait until Python 3.11.5 is released and upgrade to the latest version of Python 3.11 series.",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 16.04 ESM"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2023-40587",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40587"
    },
    "advisory": {
      "Severity": "Low",
      "Rights": "Copyright (C) 2023 Canonical Ltd.",
      "PublicDate": "2023-08-25 21:15:00 UTC",
      "Bug": null,
      "cve": {
        "text": "CVE-2023-40587",
        "href": "https://ubuntu.com/security/CVE-2023-40587",
        "public": "20230825",
        "cvss_score": "5.3",
        "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N"
      },
      "PublicDateAtUsn": "",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": ""
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.xenial:tst:2023405870000000",
        "comment": "python-pyramid: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
      }
    ]
  }
}
