{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2022392510000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2022-39251 on Ubuntu 16.04 ESM (xenial) - medium",
		"Description": "Matrix Javascript SDK is the Matrix Client-Server SDK for JavaScript. Priorto version 19.7.0, an attacker cooperating with a malicious homeserver canconstruct messages that legitimately appear to have come from anotherperson, without any indication such as a grey shield. Additionally, asophisticated attacker cooperating with a malicious homeserver could employthis vulnerability to perform a targeted attack in order to send faketo-device messages appearing to originate from another user. This canallow, for example, to inject the key backup secret during aself-verification, to make a targeted device start using a malicious keybackup spoofed by the homeserver. These attacks are possible due to aprotocol confusion vulnerability that accepts to-device messages encryptedwith Megolm instead of Olm. Starting with version 19.7.0, matrix-js-sdk hasbeen modified to only accept Olm-encrypted to-device messages. Out ofcaution, several other checks have been audited or added. This attackrequires coordination between a malicious home server and an attacker, sothose who trust their home servers do not need a workaround.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 16.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-39251",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-39251"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2022 Canonical Ltd.",
			"PublicDate": "2022-09-28 20:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2022-39251",
				"href": "https://ubuntu.com/security/CVE-2022-39251",
				"public": "20220928",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
				"usns": "5724-1"
			},
			"PublicDateAtUsn": "2022-09-28 20:15:00 UTC",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": [
				"https://ubuntu.com/security/notices/USN-5724-1"
			]
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201361670000010",
						"comment": "thunderbird: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
