{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.xenial:def:2023260490000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2023-26049 on Ubuntu 16.04 ESM (xenial) - medium.",
    "Description": "Jetty is a java based web server and servlet engine. Nonstandard cookie parsing in Jetty may allow an attacker to smuggle cookies within other cookies, or otherwise perform unintended behavior by tampering with the cookie parsing mechanism. If Jetty sees a cookie VALUE that starts with `\"` (double quote), it will continue to read the cookie string until it sees a closing quote -- even if a semicolon is encountered. So, a cookie header such as: `DISPLAY_LANGUAGE=\"b; JSESSIONID=1337; c=d\"` will be parsed as one cookie, with the name DISPLAY_LANGUAGE and a value of b; JSESSIONID=1337; c=d instead of 3 separate cookies. This has security implications because if, say, JSESSIONID is an HttpOnly cookie, and the DISPLAY_LANGUAGE cookie value is rendered on the page, an attacker can smuggle the JSESSIONID cookie into the DISPLAY_LANGUAGE cookie and thereby exfiltrate it. This is significant when an intermediary is enacting some policy based on cookies, so a smuggled cookie can bypass that policy yet still be seen by the Jetty server or its logging system. This issue has been addressed in versions 9.4.51, 10.0.14, 11.0.14, and 12.0.0.beta0 and users are advised to upgrade. There are no known workarounds for this issue.",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 16.04 ESM"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2023-26049",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26049"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2023 Canonical Ltd.",
      "PublicDate": "2023-04-18 21:15:00 UTC",
      "Bug": null,
      "cve": {
        "text": "CVE-2023-26049",
        "href": "https://ubuntu.com/security/CVE-2023-26049",
        "public": "20230418",
        "cvss_score": "5.3",
        "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N"
      },
      "PublicDateAtUsn": "",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": ""
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.xenial:tst:2019102410000000",
        "comment": "jetty: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
      }
    ]
  }
}
