{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:201695720000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2016-9572 on Ubuntu 20.04 FIPS Compliant (focal) - medium.",
		"Description": "A NULL pointer dereference flaw was found in the way openjpeg 2.1.2 decoded certain input images. Due to a logic error in the code responsible for decoding the input image, an application using openjpeg to process image data could crash when processing a crafted image.\n\nUpdate Instructions:\n\nRun `sudo pro fix CVE-2016-9572` to fix the vulnerability. The problem can be corrected\nby updating your system to the following package versions:\n\nlibopenjp2-7 - 2.3.1-1ubuntu4\nlibopenjp2-tools - 2.3.1-1ubuntu4\nlibopenjp3d-tools - 2.3.1-1ubuntu4\nlibopenjp3d7 - 2.3.1-1ubuntu4\nlibopenjpip-dec-server - 2.3.1-1ubuntu4\nlibopenjpip-server - 2.3.1-1ubuntu4\nlibopenjpip-viewer - 2.3.1-1ubuntu4\nlibopenjpip7 - 2.3.1-1ubuntu4\nNo subscription required",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 20.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2016-9572",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-9572"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2018 Canonical Ltd.",
			"PublicDate": "2018-08-01 16:29:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2016-9572",
				"href": "https://ubuntu.com/security/CVE-2016-9572",
				"public": "20180801",
				"cvss_score": "6.5",
				"cvss_vector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": "ccdm94> It seems like commit a817832c223 (szukw000:AFL_PATCH_0) was the final commit created by a contributor in order to fix this issue. This commit contains the changes in commit 7b28bd2b723 (szukw000:863-862) which originally attempts to fix this issue. Commit a817832c223 (pull request 895 for more information) contains the changes in commit 7b28bd2b723, which fixes more than just this issue. Commit a817832c223 was never merged, however, and instead, was broken down into various other commits by upstream, and those were merged instead. These commits are the following: 178194c0934, 6c4e5bacb9d, 820fcfe8bb1, e03e9474667, c5bf5ef4d65 and 16aeb9282f6, which are all referenced in pull request 895 (not merged, but the previously mentioned commits reference this PR and therefore their links can be accessed through it). Parts of commit a817832c223 have also been refactored and added to commit 0394f8d0f1c, which was actually merged. This commit might also contain changes which contribute to fixing this issue. However, do note that this last commit introduced regressions, and further changes had to be made in order to fix those. More can be seen in pull request 975. The patches that fix this issue are also related to CVE-2016-9580 and CVE-2016-9581. eslerm> a non-upstream patch had previously been applied to openjpeg2 eslerm> CVE-2016-{9572,9580,9581} use the same patch set CVE-2016-911{3..8} apply merge 0394f8d and commited afterwards"
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.focal:tst:2017174790000000",
				"comment": "openjpeg2 package in focal, is related to the CVE in some way and has been fixed (note: '2.3.1-1ubuntu4')."
			}
		]
	}
}
