{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.focal:def:201691130000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2016-9113 on Ubuntu 20.04 FIPS Compliant (focal) - low.",
    "Description": "There is a NULL pointer dereference in function imagetobmp of convertbmp.c:980 of OpenJPEG 2.1.2. image->comps[0].data is not assigned a value after initialization(NULL). Impact is Denial of Service.\n\nUpdate Instructions:\n\nRun `sudo pro fix CVE-2016-9113` to fix the vulnerability. The problem can be corrected\nby updating your system to the following package versions:\n\nlibopenjp2-7 - 2.2.0-1\nlibopenjp2-tools - 2.2.0-1\nlibopenjp3d-tools - 2.2.0-1\nlibopenjp3d7 - 2.2.0-1\nlibopenjpip-dec-server - 2.2.0-1\nlibopenjpip-server - 2.2.0-1\nlibopenjpip-viewer - 2.2.0-1\nlibopenjpip7 - 2.2.0-1\nNo subscription required",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 20.04 FIPS Compliant"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2016-9113",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-9113"
    },
    "advisory": {
      "Severity": "Low",
      "Rights": "Copyright (C) 2016 Canonical Ltd.",
      "PublicDate": "2016-10-30 22:59:00 UTC",
      "Bug": [
        "https://github.com/uclouvain/openjpeg/issues/856"
      ],
      "cve": {
        "text": "CVE-2016-9113",
        "href": "https://ubuntu.com/security/CVE-2016-9113",
        "public": "20161030",
        "cvss_score": "7.5",
        "cvss_vector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H"
      },
      "PublicDateAtUsn": "",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": "ccdm94> Pull request 895 seems to be an initial attempt to fix this issue. However, pull request 895 was never merged, and instead, five issues which did not include issue 856 were fixed by various commits created by upstream (these can be seen in PR 895) which utilized part of what was being proposed in 895 by an openjpeg contributor. The changes proposed in 895 that were not added by the upstream commits previously mentioned were added to a new pull request, 975, which attempts to fix various issues. Looking at comments in issue 863 it was possible to verify that the fix for CVE-2016-9114 is possibly commit 2fa0fc61f2d (see CVE-2016-9114 for more details). This CVE mentions a vulnerability similar to the one we have here in CVE-2016-9113. Therefore, looking at the patch for CVE-2016-9114 and looking at the changes proposed by PR 975, it seems like the changes in this PR aim to address CVE-2016-9113 in a way similar to the one used to address CVE-2016-9114. PR 975 was merged, however, it introduced regressions. See PR in order to verify changes made after it was merged in order to fix introduced regressions if adding patch. eslerm> this set of CVEs was patched with  2fa0fc6, 784d4d4, c22cbd8, and 00f4568 note that 00f4568 is part of 0394f8d"
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.focal:tst:2016105060000000",
        "comment": "openjpeg2 package in focal, is related to the CVE in some way and has been fixed (note: '2.2.0-1')."
      }
    ]
  }
}
