{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2024320200000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-32020 on Ubuntu 20.04 FIPS Compliant (focal) - medium",
		"description": "Git is a revision control system. Prior to versions 2.45.1, 2.44.1, 2.43.4,2.42.2, 2.41.1, 2.40.2, and 2.39.4, local clones may end up hardlinkingfiles into the target repository's object database when source and targetrepository reside on the same disk. If the source repository is owned by adifferent user, then those hardlinked files may be rewritten at any pointin time by the untrusted user. Cloning local repositories will cause Git toeither copy or hardlink files of the source repository into the targetrepository. This significantly speeds up such local clones compared todoing a \"proper\" clone and saves both disk space and compute time. Whencloning a repository located on the same disk that is owned by a differentuser than the current user we also end up creating such hardlinks. Thesefiles will continue to be owned and controlled by the potentially-untrusteduser and can be rewritten by them at will in the future. The problem hasbeen patched in versions 2.45.1, 2.44.1, 2.43.4, 2.42.2, 2.41.1, 2.40.2,and 2.39.4.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-32020",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-32020"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-14 19:15:00 UTC",
			"bug": [
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=1071160"
			],
			"cve": {
				"text": "CVE-2024-32020",
				"href": "https://ubuntu.com/security/CVE-2024-32020",
				"public": "20240514"
			},
			"assigned_to": "leosilva"
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:201810000210000000",
						"comment": "git package in focal is affected and may need fixing."
					}
				]
			}
		]
	}
}
