{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2023368110000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-36811 on Ubuntu 20.04 FIPS Compliant (focal) - medium",
		"description": "borgbackup is an opensource, deduplicating archiver with compression andauthenticated encryption. A flaw in the cryptographic authentication schemein borgbackup allowed an attacker to fake archives and potentiallyindirectly cause backup data loss in the repository. The attack requires anattacker to be able to: 1. insert files (with no additional headers) intobackups and 2. gain write access to the repository. This vulnerability doesnot disclose plaintext to the attacker, nor does it affect the authenticityof existing archives. Creating plausible fake archives may be feasible forempty or small archives, but is unlikely for large archives. The issue hasbeen fixed in borgbackup 1.2.5. Users are advised to upgrade. Additionallyto installing the fixed code, users must follow the upgrade procedure asdocumented in the change log. Data loss after being attacked can be avoidedby reviewing the archives (timestamp and contents valid and as expected)after any \"borg check --repair\" and before \"borg prune\". There are no knownworkarounds for this vulnerability.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-36811",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-36811"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-08-30 18:15:00 UTC",
			"cve": {
				"text": "CVE-2023-36811",
				"href": "https://ubuntu.com/security/CVE-2023-36811",
				"public": "20230830",
				"cvss_score": "4.7",
				"cvss_vector": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:H/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2023368110000000",
						"comment": "borgbackup package in focal is affected and may need fixing."
					}
				]
			}
		]
	}
}
