{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2023288400000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-28840 on Ubuntu 20.04 FIPS Compliant (focal) - medium",
		"description": "Moby is an open source container framework developed by Docker Inc. that isdistributed as Docker, Mirantis Container Runtime, and various otherdownstream projects/products. The Moby daemon component (`dockerd`), whichis developed as moby/moby, is commonly referred to as *Docker*. Swarm Mode,which is compiled in and delivered by default in dockerd and is thuspresent in most major Moby downstreams, is a simple, built-in containerorchestrator that is implemented through a combination of SwarmKit andsupporting network code. The overlay network driver is a core feature ofSwarm Mode, providing isolated virtual LANs that allow communicationbetween containers and services across the cluster. This driver is animplementation/user of VXLAN, which encapsulates link-layer (Ethernet)frames in UDP datagrams that tag the frame with a VXLAN Network ID (VNI)that identifies the originating overlay network. In addition, the overlaynetwork driver supports an optional, off-by-default encrypted mode, whichis especially useful when VXLAN packets traverses an untrusted networkbetween nodes. Encrypted overlay networks function by encapsulating theVXLAN datagrams through the use of the IPsec Encapsulating Security Payloadprotocol in Transport mode. By deploying IPSec encapsulation, encryptedoverlay networks gain the additional properties of source authenticationthrough cryptographic proof, data integrity through check-summing, andconfidentiality through encryption. When setting an endpoint up on anencrypted overlay network, Moby installs three iptables (Linux kernelfirewall) rules that enforce both incoming and outgoing IPSec. These rulesrely on the u32 iptables extension provided by the xt_u32 kernel module todirectly filter on a VXLAN packet's VNI field, so that IPSec guarantees canbe enforced on encrypted overlay networks without interfering with otheroverlay networks or other users of VXLAN. Two iptables rules serve tofilter incoming VXLAN datagrams with a VNI that corresponds to an encryptednetwork and discards unencrypted datagrams. The rules are appended to theend of the INPUT filter chain, following any rules that have beenpreviously set by the system administrator. Administrator-set rules takeprecedence over the rules Moby sets to discard unencrypted VXLAN datagrams,which can potentially admit unencrypted datagrams that should have beendiscarded. The injection of arbitrary Ethernet frames can enable a Denialof Service attack. A sophisticated attacker may be able to establish a UDPor TCP connection by way of the container’s outbound gateway that wouldotherwise be blocked by a stateful firewall, or carry out other escalationsbeyond simple injection by smuggling packets into the overlay network.Patches are available in Moby releases 23.0.3 and 20.10.24. As MirantisContainer Runtime's 20.10 releases are numbered differently, users of thatplatform should update to 20.10.16. Some workarounds are available. Closethe VXLAN port (by default, UDP port 4789) to incoming traffic at theInternet boundary to prevent all VXLAN packet injection, and/or ensure thatthe `xt_u32` kernel module is available on all nodes of the Swarm cluster.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-28840",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-28840"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-04-04 22:15:00 UTC",
			"cve": {
				"text": "CVE-2023-28840",
				"href": "https://ubuntu.com/security/CVE-2023-28840",
				"public": "20230404",
				"cvss_score": "8.7",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2023288400000000",
						"comment": "docker package in focal is affected and may need fixing."
					}
				]
			}
		]
	}
}
