{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2021212610000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-21261 on Ubuntu 20.04 FIPS Compliant (focal) - medium",
		"description": "Flatpak is a system for building, distributing, and running sandboxeddesktop applications on Linux. A bug was discovered in the `flatpak-portal`service that can allow sandboxed applications to execute arbitrary code onthe host system (a sandbox escape). This sandbox-escape bug is present inversions from 0.11.4 and before fixed versions 1.8.5 and 1.10.0. TheFlatpak portal D-Bus service (`flatpak-portal`, also known by its D-Busservice name `org.freedesktop.portal.Flatpak`) allows apps in a Flatpaksandbox to launch their own subprocesses in a new sandbox instance, eitherwith the same security settings as the caller or with more restrictivesecurity settings. For example, this is used in Flatpak-packaged webbrowsers such as Chromium to launch subprocesses that will processuntrusted web content, and give those subprocesses a more restrictivesandbox than the browser itself. In vulnerable versions, the Flatpak portalservice passes caller-specified environment variables to non-sandboxedprocesses on the host system, and in particular to the `flatpak run`command that is used to launch the new sandbox instance. A malicious orcompromised Flatpak app could set environment variables that are trusted bythe `flatpak run` command, and use them to execute arbitrary code that isnot in a sandbox. As a workaround, this vulnerability can be mitigated bypreventing the `flatpak-portal` service from starting, but that mitigationwill prevent many Flatpak apps from working correctly. This is fixed inversions 1.8.5 and 1.10.0.\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2021-21261` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nflatpak - 1.6.5-0ubuntu0.2\nflatpak-tests - 1.6.5-0ubuntu0.2\ngir1.2-flatpak-1.0 - 1.6.5-0ubuntu0.2\nlibflatpak0 - 1.6.5-0ubuntu0.2\nNo subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-21261",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-21261"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-01-14 20:15:00 UTC",
			"bug": [
				"https://bugs.launchpad.net/bugs/1911473"
			],
			"cve": {
				"text": "CVE-2021-21261",
				"href": "https://ubuntu.com/security/CVE-2021-21261",
				"public": "20210114",
				"cvss_score": "8.8",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H",
				"usns": "4721-1"
			},
			"public_date_at_usn": "2021-01-14 20:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-4721-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2021212610000000",
						"comment": "flatpak package in focal was vulnerable but has been fixed (note: '1.6.5-0ubuntu0.2')."
					}
				]
			}
		]
	}
}
