{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2020294830000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2020-29483 on Ubuntu 20.04 FIPS Compliant (focal) - medium",
		"Description": "An issue was discovered in Xen through 4.14.x. Xenstored and guestscommunicate via a shared memory page using a specific protocol. When aguest violates this protocol, xenstored will drop the connection to thatguest. Unfortunately, this is done by just removing the guest fromxenstored's internal management, resulting in the same actions as if theguest had been destroyed, including sending an @releaseDomain event.@releaseDomain events do not say that the guest has been removed. Allwatchers of this event must look at the states of all guests to find theguest that has been removed. When an @releaseDomain is generated due to adomain xenstored protocol violation, because the guest is still running,the watchers will not react. Later, when the guest is actually destroyed,xenstored will no longer have it stored in its internal data base, so nofurther @releaseDomain event will be sent. This can lead to a zombiedomain; memory mappings of that guest's memory will not be removed, due tothe missing event. This zombie domain will be cleaned up only after anotherdomain is destroyed, as that will trigger another @releaseDomain event. Ifthe device model of the guest that violated the Xenstore protocol isrunning in a stub-domain, a use-after-free case could happen in xenstored,after having removed the guest from its internal data base, possiblyresulting in a crash of xenstored. A malicious guest can block resources ofthe host for a period after its own death. Guests with a stub domain devicemodel can eventually crash xenstored, resulting in a more serious denial ofservice (the prevention of any further domain management operations). Onlythe C variant of Xenstore is affected; the Ocaml variant is not affected.Only HVM guests with a stubdom device model can cause a serious DoS.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 20.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-29483",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-29483"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2020 Canonical Ltd.",
			"PublicDate": "2020-12-15 18:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2020-29483",
				"href": "https://ubuntu.com/security/CVE-2020-29483",
				"public": "20201215",
				"cvss_score": "6.5",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:N/I:N/A:H"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2020276700000000",
						"comment": "xen package in focal is affected and needs fixing."
					}
				]
			}
		]
	}
}
