{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2023359470000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-35947 on Ubuntu Pro FIPS-updates 20.04 LTS (focal) - medium",
		"description": "Gradle is a build tool with a focus on build automation and support formulti-language development. In affected versions when unpacking Tararchives, Gradle did not check that files could be written outside of theunpack location. This could lead to important files being overwrittenanywhere the Gradle process has write permissions. For a build reading Tarentries from a Tar archive, this issue could allow Gradle to discloseinformation from sensitive files through an arbitrary file read. To exploitthis behavior, an attacker needs to either control the source of an archivealready used by the build or modify the build to interact with a maliciousarchive. It is unlikely that this would go unnoticed. A fix has beenreleased in Gradle 7.6.2 and 8.2 to protect against this vulnerability.Starting from these versions, Gradle will refuse to handle Tar archiveswhich contain path traversal elements in a Tar entry name. Users areadvised to upgrade. There are no known workarounds for this vulnerability.### Impact This is a path traversal vulnerability when Gradle deals withTar archives, often referenced as TarSlip, a variant of ZipSlip. * Whenunpacking Tar archives, Gradle did not check that files could be writtenoutside of the unpack location. This could lead to important files beingoverwritten anywhere the Gradle process has write permissions. * For abuild reading Tar entries from a Tar archive, this issue could allow Gradleto disclose information from sensitive files through an arbitrary fileread. To exploit this behavior, an attacker needs to either control thesource of an archive already used by the build or modify the build tointeract with a malicious archive. It is unlikely that this would gounnoticed. Gradle uses Tar archives for its [BuildCache](https://docs.gradle.org/current/userguide/build_cache.html). Thesearchives are safe when created by Gradle. But if an attacker had control ofa remote build cache server, they could inject malicious build cacheentries that leverage this vulnerability. This attack vector could also beexploited if a man-in-the-middle can be performed between the remote cacheand the build. ### Patches A fix has been released in Gradle 7.6.2 and 8.2to protect against this vulnerability. Starting from these versions, Gradlewill refuse to handle Tar archives which contain path traversal elements ina Tar entry name. It is recommended that users upgrade to a patchedversion. ### Workarounds There is no workaround. * If your build deals withTar archives that you do not fully trust, you need to inspect them toconfirm they do not attempt to leverage this vulnerability. * If you usethe Gradle remote build cache, make sure only trusted parties have writeaccess to it and that connections to the remote cache are properly secured.### References * [CWE-22: Improper Limitation of a Pathname to a RestrictedDirectory ('PathTraversal')](https://cwe.mitre.org/data/definitions/22.html) * [GradleBuild Cache](https://docs.gradle.org/current/userguide/build_cache.html) *[ZipSlip](https://security.snyk.io/research/zip-slip-vulnerability)",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS-updates 20.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-35947",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-35947"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-06-30 21:15:00 UTC",
			"cve": {
				"text": "CVE-2023-35947",
				"href": "https://ubuntu.com/security/CVE-2023-35947",
				"public": "20230630",
				"cvss_score": "8.1",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2019150520000000",
						"comment": "gradle package in focal is affected and may need fixing."
					}
				]
			}
		]
	}
}
