{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2024358030000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-35803 on Ubuntu Pro FIPS 16.04 LTS (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:x86/efistub: Call mixed mode boot services on the firmware's stackNormally, the EFI stub calls into the EFI boot services using the stackthat was live when the stub was entered. According to the UEFI spec, thisstack needs to be at least 128k in size - this might seem large but allasynchronous processing and event handling in EFI runs from the same stackand so quite a lot of space may be used in practice. In mixed mode, thesituation is a bit different: the bootloader calls the 32-bit EFI stubentry point, which calls the decompressor's 32-bit entry point, where theboot stack is set up, using a fixed allocation of 16k. This stack is stillin use when the EFI stub is started in 64-bit mode, and so all calls backinto the EFI firmware will be using the decompressor's limited boot stack.Due to the placement of the boot stack right after the boot heap, any stackoverruns have gone unnoticed. However, commit 5c4feadb0011983b(\"x86/decompressor: Move global symbol references to C code\") moved thedefinition of the boot heap into C code, and now the boot stack is placedright at the base of BSS, where any overruns will corrupt the end of the.data section. While it would be possible to work around this by increasingthe size of the boot stack, doing so would affect all x86 systems, andmixed mode systems are a tiny (and shrinking) fraction of the x86 installedbase. So instead, record the firmware stack pointer value when enteringfrom the 32-bit firmware, and switch to this stack every time a EFI bootservice call is made.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-35803",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-35803"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-17 14:15:00 UTC",
			"cve": {
				"text": "CVE-2024-35803",
				"href": "https://ubuntu.com/security/CVE-2024-35803",
				"public": "20240517"
			},
			"public_date_at_usn": "2024-05-17 14:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-6816-1",
				"https://ubuntu.com/security/notices/USN-6817-1",
				"https://ubuntu.com/security/notices/USN-6817-2",
				"https://ubuntu.com/security/notices/USN-6817-3",
				"https://ubuntu.com/security/notices/USN-6878-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000000",
						"comment": "linux: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000040",
						"comment": "linux-hwe: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000070",
						"comment": "linux-kvm: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000030",
						"comment": "linux-aws: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000080",
						"comment": "linux-aws-hwe: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000050",
						"comment": "linux-azure: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000100",
						"comment": "linux-fips package in fips-updates/xenial is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000060",
						"comment": "linux-gcp: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:200767620000010",
						"comment": "linux-gke: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000090",
						"comment": "linux-oracle: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:200767620000030",
						"comment": "linux-oem: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000010",
						"comment": "linux-raspi2: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
