{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.trusty:def:2020255950000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2020-25595 on Ubuntu 14.04 ESM (trusty) - medium.",
    "Description": "An issue was discovered in Xen through 4.14.x. The PCI passthrough code improperly uses register data. Code paths in Xen's MSI handling have been identified that act on unsanitized values read back from device hardware registers. While devices strictly compliant with PCI specifications shouldn't be able to affect these registers, experience shows that it's very common for devices to have out-of-spec \"backdoor\" operations that can affect the result of these reads. A not fully trusted guest may be able to crash Xen, leading to a Denial of Service (DoS) for the entire system. Privilege escalation and information leaks cannot be excluded. All versions of Xen supporting PCI passthrough are affected. Only x86 systems are vulnerable. Arm systems are not vulnerable. Only guests with passed through PCI devices may be able to leverage the vulnerability. Only systems passing through devices with out-of-spec (\"backdoor\") functionality can cause issues. Experience shows that such out-of-spec functionality is common; unless you have reason to believe that your device does not have such functionality, it's better to assume that it does.",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 14.04 ESM"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2020-25595",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-25595"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2020 Canonical Ltd.",
      "PublicDate": "2020-09-23 21:15:00 UTC",
      "Bug": null,
      "cve": {
        "text": "CVE-2020-25595",
        "href": "https://ubuntu.com/security/CVE-2020-25595",
        "public": "20200923",
        "cvss_score": "7.8",
        "cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
        "usns": "5617-1"
      },
      "PublicDateAtUsn": "2020-09-23 21:15:00 UTC",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": "mdeslaur> hypervisor packages are in universe. For issues in the hypervisor, add appropriate tags to each section, ex: Tags_xen: universe-binary"
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.trusty:tst:2017155970000000",
        "comment": "xen: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
      }
    ]
  }
}
