{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.trusty:def:2022236300000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2022-23630 on Ubuntu 14.04 ESM (trusty) - medium.",
    "Description": "Gradle is a build tool with a focus on build automation and support for multi-language development. In some cases, Gradle may skip that verification and accept a dependency that would otherwise fail the build as an untrusted external artifact. This occurs when dependency verification is disabled on one or more configurations and those configurations have common dependencies with other configurations that have dependency verification enabled. If the configuration that has dependency verification disabled is resolved first, Gradle does not verify the common dependencies for the configuration that has dependency verification enabled. Gradle 7.4 fixes that issue by validating artifacts at least once if they are present in a resolved configuration that has dependency verification active. For users who cannot update either do not use `ResolutionStrategy.disableDependencyVerification()` and do not use plugins that use that method to disable dependency verification for a single configuration or make sure resolution of configuration that disable that feature do not happen in builds that resolve configuration where the feature is enabled.",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 14.04 ESM"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2022-23630",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-23630"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2022 Canonical Ltd.",
      "PublicDate": "2022-02-10 20:15:00 UTC",
      "Bug": null,
      "cve": {
        "text": "CVE-2022-23630",
        "href": "https://ubuntu.com/security/CVE-2022-23630",
        "public": "20220210",
        "cvss_score": "7.5",
        "cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H"
      },
      "PublicDateAtUsn": "",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": ""
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.trusty:tst:201661990000000",
        "comment": "gradle: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
      }
    ]
  }
}
