{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.trusty:def:2020155630000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2020-15563 on Ubuntu 14.04 ESM (trusty) - medium.",
    "Description": "An issue was discovered in Xen through 4.13.x, allowing x86 HVM guest OS users to cause a hypervisor crash. An inverted conditional in x86 HVM guests' dirty video RAM tracking code allows such guests to make Xen de-reference a pointer guaranteed to point at unmapped space. A malicious or buggy HVM guest may cause the hypervisor to crash, resulting in Denial of Service (DoS) affecting the entire host. Xen versions from 4.8 onwards are affected. Xen versions 4.7 and earlier are not affected. Only x86 systems are affected. Arm systems are not affected. Only x86 HVM guests using shadow paging can leverage the vulnerability. In addition, there needs to be an entity actively monitoring a guest's video frame buffer (typically for display purposes) in order for such a guest to be able to leverage the vulnerability. x86 PV guests, as well as x86 HVM guests using hardware assisted paging (HAP), cannot leverage the vulnerability.",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 14.04 ESM"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2020-15563",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-15563"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2020 Canonical Ltd.",
      "PublicDate": "2020-07-07 13:15:00 UTC",
      "Bug": null,
      "cve": {
        "text": "CVE-2020-15563",
        "href": "https://ubuntu.com/security/CVE-2020-15563",
        "public": "20200707",
        "cvss_score": "6.5",
        "cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:N/I:N/A:H",
        "usns": "5617-1"
      },
      "PublicDateAtUsn": "2020-07-07 13:15:00 UTC",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": "mdeslaur> hypervisor packages are in universe. For issues in the hypervisor, add appropriate tags to each section, ex: Tags_xen: universe-binary"
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.trusty:tst:2017155970000000",
        "comment": "xen: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
      }
    ]
  }
}
