{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:202243040000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2022-4304 on Ubuntu 14.04 ESM (trusty) - medium.",
		"Description": "A timing based side channel exists in the OpenSSL RSA Decryption implementation which could be sufficient to recover a plaintext across a network in a Bleichenbacher style attack. To achieve a successful decryption an attacker would have to be able to send a very large number of trial messages for decryption. The vulnerability affects all RSA padding modes: PKCS#1 v1.5, RSA-OEAP and RSASVE. For example, in a TLS connection, RSA is commonly used by a client to send an encrypted pre-master secret to the server. An attacker that had observed a genuine connection between a client and a server could use this flaw to send trial messages to the server and record the time taken to process them. After a sufficiently large number of messages the attacker could recover the pre-master secret used for the original connection and thus be able to decrypt the application data sent over that connection.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 14.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-4304",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-4304"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2023 Canonical Ltd.",
			"PublicDate": "2023-02-07",
			"Bug": null,
			"cve": {
				"text": "CVE-2022-4304",
				"href": "https://ubuntu.com/security/CVE-2022-4304",
				"public": "20230207",
				"cvss_score": "5.9",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N",
				"usns": "5844-1"
			},
			"PublicDateAtUsn": "2023-02-07",
			"AssignedTo": "",
			"DiscoveredBy": "Hubert Kario",
			"Crd": "2023-02-07",
			"Ref": null
		}
	},
	"notes": {
		"Note": "mdeslaur> Due to the substantial code changes required to fix this side channel issue and others like it in the 1.0.2 and earlier codebases, we will not be fixing this issue in bionic and earlier to not introduce possible regressions.  The commit was later reverted, and a more simplified fix was used, see: https://git.openssl.org/gitweb/?p=openssl.git;a=commit;h=0372649a943fb23f7f08c7acdbc01464b9df03f0 https://git.openssl.org/gitweb/?p=openssl.git;a=commit;h=3f499b24f3bcd66db022074f7e8b4f6ee266a3ae"
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201757310000000",
						"comment": "edk2: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:202019680000010",
						"comment": "openssl: while related to the CVE in some way, a decision has been made to ignore this issue."
					}
				]
			}
		]
	}
}
