{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:201915430000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2019-1543 on Ubuntu 14.04 ESM (trusty) - low",
		"Description": "ChaCha20-Poly1305 is an AEAD cipher, and requires a unique nonce input forevery encryption operation. RFC 7539 specifies that the nonce value (IV)should be 96 bits (12 bytes). OpenSSL allows a variable nonce length andfront pads the nonce with 0 bytes if it is less than 12 bytes. However italso incorrectly allows a nonce to be set of up to 16 bytes. In this caseonly the last 12 bytes are significant and any additional leading bytes areignored. It is a requirement of using this cipher that nonce values areunique. Messages encrypted using a reused nonce value are susceptible toserious confidentiality and integrity attacks. If an application changesthe default nonce length to be longer than 12 bytes and then makes a changeto the leading bytes of the nonce expecting the new value to be a newunique nonce then such an application could inadvertently encrypt messageswith a reused nonce. Additionally the ignored bytes in a long nonce are notcovered by the integrity guarantee of this cipher. Any application thatrelies on the integrity of these ignored leading bytes of a long nonce maybe further affected. Any OpenSSL internal use of this cipher, including inSSL/TLS, is safe because no such use sets such a long nonce value. Howeveruser applications that use this cipher directly and set a non-default noncelength to be longer than 12 bytes may be vulnerable. OpenSSL versions 1.1.1and 1.1.0 are affected by this issue. Due to the limited scope of affecteddeployments this has been assessed as low severity and therefore we are notcreating new releases at this time. Fixed in OpenSSL 1.1.1c (Affected1.1.1-1.1.1b). Fixed in OpenSSL 1.1.0k (Affected 1.1.0-1.1.0j).\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2019-1543` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nlibssl1.0.0 - 1.0.1f-1ubuntu2.27\nopenssl - 1.0.1f-1ubuntu2.27\nNo subscription required",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 14.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2019-1543",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-1543"
		},
		"advisory": {
			"Severity": "Low",
			"Rights": "Copyright (C) 2019 Canonical Ltd.",
			"PublicDate": "2019-03-06 21:29:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2019-1543",
				"href": "https://ubuntu.com/security/CVE-2019-1543",
				"public": "20190306",
				"cvss_score": "7.4",
				"cvss_vector": "CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201807340000000",
						"comment": "openssl package in trusty, is related to the CVE in some way and has been fixed (note: '1.0.1f-1ubuntu2.27')."
					}
				]
			}
		]
	}
}
