{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2020152500000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2020-15250 on Ubuntu 14.04 ESM (trusty) - medium",
		"Description": "In JUnit4 from version 4.7 and before 4.13.1, the test rule TemporaryFoldercontains a local information disclosure vulnerability. On Unix likesystems, the system's temporary directory is shared between all users onthat system. Because of this, when files and directories are written intothis directory they are, by default, readable by other users on that samesystem. This vulnerability does not allow other users to overwrite thecontents of these directories or files. This is purely an informationdisclosure vulnerability. This vulnerability impacts you if the JUnit testswrite sensitive information, like API keys or passwords, into the temporaryfolder, and the JUnit tests execute in an environment where the OS hasother untrusted users. Because certain JDK file system APIs were only addedin JDK 1.7, this this fix is dependent upon the version of the JDK you areusing. For Java 1.7 and higher users: this vulnerability is fixed in4.13.1. For Java 1.6 and lower users: no patch is available, you must usethe workaround below. If you are unable to patch, or are stuck running onJava 1.6, specifying the `java.io.tmpdir` system environment variable to adirectory that is exclusively owned by the executing user will fix thisvulnerability. For more information, including an example of vulnerablecode, see the referenced GitHub Security Advisory.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 14.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-15250",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-15250"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2020 Canonical Ltd.",
			"PublicDate": "2020-10-12 18:15:00 UTC",
			"Bug": [
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=972231"
			],
			"cve": {
				"text": "CVE-2020-15250",
				"href": "https://ubuntu.com/security/CVE-2020-15250",
				"public": "20201012",
				"cvss_score": "5.5",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N",
				"usns": "4731-1"
			},
			"PublicDateAtUsn": "2020-10-12 18:15:00 UTC",
			"AssignedTo": "pfsmorigo",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": [
				"https://ubuntu.com/security/notices/USN-4731-1"
			]
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:2020152500000000",
						"comment": "junit4 package in trusty/esm is affected and needs fixing."
					}
				]
			}
		]
	}
}
