{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.trusty:def:2021355500000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2021-35550 on Ubuntu 14.04 ESM (trusty) - medium.",
    "Description": "Vulnerability in the Java SE, Oracle GraalVM Enterprise Edition product of Oracle Java SE (component: JSSE). Supported versions that are affected are Java SE: 7u311, 8u301, 11.0.12; Oracle GraalVM Enterprise Edition: 20.3.3 and 21.2.0. Difficult to exploit vulnerability allows unauthenticated attacker with network access via TLS to compromise Java SE, Oracle GraalVM Enterprise Edition. Successful attacks of this vulnerability can result in unauthorized access to critical data or complete access to all Java SE, Oracle GraalVM Enterprise Edition accessible data. Note: This vulnerability applies to Java deployments, typically in clients running sandboxed Java Web Start applications or sandboxed Java applets, that load and run untrusted code (e.g., code that comes from the internet) and rely on the Java sandbox for security. This vulnerability can also be exploited by using APIs in the specified Component, e.g., through a web service which supplies data to the APIs. CVSS 3.1 Base Score 5.9 (Confidentiality impacts). CVSS Vector: (CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N). Asaf Greenholts discovered that OpenJDK preferred certain weak ciphers by default. An attacker could possibly use this to expose sensitive information.",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 14.04 ESM"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2021-35550",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-35550"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2021 Canonical Ltd.",
      "PublicDate": "2021-10-20 11:16:00 UTC",
      "Bug": [
        "https://bugs.openjdk.java.net/browse/JDK-8163326"
      ],
      "cve": {
        "text": "CVE-2021-35550",
        "href": "https://ubuntu.com/security/CVE-2021-35550",
        "public": "20211020",
        "cvss_score": "5.9",
        "cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N",
        "usns": "5202-1"
      },
      "PublicDateAtUsn": "2021-10-20 11:16:00 UTC",
      "AssignedTo": "",
      "DiscoveredBy": "Asaf Greenholts",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": "sbeattie> the fix for this issue changes OpenJDK to prioritize ciphers with forward secrecy. See the JDK-8163326 bug for more details."
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.trusty:tst:201552360000000",
        "comment": "icedtea-web: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
      }
    ]
  }
}
