{
	"class": "patch",
	"id": "oval:com.ubuntu.hirsute:def:51281000000",
	"version": "1",
	"metadata": {
		"title": "5128-1 -- Ceph vulnerabilities",
		"description": "Goutham Pacha Ravi, Jahson Babel, and John Garbutt discovered that user credentials in Ceph could be manipulated in certain environments. An attacker could use this to gain unintended access to resources. This issue only affected Ubuntu 18.04 LTS. (CVE-2020-27781)  It was discovered that Ceph contained an authentication flaw, leading to key reuse. An attacker could use this to cause a denial of service or possibly impersonate another user. This issue only affected Ubuntu 21.04. (CVE-2021-20288)  Sergey Bobrov discovered that the Ceph dashboard was susceptible to a cross-site scripting attack. An attacker could use this to expose sensitive information or gain unintended access. This issue only affected Ubuntu 21.04. (CVE-2021-3509)  Sergey Bobrov discovered that Ceph's RadosGW (Ceph Object Gateway) allowed the injection of HTTP headers in responses to CORS requests. An attacker could use this to violate system integrity. (CVE-2021-3524)  It was discovered that Ceph's RadosGW (Ceph Object Gateway) did not properly handle GET requests for swift URLs in some situations, leading to an application crash. An attacker could use this to cause a denial of service. (CVE-2021-3531)",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 21.04"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5128-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5128-1"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2020-27781",
				"ref_url": "https://ubuntu.com/security/CVE-2020-27781"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2021-3524",
				"ref_url": "https://ubuntu.com/security/CVE-2021-3524"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2021-3531",
				"ref_url": "https://ubuntu.com/security/CVE-2021-3531"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2021-20288",
				"ref_url": "https://ubuntu.com/security/CVE-2021-20288"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2021-3509",
				"ref_url": "https://ubuntu.com/security/CVE-2021-3509"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "Medium",
			"issued": {
				"date": "2021-11-01"
			}
		}
	},
	"criteria": {
		"operator": "OR",
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.hirsute:tst:512810000000",
				"comment": "Interim Release"
			}
		]
	}
}
