{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2024471740000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-47174 on Ubuntu Pro FIPS-preview 22.04 LTS (jammy) - medium",
		"description": "Nix is a package manager for Linux and other Unix systems. Starting inversion 1.11 and prior to versions 2.18.8 and 2.24.8, `<nix/fetchurl.nix>`did not verify TLS certificates on HTTPS connections. This could lead toconnection details such as full URLs or credentials leaking in case of aman-in-the-middle (MITM) attack. `<nix/fetchurl.nix>` is also known as thebuiltin derivation builder `builtin:fetchurl`. It's not to be confused withthe evaluation-time function `builtins.fetchurl`, which was not affected bythis issue. A user may be affected by the risk of leaking credentials ifthey have a `netrc` file for authentication, or rely on derivations with`impureEnvVars` set to use credentials from the environment. In addition,the commonplace trust-on-first-use (TOFU) technique of updatingdependencies by specifying an invalid hash and obtaining it from a remotestore was also vulnerable to a MITM injecting arbitrary store objects. Thisalso applied to the impure derivations experimental feature. Note that thismay also happen when using Nixpkgs fetchers to obtain new hashes when notusing the fake hash method, although that mechanism is not implemented inNix itself but rather in Nixpkgs using a fixed-output derivation. Thebehavior was introduced in version 1.11 to make it consistent with theNixpkgs `pkgs.fetchurl` and to make `<nix/fetchurl.nix>` work in thederivation builder sandbox, which back then did not have access to the CAbundles by default. Nowadays, CA bundles are bind-mounted on Linux. Thisissue has been fixed in Nix 2.18.8 and 2.24.8. As a workaround, implement(authenticated) fetching with `pkgs.fetchurl` from Nixpkgs, using`impureEnvVars` and `curlOpts` as needed.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS-preview 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-47174",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-47174"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-09-27",
			"cve": {
				"text": "CVE-2024-47174",
				"href": "https://ubuntu.com/security/CVE-2024-47174",
				"public": "20240927"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2024272970000000",
						"comment": "nix package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
