{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.noble:def:2024525950000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-52595 on Ubuntu 24.04 LTS (noble) - medium",
		"description": "lxml_html_clean is a project for HTML cleaning functionalities copied from`lxml.html.clean`. Prior to version 0.4.0, the HTML Parser in lxml does notproperly handle context-switching for special HTML tags such as `<svg>`,`<math>` and `<noscript>`. This behavior deviates from how web browsersparse and interpret such tags. Specifically, content in CSS comments isignored by lxml_html_clean but may be interpreted differently by webbrowsers, enabling malicious scripts to bypass the cleaning process. Thisvulnerability could lead to Cross-Site Scripting (XSS) attacks,compromising the security of users relying on lxml_html_clean in defaultconfiguration for sanitizing untrusted HTML content. Users employing theHTML cleaner in a security-sensitive context should upgrade to lxml 0.4.0,which addresses this issue. As a temporary mitigation, users can configurelxml_html_clean with the following settings to prevent the exploitation ofthis vulnerability. Via `remove_tags`, one may specify tags to remove -their content is moved to their parents' tags. Via `kill_tags`, one mayspecify tags to be removed completely. Via `allow_tags`, one may restrictthe set of permissible tags, excluding context-switching tags like `<svg>`,`<math>` and `<noscript>`.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-52595",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-52595"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-11-19 22:15:00 UTC",
			"cve": {
				"text": "CVE-2024-52595",
				"href": "https://ubuntu.com/security/CVE-2024-52595",
				"public": "20241119"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.noble:tst:2024525950000000",
						"comment": "lxml-html-clean package in noble is affected and may need fixing."
					}
				]
			}
		]
	}
}
