{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2024266590000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26659 on Ubuntu 16.04 FIPS Compliant (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: xhci:handle isoc Babble and Buffer Overrun events properly xHCI 4.9 explicitlyforbids assuming that the xHC has released its ownership of a multi-TRB TDwhen it reports an error on one of the early TRBs. Yet the driver makessuch assumption and releases the TD, allowing the remaining TRBs to befreed or overwritten by new TDs. The xHC should also report completion ofthe final TRB due to its IOC flag being set by us, regardless of priorerrors. This event cannot be recognized if the TD has already been freedearlier, resulting in \"Transfer event TRB DMA ptr not part of current TD\"error message. Fix this by reusing the logic for processing isocTransaction Errors. This also handles hosts which fail to report the finalcompletion. Fix transfer length reporting on Babble errors. They may becaused by device malfunction, no guarantee that the buffer has been filled.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26659",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-26659"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-04-02 07:15:00 UTC",
			"cve": {
				"text": "CVE-2024-26659",
				"href": "https://ubuntu.com/security/CVE-2024-26659",
				"public": "20240402"
			},
			"public_date_at_usn": "2024-04-02 07:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-6820-1",
				"https://ubuntu.com/security/notices/USN-6821-1",
				"https://ubuntu.com/security/notices/USN-6821-2"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201585530000000",
						"comment": "linux-fips package in fips-updates/xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
