{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2021327620000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-32762 on Ubuntu 16.04 FIPS Compliant (xenial) - negligible.",
		"Description": "Redis is an open source, in-memory database that persists on disk. The redis-cli command line tool and redis-sentinel service may be vulnerable to integer overflow when parsing specially crafted large multi-bulk network replies. This is a result of a vulnerability in the underlying hiredis library which does not perform an overflow check before calling the calloc() heap allocation function. This issue only impacts systems with heap allocators that do not perform their own overflow checks. Most modern systems do and are therefore not likely to be affected. Furthermore, by default redis-sentinel uses the jemalloc allocator which is also not vulnerable. The problem is fixed in Redis versions 6.2.6, 6.0.16 and 5.0.14.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-32762",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-32762"
		},
		"advisory": {
			"Severity": "Negligible",
			"Rights": "Copyright (C) 2021 Canonical Ltd.",
			"PublicDate": "2021-10-04 18:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2021-32762",
				"href": "https://ubuntu.com/security/CVE-2021-32762",
				"public": "20211004",
				"cvss_score": "8.8",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": "seth-arnold> this appears to be about systems with a non-functional calloc() call. This feels like it should be a bug report abuot those allocator libraries with a broken calloc() instead. I assume this is not actually applicable to anything we ship."
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:202071050000000",
						"comment": "hiredis: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2020117240000000",
						"comment": "nginx: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2021327620000020",
						"comment": "python-hiredis: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2020141470000000",
						"comment": "redis: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2021327620000040",
						"comment": "rspamd: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2021327620000050",
						"comment": "webdis: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
