{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2024386000000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-38600 on Ubuntu 16.04 FIPS Compliant (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: ALSA:Fix deadlocks with kctl removals at disconnection In snd_card_disconnect(),we set card->shutdown flag at the beginning, call callbacks and do sync forcard->power_ref_sleep waiters at the end. The callback may delete a kctlelement, and this can lead to a deadlock when the device was in thesuspended state. Namely: * A process waits for the power up atsnd_power_ref_and_wait() in snd_ctl_info() or read/write() insidecard->controls_rwsem. * The system gets disconnected meanwhile, and thedriver tries to delete a kctl via snd_ctl_remove*(); it tries to takecard->controls_rwsem again, but this is already locked by the above. Sincethe sleeper isn't woken up, this deadlocks. An easy fix is to wake upsleepers before processing the driver disconnect callbacks but right aftersetting the card->shutdown flag. Then all sleepers will abort immediately,and the code flows again. So, basically this patch moves the wait_event()call at the right timing. While we're at it, just to be sure, callwait_event_all() instead of wait_event(), although we don't use exclusiveevents on this queue for now.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-38600",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-38600"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-06-19 14:15:00 UTC",
			"cve": {
				"text": "CVE-2024-38600",
				"href": "https://ubuntu.com/security/CVE-2024-38600",
				"public": "20240619"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201585530000000",
						"comment": "linux-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					}
				]
			}
		]
	}
}
