{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2021412440000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-41244 on Ubuntu 16.04 FIPS Compliant (xenial) - medium.",
		"Description": "Grafana is an open-source platform for monitoring and observability. In affected versions when the fine-grained access control beta feature is enabled and there is more than one organization in the Grafana instance admins are able to access users from other organizations. Grafana 8.0 introduced a mechanism which allowed users with the Organization Admin role to list, add, remove, and update users’ roles in other organizations in which they are not an admin. With fine-grained access control enabled, organization admins can list, add, remove and update users' roles in another organization, where they do not have organization admin role. All installations between v8.0 and v8.2.3 that have fine-grained access control beta enabled and more than one organization should be upgraded as soon as possible. If you cannot upgrade, you should turn off the fine-grained access control using a feature flag.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-41244",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-41244"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2021 Canonical Ltd.",
			"PublicDate": "2021-11-15 20:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2021-41244",
				"href": "https://ubuntu.com/security/CVE-2021-41244",
				"public": "20211115",
				"cvss_score": "7.2",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": "seth-arnold> Xenial's grafana pacakge doesn't appear to have fine grained acls"
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.xenial:tst:201810008160000000",
				"comment": "grafana: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
			}
		]
	}
}
