{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2024269090000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26909 on Ubuntu 16.04 FIPS Compliant (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: soc:qcom: pmic_glink_altmode: fix drm bridge use-after-free A recent DRM seriespurporting to simplify support for \"transparent bridges\" and handling ofprobe deferrals ironically exposed a use-after-free issue onpmic_glink_altmode probe deferral. This has manifested itself as thedisplay subsystem occasionally failing to initialise and NULL-pointerdereferences during boot of machines like the Lenovo ThinkPad X13s.Specifically, the dp-hpd bridge is currently registered before allresources have been acquired which means that it can also be deregisteredon probe deferrals. In the meantime there is a race window where the newaux bridge driver (or PHY driver previously) may have looked up the dp-hpdbridge and stored a (non-reference-counted) pointer to the bridge which isabout to be deallocated. When the display controller is later initialised,this triggers a use-after-free when attaching the bridges: dp -> aux ->dp-hpd (freed) which may, for example, result in the freed bridge failingto attach: [drm:drm_bridge_attach [drm]] *ERROR* failed to attach bridge/soc@0/phy@88eb000 to encoder TMDS-31: -16 or a NULL-pointer dereference:Unable to handle kernel NULL pointer dereference at virtual address0000000000000000 ... Call trace: drm_bridge_attach+0x70/0x1a8 [drm]drm_aux_bridge_attach+0x24/0x38 [aux_bridge] drm_bridge_attach+0x80/0x1a8[drm] dp_bridge_init+0xa8/0x15c [msm] msm_dp_modeset_init+0x28/0xc4 [msm]The DRM bridge implementation is clearly fragile and implicitly built onthe assumption that bridges may never go away. In this case, the fix is tomove the bridge registration in the pmic_glink_altmode driver to after allresources have been looked up. Incidentally, with the new dp-hpd bridgeimplementation, which registers child devices, this is also a requirementdue to a long-standing issue in driver core that can otherwise lead to aprobe deferral loop (see commit fbc35b45f9f6 (\"Add documentation on meaningof -EPROBE_DEFER\")). [DB: slightly fixed commit message by adding the word'commit']\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2024-26909` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nlinux-image-4.4.0-1003-fips - 4.4.0-1003.3\nlinux-image-extra-4.4.0-1003-fips - 4.4.0-1003.3\nlinux-image-hmac-4.4.0-1003-fips - 4.4.0-1003.3\nAvailable with Ubuntu Pro: https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26909",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-26909"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-04-17 11:15:00 UTC",
			"cve": {
				"text": "CVE-2024-26909",
				"href": "https://ubuntu.com/security/CVE-2024-26909",
				"public": "20240417",
				"cvss_score": "5.5",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:200636350000080",
						"comment": "linux-fips package in fips-updates/xenial, is related to the CVE in some way and has been fixed (note: '4.4.0-1003.3')."
					}
				]
			}
		]
	}
}
