{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2024358250000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-35825 on Ubuntu 16.04 FIPS Compliant (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: usb:gadget: ncm: Fix handling of zero block length packets While connecting toa Linux host with CDC_NCM_NTB_DEF_SIZE_TX set to 65536, it has beenobserved that we receive short packets, which come at interval of 5-10seconds sometimes and have block length zero but still contain 1-2 validdatagrams present. According to the NCM spec: \"If wBlockLength = 0x0000,the block is terminated by a short packet. In this case, the USB transfermust still be shorter than dwNtbInMaxSize or dwNtbOutMaxSize. If exactlydwNtbInMaxSize or dwNtbOutMaxSize bytes are sent, and the size is amultiple of wMaxPacketSize for the given pipe, then no ZLP shall be sent.wBlockLength= 0x0000 must be used with extreme care, because of thepossibility that the host and device may get out of sync, and because oftest issues. wBlockLength = 0x0000 allows the sender to reduce latency bystarting to send a very large NTB, and then shortening it when the senderdiscovers that there’s not sufficient data to justify sending a large NTB\"However, there is a potential issue with the current implementation, as itchecks for the occurrence of multiple NTBs in a single giveback byverifying if the leftover bytes to be processed is zero or not. If theblock length reads zero, we would process the same NTB infintely becausethe leftover bytes is never zero and it leads to a crash. Fix this bybailing out if block length reads zero.\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2024-35825` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nlinux-image-4.4.0-1003-fips - 4.4.0-1098.105\nlinux-image-extra-4.4.0-1003-fips - 4.4.0-1098.105\nlinux-image-hmac-4.4.0-1003-fips - 4.4.0-1098.105\nAvailable with Ubuntu Pro: https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-35825",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-35825"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-17 14:15:00 UTC",
			"cve": {
				"text": "CVE-2024-35825",
				"href": "https://ubuntu.com/security/CVE-2024-35825",
				"public": "20240517"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2017109110000000",
						"comment": "linux-fips package in fips-updates/xenial, is related to the CVE in some way and has been fixed (note: '4.4.0-1098.105')."
					}
				]
			}
		]
	}
}
