{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.xenial:def:2022236010000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2022-23601 on Ubuntu 16.04 FIPS Compliant (xenial) - medium.",
    "Description": "Symfony is a PHP framework for web and console applications and a set of reusable PHP components. The Symfony form component provides a CSRF protection mechanism by using a random token injected in the form and using the session to store and control the token submitted by the user. When using the FrameworkBundle, this protection can be enabled or disabled with the configuration. If the configuration is not specified, by default, the mechanism is enabled as long as the session is enabled. In a recent change in the way the configuration is loaded, the default behavior has been dropped and, as a result, the CSRF protection is not enabled in form when not explicitly enabled, which makes the application sensible to CSRF attacks. This issue has been resolved in the patch versions listed and users are advised to update. There are no known workarounds for this issue.",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 16.04 FIPS Compliant"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2022-23601",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-23601"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2022 Canonical Ltd.",
      "PublicDate": "2022-02-01 13:15:00 UTC",
      "Bug": null,
      "cve": {
        "text": "CVE-2022-23601",
        "href": "https://ubuntu.com/security/CVE-2022-23601",
        "public": "20220201",
        "cvss_score": "8.8",
        "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H"
      },
      "PublicDateAtUsn": "",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": ""
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.xenial:tst:201644230000000",
        "comment": "symfony: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
      }
    ]
  }
}
