{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2023526250000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-52625 on Ubuntu 16.04 FIPS Compliant (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:drm/amd/display: Refactor DMCUB enter/exit idle interface[Why]We can hang in place trying to send commands when the DMCUB isn'tpowered on.[How]We need to exit out of the idle state prior to sending a command,but the process that performs the exit also invokes a command itself.Fixing this issue involves the following:1. Using a software state to track whether or not we need to start   the process to exit idle or notify idle.It's possible for the hardware to have exited an idle state withoutdriver knowledge, but entering one is always restricted to a driverallow - which makes the SW state vs HW state mismatch issue purely oneof optimization, which should seldomly be hit, if at all.2. Refactor any instances of exit/notify idle to use a single wrapper   that maintains this SW state.This works simialr to dc_allow_idle_optimizations, but works at theDMCUB level and makes sure the state is marked prior to any notify/exitidle so we don't enter an infinite loop.3. Make sure we exit out of idle prior to sending any commands or   waiting for DMCUB idle.This patch takes care of 1/2. A future patch will take care of wrappingDMCUB command submission with calls to this new interface.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-52625",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-52625"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-03-26 18:15:00 UTC",
			"cve": {
				"text": "CVE-2023-52625",
				"href": "https://ubuntu.com/security/CVE-2023-52625",
				"public": "20240326"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201585530000000",
						"comment": "linux-fips package in fips-updates/xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
