{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2021365630000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-36563 on Ubuntu 16.04 FIPS Compliant (xenial) - low.",
		"Description": "The CheckMK management web console (versions 1.5.0 to 2.0.0) does not sanitise user input in various parameters of the WATO module. This allows an attacker to open a backdoor on the device with HTML content and interpreted by the browser (such as JavaScript or other client-side scripts), the XSS payload will be triggered when the user accesses some specific sections of the application. In the same sense a very dangerous potential way would be when an attacker who has the monitor role (not administrator) manages to get a stored XSS to steal the secretAutomation (for the use of the API in administrator mode) and thus be able to create another administrator user who has high privileges on the CheckMK monitoring web console. Another way is that persistent XSS allows an attacker to modify the displayed content or change the victim's information. Successful exploitation requires access to the web management interface, either with valid credentials or with a hijacked session.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-36563",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-36563"
		},
		"advisory": {
			"Severity": "Low",
			"Rights": "Copyright (C) 2021 Canonical Ltd.",
			"PublicDate": "2021-07-26 18:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2021-36563",
				"href": "https://ubuntu.com/security/CVE-2021-36563",
				"public": "20210726",
				"cvss_score": "5.4",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:L/A:N",
				"usns": "5527-1"
			},
			"PublicDateAtUsn": "2021-07-26 18:15:00 UTC",
			"AssignedTo": "0xnishit",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": "0xnishit> fix: https://github.com/tribe29/checkmk/commit/821f99e7ca3dcb41131df25023390a71ef31ad1b"
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.xenial:tst:2017115070000000",
				"comment": "check-mk: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
			}
		]
	}
}
