{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2022234710000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2022-23471 on Ubuntu 16.04 FIPS Compliant (xenial) - medium.",
		"Description": "containerd is an open source container runtime. A bug was found in containerd's CRI implementation where a user can exhaust memory on the host. In the CRI stream server, a goroutine is launched to handle terminal resize events if a TTY is requested. If the user's process fails to launch due to, for example, a faulty command, the goroutine will be stuck waiting to send without a receiver, resulting in a memory leak. Kubernetes and crictl can both be configured to use containerd's CRI implementation and the stream server is used for handling container IO. This bug has been fixed in containerd 1.6.12 and 1.5.16. Users should update to these versions to resolve the issue. Users unable to upgrade should ensure that only trusted images and commands are used and that only trusted users have permissions to execute commands in running containers.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-23471",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-23471"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2022 Canonical Ltd.",
			"PublicDate": "2022-12-08",
			"Bug": null,
			"cve": {
				"text": "CVE-2022-23471",
				"href": "https://ubuntu.com/security/CVE-2022-23471",
				"public": "20221208",
				"cvss_score": "6.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
				"usns": "5776-1"
			},
			"PublicDateAtUsn": "2022-12-08",
			"AssignedTo": "litios",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.xenial:tst:2021213340000000",
				"comment": "containerd: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
			}
		]
	}
}
