{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2017151310000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2017-15131 on Ubuntu 16.04 FIPS Compliant (xenial) - low.",
		"Description": "It was found that system umask policy is not being honored when creating XDG user directories, since Xsession sources xdg-user-dirs.sh before setting umask policy. This only affects xdg-user-dirs before 0.15.5 as shipped with Red Hat Enterprise Linux.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2017-15131",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-15131"
		},
		"advisory": {
			"Severity": "Low",
			"Rights": "Copyright (C) 2018 Canonical Ltd.",
			"PublicDate": "2018-01-09 21:29:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2017-15131",
				"href": "https://ubuntu.com/security/CVE-2017-15131",
				"public": "20180109",
				"cvss_score": "7.8",
				"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": "seth-arnold> This feels like a fundamental misunderstanding of Unix model to assume that every task run on behalf of a user will be started as a child process of bash or sh run as an interactive or login shell. Environments that want a specific umask set for users should use the pam_umask(8) module as part of the login process. Environments that need a specific umask set for compliance reasons should investigate the feasibility of preparing a single-purpose LSM or seccomp jail interface of some sort. rodrigo-zaiden> pam_umask is being used to set umask when an interactive session is started, so Ubuntu is not affected by this CVE."
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.xenial:tst:2017151310000000",
				"comment": "xdg-user-dirs: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needed')."
			}
		]
	}
}
