{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2023524520000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-52452 on Ubuntu 16.04 FIPS Compliant (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: bpf:Fix accesses to uninit stack slots Privileged programs are supposed to beable to read uninitialized stack memory (ever since 6715df8d5) but, beforethis patch, these accesses were permitted inconsistently. In particular,accesses were permitted above state->allocated_stack, but not below it. Inother words, if the stack was already \"large enough\", the access waspermitted, but otherwise the access was rejected instead of being allowedto \"grow the stack\". This undesired rejection was happening in two places:- in check_stack_slot_within_bounds() - in check_stack_range_initialized()This patch arranges for these accesses to be permitted. A bunch of teststhat were relying on the old rejection had to change; all of them werechanged to add also run unprivileged, in which case the old behaviorpersists. One tests couldn't be updated - global_func16 - because it can'trun unprivileged for other reasons. This patch also fixes the tracking ofthe stack size for variable-offset reads. This second fix is bundled in thesame commit as the first one because they're inter-related. Before thispatch, writes to the stack using registers containing a variable offset (asopposed to registers with fixed, known values) were not properlycontributing to the function's needed stack size. As a result, it waspossible for a program to verify, but then to attempt to read out-of-boundsdata at runtime because a too small stack had been allocated for it. Eachfunction tracks the size of the stack it needs inbpf_subprog_info.stack_depth, which is maintained by update_stack_depth().For regular memory accesses, check_mem_access() was callingupdate_state_depth() but it was passing in only the fixed part of theoffset register, ignoring the variable offset. This was incorrect; theminimum possible value of that register should be used instead. Thistracking is now fixed by centralizing the tracking of stack size ingrow_stack_state(), and by lifting the calls to grow_stack_state() tocheck_stack_access_within_bounds() as suggested by Andrii. The code is nowsimpler and more convincingly tracks the correct maximum stack size.check_stack_range_initialized() can now rely on enough stack having beenallocated for the access; this helps with the fix for the first issue. Afew tests were changed to also check the stack depth computation. The onethat fails without this patch isverifier_var_off:stack_write_priv_vs_unpriv.\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2023-52452` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nlinux-image-4.4.0-1003-fips - 4.4.0-1003.3\nlinux-image-extra-4.4.0-1003-fips - 4.4.0-1003.3\nlinux-image-hmac-4.4.0-1003-fips - 4.4.0-1003.3\nAvailable with Ubuntu Pro: https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-52452",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-52452"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-02-22 17:15:00 UTC",
			"cve": {
				"text": "CVE-2023-52452",
				"href": "https://ubuntu.com/security/CVE-2023-52452",
				"public": "20240222",
				"cvss_score": "7.8",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
				"usns": "6818-1,6819-1,6818-2,6819-2,6819-3,6818-3,6818-4,6819-4"
			},
			"public_date_at_usn": "2024-02-22 17:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-6818-1",
				"https://ubuntu.com/security/notices/USN-6819-1",
				"https://ubuntu.com/security/notices/USN-6818-2",
				"https://ubuntu.com/security/notices/USN-6819-2",
				"https://ubuntu.com/security/notices/USN-6819-3",
				"https://ubuntu.com/security/notices/USN-6818-3",
				"https://ubuntu.com/security/notices/USN-6818-4",
				"https://ubuntu.com/security/notices/USN-6819-4"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000000",
						"comment": "linux: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000040",
						"comment": "linux-hwe: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000070",
						"comment": "linux-kvm: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000030",
						"comment": "linux-aws: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000080",
						"comment": "linux-aws-hwe: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000050",
						"comment": "linux-azure: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:200636350000080",
						"comment": "linux-fips package in fips-updates/xenial, is related to the CVE in some way and has been fixed (note: '4.4.0-1003.3')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000060",
						"comment": "linux-gcp: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:200767620000010",
						"comment": "linux-gke: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000090",
						"comment": "linux-oracle: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:200767620000030",
						"comment": "linux-oem: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000010",
						"comment": "linux-raspi2: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000020",
						"comment": "linux-snapdragon: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
