{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:202312550000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-1255 on Ubuntu 16.04 FIPS Compliant (xenial) - low",
		"description": "Issue summary: The AES-XTS cipher decryption implementation for 64 bit ARMplatform contains a bug that could cause it to read past the input buffer,leading to a crash. Impact summary: Applications that use the AES-XTSalgorithm on the 64 bit ARM platform can crash in rare circumstances. TheAES-XTS algorithm is usually used for disk encryption. The AES-XTS cipherdecryption implementation for 64 bit ARM platform will read past the end ofthe ciphertext buffer if the ciphertext size is 4 mod 5 in 16 byte blocks,e.g. 144 bytes or 1024 bytes. If the memory after the ciphertext buffer isunmapped, this will trigger a crash which results in a denial of service.If an attacker can control the size and location of the ciphertext bufferbeing decrypted by an application using AES-XTS on 64 bit ARM, theapplication is affected. This is fairly unlikely making this issue a Lowseverity one.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-1255",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1255"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-04-20 17:15:00 UTC",
			"cve": {
				"text": "CVE-2023-1255",
				"href": "https://ubuntu.com/security/CVE-2023-1255",
				"public": "20230420",
				"cvss_score": "5.9",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H",
				"usns": "6119-1"
			},
			"public_date_at_usn": "2023-04-20 17:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-6119-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201757310000000",
						"comment": "edk2: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
