{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2024359560000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-35956 on Ubuntu 16.04 FIPS Compliant (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: btrfs:qgroup: fix qgroup prealloc rsv leak in subvolume operations Createsubvolume, create snapshot and delete subvolume all usebtrfs_subvolume_reserve_metadata() to reserve metadata for the changes doneto the parent subvolume's fs tree, which cannot be mediated in the normalway via start_transaction. When quota groups (squota or qgroups) areenabled, this reserves qgroup metadata of type PREALLOC. Once the operationis associated to a transaction, we convert PREALLOC to PERTRANS, which getscleared in bulk at the end of the transaction. However, the error paths ofthese three operations were not implementing this lifecycle correctly. Theyunconditionally converted the PREALLOC to PERTRANS in a generic cleanupstep regardless of errors or whether the operation was fully associated toa transaction or not. This resulted in error paths occasionally convertingthis rsv to PERTRANS without calling record_root_in_trans successfully,which meant that unless that root got recorded in the transaction by someother thread, the end of the transaction would not free that root'sPERTRANS, leaking it. Ultimately, this resulted in hitting a WARN inCONFIG_BTRFS_DEBUG builds at unmount for the leaked reservation. The fix isto ensure that every qgroup PREALLOC reservation observes the followingproperties: 1. any failure before record_root_in_trans is calledsuccessfully results in freeing the PREALLOC reservation. 2. afterrecord_root_in_trans, we convert to PERTRANS, and now the transaction ownsfreeing the reservation. This patch enforces those properties on the threeoperations. Without it, generic/269 with squotas enabled at mkfs time wouldfail in ~5-10 runs on my system. With this patch, it ran successfully 1000times in a row.\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2024-35956` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nlinux-image-4.4.0-1003-fips - 4.4.0-1003.3\nlinux-image-extra-4.4.0-1003-fips - 4.4.0-1003.3\nlinux-image-hmac-4.4.0-1003-fips - 4.4.0-1003.3\nAvailable with Ubuntu Pro: https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-35956",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-35956"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-20 10:15:00 UTC",
			"cve": {
				"text": "CVE-2024-35956",
				"href": "https://ubuntu.com/security/CVE-2024-35956",
				"public": "20240520"
			},
			"public_date_at_usn": "2024-05-20 10:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-6893-1",
				"https://ubuntu.com/security/notices/USN-6893-2"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:200636350000080",
						"comment": "linux-fips package in fips-updates/xenial, is related to the CVE in some way and has been fixed (note: '4.4.0-1003.3')."
					}
				]
			}
		]
	}
}
