{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2019184210000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2019-18421 on Ubuntu 16.04 FIPS Compliant (xenial) - medium",
		"description": "An issue was discovered in Xen through 4.12.x allowing x86 PV guest OSusers to gain host OS privileges by leveraging race conditions in pagetablepromotion and demotion operations. There are issues with restartable PVtype change operations. To avoid using shadow pagetables for PV guests, Xenexposes the actual hardware pagetables to the guest. In order to preventthe guest from modifying these page tables directly, Xen keeps track of howpages are used using a type system; pages must be \"promoted\" before beingused as a pagetable, and \"demoted\" before being used for any other type.Xen also allows for \"recursive\" promotions: i.e., an operating systempromoting a page to an L4 pagetable may end up causing pages to be promotedto L3s, which may in turn cause pages to be promoted to L2s, and so on.These operations may take an arbitrarily large amount of time, and so mustbe re-startable. Unfortunately, making recursive pagetable promotion anddemotion operations restartable is incredibly complicated, and the codecontains several races which, if triggered, can cause Xen to drop or retainextra type counts, potentially allowing guests to get write access toin-use pagetables. A malicious PV guest administrator may be able toescalate their privilege to that of the host. All x86 systems withuntrusted PV guests are vulnerable. HVM and PVH guests cannot exercise thisvulnerability.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2019-18421",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2019-18421"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2019 Canonical Ltd.",
			"public_date": "2019-10-31 14:15:00 UTC",
			"cve": {
				"text": "CVE-2019-18421",
				"href": "https://ubuntu.com/security/CVE-2019-18421",
				"public": "20191031",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2017155970000000",
						"comment": "xen: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needs-triage')."
					}
				]
			}
		]
	}
}
