{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2023527590000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-52759 on Ubuntu 16.04 FIPS Compliant (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: gfs2:ignore negated quota changes When lots of quota changes are made, there maybe cases in which an inode's quota information is increased and thendecreased, such as when blocks are added to a file, then deleted from it.If the timing is right, function do_qc can add pending quota changes to atransaction, then later, another call to do_qc can negate those changes,resulting in a net gain of 0. The quota_change information is recorded inthe qc buffer (and qd element of the inode as well). The buffer is added tothe transaction by the first call to do_qc, but a subsequent call changesthe value from non-zero back to zero. At that point it's too late to removethe buffer_head from the transaction. Later, when the quota sync code iscalled, the zero-change qd element is discovered and flagged as an assertwarning. If the fs is mounted with errors=panic, the kernel will panic.This is usually seen when files are truncated and the quota changes arenegated by punch_hole/truncate which uses gfs2_quota_hold andgfs2_quota_unhold rather than block allocations that use gfs2_quota_lockand gfs2_quota_unlock which automatically do quota sync. This patch solvesthe problem by adding a check to qd_check_sync such that net-zero quotachanges already added to the transaction are no longer deemed necessary tobe synced, and skipped. In this case references are taken for the qd andthe slot from do_qc so those need to be put. The normal sequence of eventsfor a normal non-zero quota change is as follows: gfs2_quota_change do_qcqd_hold slot_hold Later, when the changes are to be synced: gfs2_quota_syncqd_fish qd_check_sync gets qd ref via lockref_get_not_dead do_syncdo_qc(QC_SYNC) qd_put lockref_put_or_lock qd_unlock qd_putlockref_put_or_lock In the net-zero change case, we add a check toqd_check_sync so it puts the qd and slot references acquired ingfs2_quota_change and skip the unneeded sync.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-52759",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-52759"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-21 16:15:00 UTC",
			"cve": {
				"text": "CVE-2023-52759",
				"href": "https://ubuntu.com/security/CVE-2023-52759",
				"public": "20240521"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201585530000000",
						"comment": "linux-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					}
				]
			}
		]
	}
}
