{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2021475530000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-47553 on Ubuntu 16.04 FIPS Compliant (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:sched/scs: Reset task stack state in bringup_cpu() To hot unplug a CPU, theidle task on that CPU calls a few layers of C code before finally leavingthe kernel. When KASAN is in use, poisoned shadow is left around for eachof the active stack frames, and when shadow call stacks are in use. Whenshadow call stacks (SCS) are in use the task's saved SCS SP is leftpointing at an arbitrary point within the task's shadow call stack. When aCPU is offlined than onlined back into the kernel, this stale state canadversely affect execution. Stale KASAN shadow can alias new stackframesand result in bogus KASAN warnings. A stale SCS SP is effectively a memoryleak, and prevents a portion of the shadow call stack being used. Across anumber of hotplug cycles the idle task's entire shadow call stack canbecome unusable. We previously fixed the KASAN issue in commit:e1b77c92981a5222 (\"sched/kasan: remove stale KASAN poison after hotplug\")... by removing any stale KASAN stack poison immediately prior to onlininga CPU. Subsequently in commit: f1a0a376ca0c4ef1 (\"sched/core: Initializethe idle task with preemption disabled\") ... the refactoring left the KASANand SCS cleanup in one-time idle thread initialization code rather thansomething invoked prior to each CPU being onlined, breaking both as above.We fixed SCS (but not KASAN) in commit: 63acd42c0d4942f7 (\"sched/scs: Resetthe shadow stack when idle_task_exit\") ... but as this runs in the contextof the idle task being offlined it's potentially fragile. To fix theseconsistently and more robustly, reset the SCS SP and KASAN shadow of aCPU's idle task immediately before we online that CPU in bringup_cpu().This ensures the idle task always has a consistent state when it isrunning, and removes the need to so so when exiting an idle task. Wheneverany thread is created, dup_task_struct() will give the task a stack whichis free of KASAN shadow, and initialize the task's SCS SP, so there's noneed to specially initialize either for idle thread within init_idle(), asthis was only necessary to handle hotplug cycles. I've tested this on arm64with: * gcc 11.1.0, defconfig +KASAN_INLINE, KASAN_STACK * clang 12.0.0,defconfig +KASAN_INLINE, KASAN_STACK, SHADOW_CALL_STACK ... offlining andonlining CPUS with: | while true; do | for C in/sys/devices/system/cpu/cpu*/online; do | echo 0 > $C; | echo 1 > $C; |done | done",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-47553",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-47553"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-24 15:15:00 UTC",
			"cve": {
				"text": "CVE-2021-47553",
				"href": "https://ubuntu.com/security/CVE-2021-47553",
				"public": "20240524"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201585530000000",
						"comment": "linux-fips package in fips-updates/xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
