{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2021326750000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-32675 on Ubuntu 16.04 FIPS Compliant (xenial) - medium",
		"description": "Redis is an open source, in-memory database that persists on disk. Whenparsing an incoming Redis Standard Protocol (RESP) request, Redis allocatesmemory according to user-specified values which determine the number ofelements (in the multi-bulk header) and size of each element (in the bulkheader). An attacker delivering specially crafted requests over multipleconnections can cause the server to allocate significant amount of memory.Because the same parsing mechanism is used to handle authenticationrequests, this vulnerability can also be exploited by unauthenticatedusers. The problem is fixed in Redis versions 6.2.6, 6.0.16 and 5.0.14. Anadditional workaround to mitigate this problem without patching theredis-server executable is to block access to prevent unauthenticated usersfrom connecting to Redis. This can be done in different ways: Using networkaccess control tools like firewalls, iptables, security groups, etc. orEnabling TLS and requiring users to authenticate using client sidecertificates.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-32675",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-32675"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-10-04 18:15:00 UTC",
			"cve": {
				"text": "CVE-2021-32675",
				"href": "https://ubuntu.com/security/CVE-2021-32675",
				"public": "20211004",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
				"usns": "5221-1"
			},
			"public_date_at_usn": "2021-10-04 18:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-5221-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2020141470000000",
						"comment": "redis: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
