{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:55211000000",
	"version": "1",
	"metadata": {
		"title": "USN-5521-1 -- containerd vulnerabilities",
		"description": "It was discovered that containerd insufficiently restricted permissions on container root and plugin directories. If a user or automated system were tricked into launching a specially crafted container image, a remote attacker could traverse directory contents and modify files and execute programs on the host file system, possibly leading to privilege escalation. (CVE-2021-41103)  It was discovered that containerd incorrectly handled file permission changes. If a user or automated system were tricked into launching a specially crafted container image, a remote attacker could change permissions on files on the host file system and possibly escalate privileges. (CVE-2021-32760)  It was discovered that containerd allows attackers to gain access to read- only copies of arbitrary files and directories on the host via a specially- crafted image configuration. An attacker could possibly use this issue to obtain sensitive information. (CVE-2022-23648)  It was discovered that containerd incorrectly handled certain memory operations. A remote attacker could use this to cause a denial of service. (CVE-2022-31030)  Update Instructions:  Run `sudo pro fix USN-5521-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  containerd - 1.2.6-0ubuntu1~16.04.6+esm2 golang-github-docker-containerd-dev - 1.2.6-0ubuntu1~16.04.6+esm2 Available with Ubuntu Pro: https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5521-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5521-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-07-15"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:552110000000",
						"comment": "Available with Ubuntu Pro: https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
