{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:39371000000",
	"version": "1",
	"metadata": {
		"title": "USN-3937-1 -- Apache HTTP Server vulnerabilities",
		"description": "Charles Fol discovered that the Apache HTTP Server incorrectly handled the scoreboard shared memory area. A remote attacker able to upload and run scripts could possibly use this issue to execute arbitrary code with root privileges. (CVE-2019-0211)  It was discovered that the Apache HTTP Server HTTP/2 module incorrectly handled certain requests. A remote attacker could possibly use this issue to cause the server to consume resources, leading to a denial of service. This issue only affected Ubuntu 18.04 LTS and Ubuntu 18.10. (CVE-2018-17189)  It was discovered that the Apache HTTP Server incorrectly handled session expiry times. When used with mod_session_cookie, this may result in the session expiry time to be ignored, contrary to expectations. (CVE-2018-17199)  Craig Young discovered that the Apache HTTP Server HTTP/2 module incorrectly handled certain requests. A remote attacker could possibly use this issue to cause the server to process requests incorrectly. This issue only affected Ubuntu 18.04 LTS and Ubuntu 18.10. (CVE-2019-0196)  Simon Kappel discovered that the Apache HTTP Server mod_auth_digest module incorrectly handled threads. A remote attacker with valid credentials could possibly use this issue to authenticate using another username, bypassing access control restrictions. (CVE-2019-0217)  Bernhard Lorenz discovered that the Apache HTTP Server was inconsistent when processing requests containing multiple consecutive slashes. This could lead to directives such as LocationMatch and RewriteRule to perform contrary to expectations. (CVE-2019-0220)  Update Instructions:  Run `sudo pro fix USN-3937-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  apache2-data - 2.4.18-2ubuntu3.10 apache2-utils - 2.4.18-2ubuntu3.10 apache2-dev - 2.4.18-2ubuntu3.10 apache2-suexec-pristine - 2.4.18-2ubuntu3.10 apache2-suexec-custom - 2.4.18-2ubuntu3.10 apache2 - 2.4.18-2ubuntu3.10 apache2-doc - 2.4.18-2ubuntu3.10 apache2-bin - 2.4.18-2ubuntu3.10 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3937-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3937-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2019-04-04"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:393710000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
