{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:62631000000",
	"version": "1",
	"metadata": {
		"title": "USN-6263-1 -- OpenJDK vulnerabilities",
		"description": "Motoyasu Saburi discovered that OpenJDK incorrectly handled special characters in file name parameters. An attacker could possibly use this issue to insert, edit or obtain sensitive information. This issue only affected OpenJDK 11 and OpenJDK 17. (CVE-2023-22006)  Eirik Bjørsnøs discovered that OpenJDK incorrectly handled certain ZIP archives. An attacker could possibly use this issue to cause a denial of service. This issue only affected OpenJDK 11 and OpenJDK 17. (CVE-2023-22036)  David Stancu discovered that OpenJDK had a flaw in the AES cipher implementation. An attacker could possibly use this issue to obtain sensitive information. This issue only affected OpenJDK 11 and OpenJDK 17. (CVE-2023-22041)  Zhiqiang Zang discovered that OpenJDK incorrectly handled array accesses when using the binary '%' operator. An attacker could possibly use this issue to obtain sensitive information. This issue only affected OpenJDK 17. (CVE-2023-22044)  Zhiqiang Zang discovered that OpenJDK incorrectly handled array accesses. An attacker could possibly use this issue to obtain sensitive information. (CVE-2023-22045)  It was discovered that OpenJDK incorrectly sanitized URIs strings. An attacker could possibly use this issue to insert, edit or obtain sensitive information. (CVE-2023-22049)  It was discovered that OpenJDK incorrectly handled certain glyphs. An attacker could possibly use this issue to cause a denial of service. This issue only affected OpenJDK 11 and OpenJDK 17. (CVE-2023-25193)  Update Instructions:  Run `sudo pro fix USN-6263-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  openjdk-8-doc - 8u382-ga-1~16.04.1 openjdk-8-jdk - 8u382-ga-1~16.04.1 openjdk-8-jre-headless - 8u382-ga-1~16.04.1 openjdk-8-jre - 8u382-ga-1~16.04.1 openjdk-8-jdk-headless - 8u382-ga-1~16.04.1 openjdk-8-source - 8u382-ga-1~16.04.1 openjdk-8-jre-zero - 8u382-ga-1~16.04.1 openjdk-8-demo - 8u382-ga-1~16.04.1 openjdk-8-jre-jamvm - 8u382-ga-1~16.04.1 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6263-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6263-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-08-01"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:626310000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
