{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:29502000000",
	"version": "1",
	"metadata": {
		"title": "USN-2950-2 -- libsoup update",
		"description": "USN-2950-1 fixed vulnerabilities in Samba. The updated Samba packages introduced a compatibility issue with NTLM authentication in libsoup. This update fixes the problem.  We apologize for the inconvenience.  Original advisory details:   Jouni Knuutinen discovered that Samba contained multiple flaws in the  DCE/RPC implementation. A remote attacker could use this issue to perform  a denial of service, downgrade secure connections by performing a  machine-in-the-middle attack, or possibly execute arbitrary code.  (CVE-2015-5370)    Stefan Metzmacher discovered that Samba contained multiple flaws in the  NTLMSSP authentication implementation. A remote attacker could use this  issue to downgrade connections to plain text by performing a   machine-in-the-middle attack. (CVE-2016-2110)    Alberto Solino discovered that a Samba domain controller would establish a  secure connection to a server with a spoofed computer name. A remote  attacker could use this issue to obtain sensitive information.  (CVE-2016-2111)    Stefan Metzmacher discovered that the Samba LDAP implementation did not  enforce integrity protection. A remote attacker could use this issue to  hijack LDAP connections by performing a machine-in-the-middle attack.  (CVE-2016-2112)    Stefan Metzmacher discovered that Samba did not validate TLS certificates.  A remote attacker could use this issue to spoof a Samba server.  (CVE-2016-2113)    Stefan Metzmacher discovered that Samba did not enforce SMB signing even if  configured to. A remote attacker could use this issue to perform a  machine-in-the-middle attack. (CVE-2016-2114)    Stefan Metzmacher discovered that Samba did not enable integrity protection  for IPC traffic. A remote attacker could use this issue to perform a  machine-in-the-middle attack. (CVE-2016-2115)    Stefan Metzmacher discovered that Samba incorrectly handled the MS-SAMR and  MS-LSAD protocols. A remote attacker could use this flaw with a  machine-in-the-middle attack to impersonate users and obtain sensitive  information from the Security Account Manager database. This flaw is  known as Badlock. (CVE-2016-2118)    Samba has been updated to 4.3.8 in Ubuntu 14.04 LTS and Ubuntu 15.10.  Ubuntu 12.04 LTS has been updated to 3.6.25 with backported security fixes.    In addition to security fixes, the updated packages contain bug fixes,  new features, and possibly incompatible changes. Configuration changes may  be required in certain environments.  Update Instructions:  Run `sudo pro fix USN-2950-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libsoup-gnome2.4-1 - 2.52.2-1ubuntu0.1 libsoup-gnome2.4-dev - 2.52.2-1ubuntu0.1 gir1.2-soup-2.4 - 2.52.2-1ubuntu0.1 libsoup2.4-1 - 2.52.2-1ubuntu0.1 libsoup2.4-dev - 2.52.2-1ubuntu0.1 libsoup2.4-doc - 2.52.2-1ubuntu0.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2950-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-2950-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-05-04"
			},
			"bug": [
				"https://launchpad.net/bugs/1573494"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:295020000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
