{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:45871000000",
	"version": "1",
	"metadata": {
		"title": "USN-4587-1 -- iTALC vulnerabilities",
		"description": "Nicolas Ruff discovered that iTALC had buffer overflows, divide-by-zero errors and didn't check malloc return values. A remote attacker could use these issues to cause a denial of service or possibly execute arbitrary code. (CVE-2014-6051, CVE-2014-6052, CVE-2014-6053, CVE-2014-6054, CVE-2014-6055)  Josef Gajdusek discovered that iTALC had heap-based buffer overflow vulnerabilities. A remote attacker could used these issues to cause a denial of service or possibly execute arbitrary code. (CVE-2016-9941, CVE-2016-9942)  It was discovered that iTALC had an out-of-bounds write, multiple heap out-of-bounds writes, an infinite loop, improper initializations, and null pointer vulnerabilities. A remote attacker could used these issues to cause a denial of service or possibly execute arbitrary code. (CVE-2018-15127, CVE-2018-20019, CVE-2018-20020, CVE-2018-20021, CVE-2018-20022, CVE-2018-20023, CVE-2018-20024, CVE-2018-20748, CVE-2018-20749, CVE-2018-20750, CVE-2018-7225, CVE-2019-15681)  Update Instructions:  Run `sudo pro fix USN-4587-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  italc-master - 1:2.0.2+dfsg1-4ubuntu0.1 italc-client - 1:2.0.2+dfsg1-4ubuntu0.1 italc-management-console - 1:2.0.2+dfsg1-4ubuntu0.1 libitalccore - 1:2.0.2+dfsg1-4ubuntu0.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4587-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4587-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-10-20"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:458710000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
