{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:45571000000",
	"version": "1",
	"metadata": {
		"title": "USN-4557-1 -- Tomcat vulnerabilities",
		"description": "It was discovered that the Tomcat realm implementations incorrectly handled passwords when a username didn't exist. A remote attacker could possibly use this issue to enumerate usernames. (CVE-2016-0762)  Alvaro Munoz and Alexander Mirosh discovered that Tomcat incorrectly limited use of a certain utility method. A malicious application could possibly use this to bypass Security Manager restrictions. (CVE-2016-5018)  It was discovered that Tomcat incorrectly controlled reading system properties. A malicious application could possibly use this to bypass Security Manager restrictions. (CVE-2016-6794)  It was discovered that Tomcat incorrectly controlled certain configuration parameters. A malicious application could possibly use this to bypass Security Manager restrictions. (CVE-2016-6796)  It was discovered that Tomcat incorrectly limited access to global JNDI resources. A malicious application could use this to access any global JNDI resource without an explicit ResourceLink. (CVE-2016-6797)  Regis Leroy discovered that Tomcat incorrectly filtered certain invalid characters from the HTTP request line. A remote attacker could possibly use this issue to inject data into HTTP responses. (CVE-2016-6816)  Pierre Ernst discovered that the Tomcat JmxRemoteLifecycleListener did not implement a recommended fix. A remote attacker could possibly use this issue to execute arbitrary code. (CVE-2016-8735)  Update Instructions:  Run `sudo pro fix USN-4557-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libservlet2.5-java - 6.0.45+dfsg-1ubuntu0.1 libservlet2.5-java-doc - 6.0.45+dfsg-1ubuntu0.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4557-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4557-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-09-30"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:455710000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
