{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:38202000000",
	"version": "1",
	"metadata": {
		"title": "USN-3820-2 -- Linux kernel (HWE) vulnerabilities",
		"description": "USN-3820-1 fixed vulnerabilities in the Linux kernel for Ubuntu 18.04 LTS. This update provides the corresponding updates for the Linux Hardware Enablement (HWE) kernel from Ubuntu 18.04 LTS for Ubuntu 16.04 LTS.  Felix Wilhelm discovered that the Xen netback driver in the Linux kernel did not properly perform input validation in some situations. An attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-15471)  It was discovered that the generic SCSI driver in the Linux kernel did not properly enforce permissions on kernel memory access. A local attacker could use this to expose sensitive information or possibly elevate privileges. (CVE-2017-13168)  It was discovered that an integer overflow existed in the CD-ROM driver of the Linux kernel. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2018-16658)  It was discovered that an integer overflow existed in the HID Bluetooth implementation in the Linux kernel that could lead to a buffer overwrite. An attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-9363)  Update Instructions:  Run `sudo pro fix USN-3820-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-unsigned-4.15.0-1024-gcp - 4.15.0-1024.25~16.04.2 No subscription required  linux-image-unsigned-4.15.0-1031-azure - 4.15.0-1031.32~16.04.1 No subscription required  linux-image-4.15.0-39-lowlatency - 4.15.0-39.42~16.04.1 linux-image-unsigned-4.15.0-39-lowlatency - 4.15.0-39.42~16.04.1 linux-image-4.15.0-39-generic - 4.15.0-39.42~16.04.1 linux-image-4.15.0-39-generic-lpae - 4.15.0-39.42~16.04.1 linux-image-unsigned-4.15.0-39-generic - 4.15.0-39.42~16.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3820-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-3820-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2018-11-14"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:382020000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:382020000010",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:382020000020",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
