{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:41132000000",
	"version": "1",
	"metadata": {
		"title": "USN-4113-2 -- Apache HTTP Server regression",
		"description": "USN-4113-1 fixed vulnerabilities in the Apache HTTP server. Unfortunately, that update introduced a regression when proxying balancer manager connections in some configurations. This update fixes the problem.  We apologize for the inconvenience.  Original advisory details:   Stefan Eissing discovered that the HTTP/2 implementation in Apache  did not properly handle upgrade requests from HTTP/1.1 to HTTP/2 in  some situations. A remote attacker could use this to cause a denial  of service (daemon crash). This issue only affected Ubuntu 18.04 LTS  and Ubuntu 19.04. (CVE-2019-0197)   Craig Young discovered that a memory overwrite error existed in  Apache when performing HTTP/2 very early pushes in some situations. A  remote attacker could use this to cause a denial of service (daemon  crash). This issue only affected Ubuntu 18.04 LTS and Ubuntu 19.04.  (CVE-2019-10081)   Craig Young discovered that a read-after-free error existed in the  HTTP/2 implementation in Apache during connection shutdown. A remote  attacker could use this to possibly cause a denial of service (daemon  crash) or possibly expose sensitive information. This issue only  affected Ubuntu 18.04 LTS and Ubuntu 19.04. (CVE-2019-10082)   Matei Badanoiu discovered that the mod_proxy component of  Apache did not properly filter URLs when reporting errors in some  configurations. A remote attacker could possibly use this issue to  conduct cross-site scripting (XSS) attacks. (CVE-2019-10092)   Daniel McCarney discovered that mod_remoteip component of Apache  contained a stack buffer overflow when parsing headers from a trusted  intermediary proxy in some situations. A remote attacker controlling a  trusted proxy could use this to cause a denial of service or possibly  execute arbitrary code. This issue only affected Ubuntu 19.04.  (CVE-2019-10097)   Yukitsugu Sasaki discovered that the mod_rewrite component in Apache  was vulnerable to open redirects in some situations. A remote attacker  could use this to possibly expose sensitive information or bypass  intended restrictions. (CVE-2019-10098)   Jonathan Looney discovered that the HTTP/2 implementation in Apache did  not properly limit the amount of buffering for client connections in  some situations. A remote attacker could use this to cause a denial  of service (unresponsive daemon). This issue only affected Ubuntu  18.04 LTS and Ubuntu 19.04. (CVE-2019-9517)  Update Instructions:  Run `sudo pro fix USN-4113-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  apache2-data - 2.4.18-2ubuntu3.13 apache2-utils - 2.4.18-2ubuntu3.13 apache2-dev - 2.4.18-2ubuntu3.13 apache2-suexec-pristine - 2.4.18-2ubuntu3.13 apache2-suexec-custom - 2.4.18-2ubuntu3.13 apache2 - 2.4.18-2ubuntu3.13 apache2-doc - 2.4.18-2ubuntu3.13 apache2-bin - 2.4.18-2ubuntu3.13 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4113-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-4113-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2019-09-17"
			},
			"bug": [
				"https://launchpad.net/bugs/1842701"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:411320000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
