{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:57711000000",
	"version": "1",
	"metadata": {
		"title": "USN-5771-1 -- Squid regression",
		"description": "USN-3557-1 fixed vulnerabilities in Squid. This update introduced a regression which could cause the cache log to be filled with many Vary loop messages. This update fixes the problem.  We apologize for the inconvenience.  Original advisory details:  Mathias Fischer discovered that Squid incorrectly handled certain long strings in headers. A malicious remote server could possibly cause Squid to crash, resulting in a denial of service. This issue was only addressed in Ubuntu 16.04 LTS. (CVE-2016-2569)  William Lima discovered that Squid incorrectly handled XML parsing when processing Edge Side Includes (ESI). A malicious remote server could possibly cause Squid to crash, resulting in a denial of service. This issue was only addressed in Ubuntu 16.04 LTS. (CVE-2016-2570)  Alex Rousskov discovered that Squid incorrectly handled response-parsing failures. A malicious remote server could possibly cause Squid to crash, resulting in a denial of service. This issue only applied to Ubuntu 16.04 LTS. (CVE-2016-2571)  Santiago Ruano Rincón discovered that Squid incorrectly handled certain Vary headers. A remote attacker could possibly use this issue to cause Squid to crash, resulting in a denial of service. This issue was only addressed in Ubuntu 16.04 LTS. (CVE-2016-3948)  Louis Dion-Marcil discovered that Squid incorrectly handled certain Edge Side Includes (ESI) responses. A malicious remote server could possibly cause Squid to crash, resulting in a denial of service. (CVE-2018-1000024)  Louis Dion-Marcil discovered that Squid incorrectly handled certain Edge Side Includes (ESI) responses. A malicious remote server could possibly cause Squid to crash, resulting in a denial of service. (CVE-2018-1000027)  Update Instructions:  Run `sudo pro fix USN-5771-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  squid-common - 3.5.12-1ubuntu7.16+esm1 squid - 3.5.12-1ubuntu7.16+esm1 squid-cgi - 3.5.12-1ubuntu7.16+esm1 squid-purge - 3.5.12-1ubuntu7.16+esm1 squidclient - 3.5.12-1ubuntu7.16+esm1 squid3 - 3.5.12-1ubuntu7.16+esm1 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5771-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5771-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-12-12"
			},
			"bug": [
				"https://launchpad.net/bugs/1999346"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:577110000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
