{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:59191000000",
	"version": "1",
	"metadata": {
		"title": "USN-5919-1 -- Linux kernel vulnerabilities",
		"description": "It was discovered that the Upper Level Protocol (ULP) subsystem in the Linux kernel did not properly handle sockets entering the LISTEN state in certain protocols, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-0461)  Kyle Zeng discovered that the sysctl implementation in the Linux kernel contained a stack-based buffer overflow. A local attacker could use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-4378)  It was discovered that a race condition existed in the Kernel Connection Multiplexor (KCM) socket implementation in the Linux kernel when releasing sockets in certain situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-3521)  It was discovered that the Netronome Ethernet driver in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3545)  It was discovered that the Broadcom FullMAC USB WiFi driver in the Linux kernel did not properly perform bounds checking in some situations. A physically proximate attacker could use this to craft a malicious USB device that when inserted, could cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3628)  It was discovered that a use-after-free vulnerability existed in the Bluetooth stack in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3640)  It was discovered that the NILFS2 file system implementation in the Linux kernel did not properly deallocate memory in certain error conditions. An attacker could use this to cause a denial of service (memory exhaustion). (CVE-2022-3646)  Khalid Masum discovered that the NILFS2 file system implementation in the Linux kernel did not properly handle certain error conditions, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2022-3649)  It was discovered that a race condition existed in the Xen network backend driver in the Linux kernel when handling dropped packets in certain circumstances. An attacker could use this to cause a denial of service (kernel deadlock). (CVE-2022-42328, CVE-2022-42329)  Tamás Koczka discovered that the Bluetooth L2CAP implementation in the Linux kernel did not properly initialize memory in some situations. A physically proximate attacker could possibly use this to expose sensitive information (kernel memory). (CVE-2022-42895)  It was discovered that the USB monitoring (usbmon) component in the Linux kernel did not properly set permissions on memory mapped in to user space processes. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-43750)  Update Instructions:  Run `sudo pro fix USN-5919-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-headers-4.15.0-1115-oracle - 4.15.0-1115.126~16.04.1 linux-image-unsigned-4.15.0-1115-oracle - 4.15.0-1115.126~16.04.1 linux-modules-extra-4.15.0-1115-oracle - 4.15.0-1115.126~16.04.1 linux-modules-4.15.0-1115-oracle - 4.15.0-1115.126~16.04.1 linux-image-4.15.0-1115-oracle - 4.15.0-1115.126~16.04.1 linux-oracle-headers-4.15.0-1115 - 4.15.0-1115.126~16.04.1 linux-tools-4.15.0-1115-oracle - 4.15.0-1115.126~16.04.1 linux-buildinfo-4.15.0-1115-oracle - 4.15.0-1115.126~16.04.1 linux-oracle-tools-4.15.0-1115 - 4.15.0-1115.126~16.04.1 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro  linux-image-4.15.0-1151-aws - 4.15.0-1151.164~16.04.1 linux-tools-4.15.0-1151-aws - 4.15.0-1151.164~16.04.1 linux-modules-4.15.0-1151-aws - 4.15.0-1151.164~16.04.1 linux-aws-hwe-cloud-tools-4.15.0-1151 - 4.15.0-1151.164~16.04.1 linux-modules-extra-4.15.0-1151-aws - 4.15.0-1151.164~16.04.1 linux-headers-4.15.0-1151-aws - 4.15.0-1151.164~16.04.1 linux-aws-hwe-tools-4.15.0-1151 - 4.15.0-1151.164~16.04.1 linux-image-unsigned-4.15.0-1151-aws - 4.15.0-1151.164~16.04.1 linux-cloud-tools-4.15.0-1151-aws - 4.15.0-1151.164~16.04.1 linux-buildinfo-4.15.0-1151-aws - 4.15.0-1151.164~16.04.1 linux-aws-headers-4.15.0-1151 - 4.15.0-1151.164~16.04.1 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro  linux-signed-image-oracle - 4.15.0.1115.96 linux-headers-oracle - 4.15.0.1115.96 linux-image-oracle - 4.15.0.1115.96 linux-signed-oracle - 4.15.0.1115.96 linux-tools-oracle - 4.15.0.1115.96 linux-oracle - 4.15.0.1115.96 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro  linux-headers-aws-hwe - 4.15.0.1151.134 linux-aws-hwe - 4.15.0.1151.134 linux-image-aws-hwe - 4.15.0.1151.134 linux-aws-edge - 4.15.0.1151.134 linux-modules-extra-aws-hwe - 4.15.0.1151.134 linux-tools-aws-hwe - 4.15.0.1151.134 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5919-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5919-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-03-03"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:591910000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:591910000010",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
