{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:42671000000",
	"version": "1",
	"metadata": {
		"title": "USN-4267-1 -- ARM mbed TLS vulnerabilities",
		"description": "It was discovered that mbedtls has a bounds-check bypass through an integer overflow that can be used by an attacked to execute arbitrary code or cause a denial of service. (CVE-2017-18187)  It was discovered that mbedtls has a vulnerability where an attacker could execute arbitrary code or cause a denial of service (buffer overflow) via a crafted certificate chain that is mishandled during RSASSA-PSS signature verification within a TLS or DTLS session. (CVE-2018-0487)  It was discovered that mbedtls has a vulnerability where an attacker could execute arbitrary code or cause a denial of service (heap corruption) via a crafted application packet within a TLS or DTLS session. (CVE-2018-0488)  It was discovered that mbedtls has a vulnerability that allows remote attackers to achieve partial plaintext recovery (for a CBC based ciphersuite) via a timing-based side-channel attack. (CVE-2018-0497)  It was discovered that mbedtls has a vulnerability that allows local users to achieve partial plaintext recovery (for a CBC based ciphersuite) via a cache-based side-channel attack. (CVE-2018-0498)  Update Instructions:  Run `sudo pro fix USN-4267-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libmbedtls-doc - 2.2.1-2ubuntu0.3 libmbedtls-dev - 2.2.1-2ubuntu0.3 libmbedtls10 - 2.2.1-2ubuntu0.3 libmbedcrypto0 - 2.2.1-2ubuntu0.3 libmbedx509-0 - 2.2.1-2ubuntu0.3 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4267-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4267-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-02-05"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:426710000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
