{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:58821000000",
	"version": "1",
	"metadata": {
		"title": "USN-5882-1 -- DCMTK vulnerabilities",
		"description": "Gjoko Krstic discovered that DCMTK incorrectly handled buffers. If a user or an automated system were tricked into opening a certain specially crafted  input file, a remote attacker could possibly use this issue to cause a  denial of service. This issue only affected Ubuntu 16.04 LTS. (CVE-2015-8979)  Omar Ganiev discovered that DCMTK incorrectly handled buffers. If a user or an automated system were tricked into opening a certain specially crafted  input file, a remote attacker could possibly use this issue to cause a  denial of service. This issue only affected Ubuntu 16.04 LTS and  Ubuntu 18.04 LTS. (CVE-2019-1010228)  Jinsheng Ba discovered that DCMTK incorrectly handled certain requests. If a user or an automated system were tricked into opening a certain specially crafted input file, a remote attacker could possibly use this issue to  cause a denial of service. This issue only affected Ubuntu 16.04 LTS,  Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, and Ubuntu 22.04 LTS. (CVE-2021-41687, CVE-2021-41688, CVE-2021-41689, and CVE-2021-41690)  Sharon Brizinov and Noam Moshe discovered that DCMTK incorrectly handled certain inputs. If a user or an automated system were tricked into opening a certain specially crafted input file, a remote attacker could possibly use this issue to execute arbitrary code. This issue only affected  Ubuntu 16.04 LTS, Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, and Ubuntu 22.04 LTS. (CVE-2022-2119 and CVE-2022-2120)  Sharon Brizinov and Noam Moshe discovered that DCMTK incorrectly handled pointers. If a user or an automated system were tricked into opening a certain specially crafted input file, a remote attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 16.04 LTS, Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, and Ubuntu 22.04 LTS. (CVE-2022-2121)  It was discovered that DCMTK incorrectly handled certain inputs. If a user or an automated system were tricked into opening a certain specially crafted input file, a remote attacker could possibly use this issue to  cause a denial of service. This issue affected Ubuntu 16.04 LTS,  Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, Ubuntu 22.04 LTS, and Ubuntu 22.10. (CVE-2022-43272)  Update Instructions:  Run `sudo pro fix USN-5882-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libdcmtk5 - 3.6.1~20150924-5ubuntu0.1~esm1 dcmtk - 3.6.1~20150924-5ubuntu0.1~esm1 dcmtk-doc - 3.6.1~20150924-5ubuntu0.1~esm1 libdcmtk-dev - 3.6.1~20150924-5ubuntu0.1~esm1 Available with Ubuntu Pro: https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5882-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5882-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-02-22"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:588210000000",
						"comment": "Available with Ubuntu Pro: https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
