{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:45411000000",
	"version": "1",
	"metadata": {
		"title": "USN-4541-1 -- Gnuplot vulnerabilities",
		"description": "Tim Blazytko, Cornelius Aschermann, Sergej Schumilo and Nils Bars  discovered that Gnuplot did not properly validate string sizes in the df_generate_ascii_array_entry function. An attacker could possibly use this issue to cause a heap buffer overflow, resulting in a denial of  service attack or arbitrary code execution. (CVE-2018-19490)  Tim Blazytko, Cornelius Aschermann, Sergej Schumilo and Nils Bars  discovered that Gnuplot did not properly validate string sizes in the  PS_options function when the Gnuplot postscript terminal is used as a  backend. An attacker could possibly use this issue to cause a buffer overflow, resulting in a denial of service attack or arbitrary code  execution. (CVE-2018-19491)  Tim Blazytko, Cornelius Aschermann, Sergej Schumilo and Nils Bars  discovered that Gnuplot did not properly validate string sizes in the  cairotrm_options function when the Gnuplot postscript terminal is used as a backend. An attacker could possibly use this issue to cause a buffer overflow, resulting in a denial of service attack or arbitrary code  execution. (CVE-2018-19492)  Update Instructions:  Run `sudo pro fix USN-4541-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  gnuplot - 4.6.6-3ubuntu0.1 gnuplot-doc - 4.6.6-3ubuntu0.1 gnuplot-tex - 4.6.6-3ubuntu0.1 gnuplot-qt - 4.6.6-3ubuntu0.1 gnuplot-data - 4.6.6-3ubuntu0.1 gnuplot-nox - 4.6.6-3ubuntu0.1 gnuplot-x11 - 4.6.6-3ubuntu0.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4541-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4541-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-09-25"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:454110000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
