{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:33671000000",
	"version": "1",
	"metadata": {
		"title": "USN-3367-1 -- gdb vulnerabilities",
		"description": "Hanno Böck discovered that gdb incorrectly handled certain malformed AOUT headers in PE executables. If a user or automated system were tricked into processing a specially crafted binary, a remote attacker could use this issue to cause gdb to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only applied to Ubuntu 14.04 LTS. (CVE-2014-8501)  It was discovered that gdb incorrectly handled printing bad bytes in Intel Hex objects. If a user or automated system were tricked into processing a specially crafted binary, a remote attacker could use this issue to cause gdb to crash, resulting in a denial of service. This issue only applied to Ubuntu 14.04 LTS. (CVE-2014-9939)  It was discovered that gdb incorrectly handled certain string operations. If a user or automated system were tricked into processing a specially crafted binary, a remote attacker could use this issue to cause gdb to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only applied to Ubuntu 14.04 LTS and Ubuntu 16.04 LTS. (CVE-2016-2226)  It was discovered that gdb incorrectly handled parsing certain binaries. If a user or automated system were tricked into processing a specially crafted binary, a remote attacker could use this issue to cause gdb to crash, resulting in a denial of service. This issue only applied to Ubuntu 14.04 LTS and Ubuntu 16.04 LTS. (CVE-2016-4487, CVE-2016-4488, CVE-2016-4489, CVE-2016-4490, CVE-2016-4492, CVE-2016-4493, CVE-2016-6131)  It was discovered that gdb incorrectly handled parsing certain binaries. If a user or automated system were tricked into processing a specially crafted binary, a remote attacker could use this issue to cause gdb to crash, resulting in a denial of service. (CVE-2016-4491)  Update Instructions:  Run `sudo pro fix USN-3367-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  gdb-multiarch - 7.11.1-0ubuntu1~16.5 gdb-source - 7.11.1-0ubuntu1~16.5 gdbserver - 7.11.1-0ubuntu1~16.5 gdb - 7.11.1-0ubuntu1~16.5 gdb-doc - 7.11.1-0ubuntu1~16.5 gdb64 - 7.11.1-0ubuntu1~16.5 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3367-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3367-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2017-07-26"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:336710000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
