{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:39751000000",
	"version": "1",
	"metadata": {
		"title": "USN-3975-1 -- OpenJDK vulnerabilities",
		"description": "It was discovered that the BigDecimal implementation in OpenJDK performed excessive computation when given certain values. An attacker could use this to cause a denial of service (excessive CPU usage). (CVE-2019-2602)  Corwin de Boor and Robert Xiao discovered that the RMI registry implementation in OpenJDK did not properly select the correct skeleton class in some situations. An attacker could use this to possibly escape Java sandbox restrictions. (CVE-2019-2684)  Mateusz Jurczyk discovered a vulnerability in the 2D component of OpenJDK. An attacker could use this to possibly escape Java sandbox restrictions. This issue only affected OpenJDK 8 in Ubuntu 16.04 LTS. (CVE-2019-2697)  Mateusz Jurczyk discovered a vulnerability in the font layout engine of OpenJDK's 2D component. An attacker could use this to possibly escape Java sandbox restrictions. This issue only affected OpenJDK 8 in Ubuntu 16.04 LTS. (CVE-2019-2698)  Update Instructions:  Run `sudo pro fix USN-3975-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  openjdk-8-doc - 8u212-b03-0ubuntu1.16.04.1 openjdk-8-jdk - 8u212-b03-0ubuntu1.16.04.1 openjdk-8-jre-headless - 8u212-b03-0ubuntu1.16.04.1 openjdk-8-jre - 8u212-b03-0ubuntu1.16.04.1 openjdk-8-jdk-headless - 8u212-b03-0ubuntu1.16.04.1 openjdk-8-source - 8u212-b03-0ubuntu1.16.04.1 openjdk-8-jre-zero - 8u212-b03-0ubuntu1.16.04.1 openjdk-8-demo - 8u212-b03-0ubuntu1.16.04.1 openjdk-8-jre-jamvm - 8u212-b03-0ubuntu1.16.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3975-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3975-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2019-05-13"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:397510000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
