{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:37531000000",
	"version": "1",
	"metadata": {
		"title": "USN-3753-1 -- Linux kernel vulnerabilities",
		"description": "It was discovered that the generic SCSI driver in the Linux kernel did not properly enforce permissions on kernel memory access. A local attacker could use this to expose sensitive information or possibly elevate privileges. (CVE-2017-13168)  Wen Xu discovered that a use-after-free vulnerability existed in the ext4 filesystem implementation in the Linux kernel. An attacker could use this to construct a malicious ext4 image that, when mounted, could cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-10876, CVE-2018-10879)  Wen Xu discovered that a buffer overflow existed in the ext4 filesystem implementation in the Linux kernel. An attacker could use this to construct a malicious ext4 image that, when mounted, could cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-10877)  Wen Xu discovered that an out-of-bounds write vulnerability existed in the ext4 filesystem implementation in the Linux kernel. An attacker could use this to construct a malicious ext4 image that, when mounted, could cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-10878, CVE-2018-10882)  Wen Xu discovered that the ext4 filesystem implementation in the Linux kernel did not properly keep meta-data information consistent in some situations. An attacker could use this to construct a malicious ext4 image that, when mounted, could cause a denial of service (system crash). (CVE-2018-10881)  Shankara Pailoor discovered that the JFS filesystem implementation in the Linux kernel contained a buffer overflow when handling extended attributes. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-12233)  Wen Xu discovered that the XFS filesystem implementation in the Linux kernel did not properly handle an error condition with a corrupted xfs image. An attacker could use this to construct a malicious xfs image that, when mounted, could cause a denial of service (system crash). (CVE-2018-13094)  It was discovered that the Linux kernel did not properly handle setgid file creation when performed by a non-member of the group. A local attacker could use this to gain elevated privileges. (CVE-2018-13405)  Silvio Cesare discovered that the generic VESA frame buffer driver in the Linux kernel contained an integer overflow. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-13406)  Update Instructions:  Run `sudo pro fix USN-3753-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.4.0-1032-kvm - 4.4.0-1032.38 No subscription required  linux-image-4.4.0-1066-aws - 4.4.0-1066.76 No subscription required  linux-image-4.4.0-1095-raspi2 - 4.4.0-1095.103 No subscription required  linux-image-4.4.0-1099-snapdragon - 4.4.0-1099.104 No subscription required  linux-image-4.4.0-134-generic-lpae - 4.4.0-134.160 linux-image-4.4.0-134-powerpc-smp - 4.4.0-134.160 linux-image-extra-4.4.0-134-generic - 4.4.0-134.160 linux-image-4.4.0-134-generic - 4.4.0-134.160 linux-image-4.4.0-134-powerpc-e500mc - 4.4.0-134.160 linux-image-4.4.0-134-powerpc64-emb - 4.4.0-134.160 linux-image-4.4.0-134-lowlatency - 4.4.0-134.160 linux-image-4.4.0-134-powerpc64-smp - 4.4.0-134.160 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3753-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3753-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2018-08-24"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:375310000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:375310000010",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:375310000020",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:375310000030",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:375310000040",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
