{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:38163000000",
	"version": "1",
	"metadata": {
		"title": "USN-3816-3 -- systemd regression",
		"description": "USN-3816-1 fixed vulnerabilities in systemd. The fix for CVE-2018-6954 caused a regression in systemd-tmpfiles when running Ubuntu inside a container on some older kernels. This issue only affected Ubuntu 16.04 LTS. In order to continue to support this configuration, the fixes for CVE-2018-6954 have been reverted.  We apologize for the inconvenience.  Original advisory details:   Jann Horn discovered that unit_deserialize incorrectly handled status messages  above a certain length. A local attacker could potentially exploit this via  NotifyAccess to inject arbitrary state across re-execution and obtain root  privileges. (CVE-2018-15686)    Jann Horn discovered a race condition in chown_one(). A local attacker  could potentially exploit this by setting arbitrary permissions on certain  files to obtain root privileges. This issue only affected Ubuntu 18.04 LTS  and Ubuntu 18.10. (CVE-2018-15687)    It was discovered that systemd-tmpfiles mishandled symlinks in  non-terminal path components. A local attacker could potentially exploit  this by gaining ownership of certain files to obtain root privileges. This  issue only affected Ubuntu 16.04 LTS and Ubuntu 18.04 LTS. (CVE-2018-6954)  Update Instructions:  Run `sudo pro fix USN-3816-3` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  systemd-coredump - 229-4ubuntu21.10 systemd - 229-4ubuntu21.10 udev-udeb - 229-4ubuntu21.10 libsystemd0 - 229-4ubuntu21.10 systemd-container - 229-4ubuntu21.10 libnss-myhostname - 229-4ubuntu21.10 libudev1-udeb - 229-4ubuntu21.10 libudev1 - 229-4ubuntu21.10 libsystemd-dev - 229-4ubuntu21.10 systemd-journal-remote - 229-4ubuntu21.10 libpam-systemd - 229-4ubuntu21.10 libudev-dev - 229-4ubuntu21.10 libnss-mymachines - 229-4ubuntu21.10 libnss-resolve - 229-4ubuntu21.10 systemd-sysv - 229-4ubuntu21.10 udev - 229-4ubuntu21.10 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3816-3",
				"ref_url": "https://ubuntu.com/security/notices/USN-3816-3"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2018-11-27"
			},
			"bug": [
				"https://launchpad.net/bugs/1804847"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:381630000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
