{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:60771000000",
	"version": "1",
	"metadata": {
		"title": "USN-6077-1 -- OpenJDK vulnerabilities",
		"description": "Ben Smyth discovered that OpenJDK incorrectly handled half-duplex connections during TLS handshake. A remote attacker could possibly use this issue to insert, edit or obtain sensitive information. (CVE-2023-21930)  It was discovered that OpenJDK incorrectly handled certain inputs. An attacker could possibly use this issue to insert, edit or obtain sensitive information. (CVE-2023-21937)  It was discovered that OpenJDK incorrectly handled command arguments. An attacker could possibly use this issue to insert, edit or obtain sensitive information. (CVE-2023-21938)  It was discovered that OpenJDK incorrectly validated HTML documents. An attacker could possibly use this issue to insert, edit or obtain sensitive information. (CVE-2023-21939)  Ramki Ramakrishna discovered that OpenJDK incorrectly handled garbage collection. An attacker could possibly use this issue to bypass Java sandbox restrictions. (CVE-2023-21954)  Jonathan Looney discovered that OpenJDK incorrectly handled certificate chains during TLS session negotiation. A remote attacker could possibly use this issue to cause a denial of service. (CVE-2023-21967)  Adam Reziouk discovered that OpenJDK incorrectly sanitized URIs. An attacker could possibly use this issue to bypass Java sandbox restrictions. (CVE-2023-21968)  Update Instructions:  Run `sudo pro fix USN-6077-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  openjdk-8-doc - 8u372-ga~us1-0ubuntu1~16.04 openjdk-8-jdk - 8u372-ga~us1-0ubuntu1~16.04 openjdk-8-jre-headless - 8u372-ga~us1-0ubuntu1~16.04 openjdk-8-jre - 8u372-ga~us1-0ubuntu1~16.04 openjdk-8-jdk-headless - 8u372-ga~us1-0ubuntu1~16.04 openjdk-8-source - 8u372-ga~us1-0ubuntu1~16.04 openjdk-8-jre-zero - 8u372-ga~us1-0ubuntu1~16.04 openjdk-8-demo - 8u372-ga~us1-0ubuntu1~16.04 openjdk-8-jre-jamvm - 8u372-ga~us1-0ubuntu1~16.04 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6077-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6077-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-05-16"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:607710000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
