{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:43491000000",
	"version": "1",
	"metadata": {
		"title": "USN-4349-1 -- EDK II vulnerabilities",
		"description": "A buffer overflow was discovered in the network stack. An unprivileged user could potentially enable escalation of privilege and/or denial of service. This issue was already fixed in a previous release for 18.04 LTS and 19.10. (CVE-2018-12178)  A buffer overflow was discovered in BlockIo service. An unauthenticated user could potentially enable escalation of privilege, information disclosure and/or denial of service. This issue was already fixed in a previous release for 18.04 LTS and 19.10. (CVE-2018-12180)  A stack overflow was discovered in bmp. An unprivileged user could potentially enable denial of service or elevation of privilege via local access. This issue was already fixed in a previous release for 18.04 LTS and 19.10. (CVE-2018-12181)  It was discovered that memory was not cleared before free that could lead to potential password leak. (CVE-2019-14558)  A memory leak was discovered in ArpOnFrameRcvdDpc. An attacker could possibly use this issue to cause a denial of service or other unspecified impact. (CVE-2019-14559)  An integer overflow was discovered in MdeModulePkg/PiDxeS3BootScriptLib. An attacker could possibly use this issue to cause a denial of service or other unspecified impact. (CVE-2019-14563)  It was discovered that the affected version doesn't properly check whether an unsigned EFI file should be allowed or not. An attacker could possibly load unsafe content by bypassing the verification. (CVE-2019-14575)  It was discovered that original configuration runtime memory is freed, but it is still exposed to the OS runtime. (CVE-2019-14586)  A double-unmap was discovered in TRB creation. An attacker could use it to cause a denial of service or other unspecified impact. (CVE-2019-14587)  Update Instructions:  Run `sudo pro fix USN-4349-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  qemu-efi - 0~20160408.ffea0a2c-2ubuntu0.1 ovmf - 0~20160408.ffea0a2c-2ubuntu0.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4349-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4349-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-04-30"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:434910000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
