{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:35082000000",
	"version": "1",
	"metadata": {
		"title": "USN-3508-2 -- Linux kernel (HWE) vulnerabilities",
		"description": "USN-3508-1 fixed vulnerabilities in the Linux kernel for Ubuntu 17.04. This update provides the corresponding updates for the Linux Hardware Enablement (HWE) kernel from Ubuntu 17.04 for Ubuntu 16.04 LTS.  Mohamed Ghannam discovered that a use-after-free vulnerability existed in the Netlink subsystem (XFRM) in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-16939)  It was discovered that the Linux kernel did not properly handle copy-on- write of transparent huge pages. A local attacker could use this to cause a denial of service (application crashes) or possibly gain administrative privileges. (CVE-2017-1000405)  Yonggang Guo discovered that a race condition existed in the driver subsystem in the Linux kernel. A local attacker could use this to possibly gain administrative privileges. (CVE-2017-12146)  Update Instructions:  Run `sudo pro fix USN-3508-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.10.0-42-generic-lpae - 4.10.0-42.46~16.04.1 linux-image-4.10.0-42-lowlatency - 4.10.0-42.46~16.04.1 linux-image-4.10.0-42-generic - 4.10.0-42.46~16.04.1 linux-image-extra-4.10.0-42-generic - 4.10.0-42.46~16.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3508-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-3508-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2017-12-07"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:350820000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
