{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:57231000000",
	"version": "1",
	"metadata": {
		"title": "USN-5723-1 -- Vim vulnerabilities",
		"description": "It was discovered that Vim could be made to crash when searching specially crafted patterns. An attacker could possibly use this to crash Vim and cause denial of service. (CVE-2022-1674)  It was discovered that there existed a NULL pointer dereference in Vim. An attacker could possibly use this to crash Vim and cause denial of service. (CVE-2022-1725)  It was discovered that there existed a buffer over-read in Vim when searching specially crafted patterns. An attacker could possibly use this to crash Vim and cause denial of service. (CVE-2022-2124)  It was discovered that there existed a heap buffer overflow in Vim when auto-indenting lisp. An attacker could possibly use this to crash Vim and cause denial of service. (CVE-2022-2125)  It was discovered that there existed an out of bounds read in Vim when performing spelling suggestions. An attacker could possibly use this to crash Vim and cause denial of service. (CVE-2022-2126)  It was discovered that Vim accessed invalid memory when executing specially crafted command line expressions. An attacker could possibly use this to crash Vim, access or modify memory, or execute arbitrary commands. (CVE-2022-2175)  It was discovered that there existed an out-of-bounds read in Vim when auto-indenting lisp. An attacker could possibly use this to crash Vim, access or modify memory, or execute arbitrary commands. (CVE-2022-2183)   It was discovered that Vim accessed invalid memory when terminal size changed. An attacker could possibly use this to crash Vim, access or modify memory, or execute arbitrary commands. (CVE-2022-2206)  It was discovered that there existed a stack buffer overflow in Vim's spelldump. An attacker could possibly use this to crash Vim and cause denial of service. (CVE-2022-2304)  Update Instructions:  Run `sudo pro fix USN-5723-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  vim-common - 2:7.4.1689-3ubuntu1.5+esm13 vim-nox-py2 - 2:7.4.1689-3ubuntu1.5+esm13 vim-gnome - 2:7.4.1689-3ubuntu1.5+esm13 vim-athena-py2 - 2:7.4.1689-3ubuntu1.5+esm13 vim-athena - 2:7.4.1689-3ubuntu1.5+esm13 vim-gtk - 2:7.4.1689-3ubuntu1.5+esm13 vim-gui-common - 2:7.4.1689-3ubuntu1.5+esm13 vim - 2:7.4.1689-3ubuntu1.5+esm13 vim-gtk3-py2 - 2:7.4.1689-3ubuntu1.5+esm13 vim-doc - 2:7.4.1689-3ubuntu1.5+esm13 vim-gtk-py2 - 2:7.4.1689-3ubuntu1.5+esm13 vim-tiny - 2:7.4.1689-3ubuntu1.5+esm13 vim-gnome-py2 - 2:7.4.1689-3ubuntu1.5+esm13 vim-gtk3 - 2:7.4.1689-3ubuntu1.5+esm13 vim-nox - 2:7.4.1689-3ubuntu1.5+esm13 vim-runtime - 2:7.4.1689-3ubuntu1.5+esm13 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5723-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5723-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-11-14"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:572310000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
