{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:53791000000",
	"version": "1",
	"metadata": {
		"title": "USN-5379-1 -- klibc vulnerabilities",
		"description": "It was discovered that klibc did not properly perform some mathematical operations, leading to an integer overflow. An attacker could possibly use this issue to cause a crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2021-31870)  It was discovered that klibc did not properly handled some memory allocations on 64 bit systems. An attacker could possibly use this issue to cause a crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2021-31871)  It was discovered that klibc did not properly handled some file sizes values on 32 bit systems. An attacker could possibly use this issue to cause a crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2021-31872)  It was discovered that klibc did not properly handled some memory allocations. An attacker could possibly use this issue to cause a crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2021-31873)  Update Instructions:  Run `sudo pro fix USN-5379-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  klibc-utils - 2.0.4-8ubuntu1.16.04.4+esm1 libklibc - 2.0.4-8ubuntu1.16.04.4+esm1 libklibc-dev - 2.0.4-8ubuntu1.16.04.4+esm1 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5379-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5379-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-04-18"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:537910000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
