{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:43451000000",
	"version": "1",
	"metadata": {
		"title": "USN-4345-1 -- Linux kernel vulnerabilities",
		"description": "Al Viro discovered that the Linux kernel for s390x systems did not properly perform page table upgrades for kernel sections that use secondary address mode. A local attacker could use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2020-11884)  It was discovered that the Intel Wi-Fi driver in the Linux kernel did not properly check for errors in some situations. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2019-16234)  Tristan Madani discovered that the block I/O tracing implementation in the Linux kernel contained a race condition. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2019-19768)  It was discovered that the vhost net driver in the Linux kernel contained a stack buffer overflow. A local attacker with the ability to perform ioctl() calls on /dev/vhost-net could use this to cause a denial of service (system crash). (CVE-2020-10942)  It was discovered that the OV51x USB Camera device driver in the Linux kernel did not properly validate device metadata. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2020-11608)  It was discovered that the STV06XX USB Camera device driver in the Linux kernel did not properly validate device metadata. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2020-11609)  It was discovered that the Xirlink C-It USB Camera device driver in the Linux kernel did not properly validate device metadata. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2020-11668)  It was discovered that the virtual terminal implementation in the Linux kernel contained a race condition. A local attacker could possibly use this to cause a denial of service (system crash) or expose sensitive information. (CVE-2020-8648)  Jordy Zomer discovered that the floppy driver in the Linux kernel did not properly check for errors in some situations. A local attacker could possibly use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2020-9383)  Update Instructions:  Run `sudo pro fix USN-4345-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.15.0-1038-oracle - 4.15.0-1038.42~16.04.1 No subscription required  linux-image-4.15.0-1061-gcp - 4.15.0-1061.65 No subscription required  linux-image-4.15.0-1066-aws - 4.15.0-1066.70~16.04.1 No subscription required  linux-image-4.15.0-1082-azure - 4.15.0-1082.92~16.04.1 No subscription required  linux-image-4.15.0-99-generic - 4.15.0-99.100~16.04.1 linux-image-4.15.0-99-generic-lpae - 4.15.0-99.100~16.04.1 linux-image-4.15.0-99-lowlatency - 4.15.0-99.100~16.04.1 No subscription required  linux-image-oracle - 4.15.0.1038.31 No subscription required  linux-image-gke - 4.15.0.1061.75 linux-image-gcp - 4.15.0.1061.75 No subscription required  linux-image-aws-hwe - 4.15.0.1066.66 No subscription required  linux-image-azure - 4.15.0.1082.81 linux-image-azure-edge - 4.15.0.1082.81 No subscription required  linux-image-virtual-hwe-16.04-edge - 4.15.0.99.106 linux-image-lowlatency-hwe-16.04 - 4.15.0.99.106 linux-image-generic-hwe-16.04-edge - 4.15.0.99.106 linux-image-virtual-hwe-16.04 - 4.15.0.99.106 linux-image-generic-lpae-hwe-16.04 - 4.15.0.99.106 linux-image-generic-lpae-hwe-16.04-edge - 4.15.0.99.106 linux-image-lowlatency-hwe-16.04-edge - 4.15.0.99.106 linux-image-oem - 4.15.0.99.106 linux-image-generic-hwe-16.04 - 4.15.0.99.106 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4345-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4345-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-04-28"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:434510000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:434510000010",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:434510000020",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:434510000030",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:434510000040",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
