{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:44161000000",
	"version": "1",
	"metadata": {
		"title": "USN-4416-1 -- GNU C Library vulnerabilities",
		"description": "Florian Weimer discovered that the GNU C Library incorrectly handled certain memory operations. A remote attacker could use this issue to cause the GNU C Library to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 16.04 LTS. (CVE-2017-12133)  It was discovered that the GNU C Library incorrectly handled certain SSE2-optimized memmove operations. A remote attacker could use this issue to cause the GNU C Library to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 16.04 LTS. (CVE-2017-18269)  It was discovered that the GNU C Library incorrectly handled certain pathname operations. A remote attacker could use this issue to cause the GNU C Library to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 18.04 LTS. (CVE-2018-11236)  It was discovered that the GNU C Library incorrectly handled certain AVX-512-optimized mempcpy operations. A remote attacker could use this issue to cause the GNU C Library to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 18.04 LTS. (CVE-2018-11237)  It was discovered that the GNU C Library incorrectly handled certain hostname loookups. A remote attacker could use this issue to cause the GNU C Library to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 18.04 LTS. (CVE-2018-19591)  Jakub Wilk discovered that the GNU C Library incorrectly handled certain memalign functions. A remote attacker could use this issue to cause the GNU C Library to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 16.04 LTS. (CVE-2018-6485)  It was discovered that the GNU C Library incorrectly ignored the LD_PREFER_MAP_32BIT_EXEC environment variable after security transitions. A local attacker could use this issue to bypass ASLR restrictions. (CVE-2019-19126)  It was discovered that the GNU C Library incorrectly handled certain regular expressions. A remote attacker could possibly use this issue to cause the GNU C Library to crash, resulting in a denial of service. This issue only affected Ubuntu 16.04 LTS and Ubuntu 18.04 LTS. (CVE-2019-9169)  It was discovered that the GNU C Library incorrectly handled certain bit patterns. A remote attacker could use this issue to cause the GNU C Library to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 16.04 LTS and Ubuntu 18.04 LTS. (CVE-2020-10029)  It was discovered that the GNU C Library incorrectly handled certain signal trampolines on PowerPC. A remote attacker could use this issue to cause the GNU C Library to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2020-1751)  It was discovered that the GNU C Library incorrectly handled tilde expansion. A remote attacker could use this issue to cause the GNU C Library to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2020-1752)  Update Instructions:  Run `sudo pro fix USN-4416-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libc6-i386 - 2.23-0ubuntu11.2 libc6-ppc64 - 2.23-0ubuntu11.2 libc6-dev-s390 - 2.23-0ubuntu11.2 glibc-source - 2.23-0ubuntu11.2 libc-bin - 2.23-0ubuntu11.2 libc6-x32 - 2.23-0ubuntu11.2 libc6-s390 - 2.23-0ubuntu11.2 libc6-armel - 2.23-0ubuntu11.2 libc6-pic - 2.23-0ubuntu11.2 libc6-dev-ppc64 - 2.23-0ubuntu11.2 libc6-dev-armel - 2.23-0ubuntu11.2 glibc-doc - 2.23-0ubuntu11.2 multiarch-support - 2.23-0ubuntu11.2 libc6-dev - 2.23-0ubuntu11.2 libc6-amd64 - 2.23-0ubuntu11.2 libc6-dev-amd64 - 2.23-0ubuntu11.2 libc6 - 2.23-0ubuntu11.2 locales-all - 2.23-0ubuntu11.2 libc6-dev-x32 - 2.23-0ubuntu11.2 locales - 2.23-0ubuntu11.2 libc6-udeb - 2.23-0ubuntu11.2 libc6-dev-i386 - 2.23-0ubuntu11.2 libc-dev-bin - 2.23-0ubuntu11.2 nscd - 2.23-0ubuntu11.2 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4416-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4416-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-07-06"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:441610000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
