{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:41863000000",
	"version": "1",
	"metadata": {
		"title": "USN-4186-3 -- Linux kernel vulnerability",
		"description": "USN-4186-1 fixed vulnerabilities in the Linux kernel. It was discovered that the kernel fix for CVE-2019-0155 (i915 missing Blitter Command Streamer check) was incomplete on 64-bit Intel x86 systems. This update addresses the issue.  We apologize for the inconvenience.  Original advisory details:   Stephan van Schaik, Alyssa Milburn, Sebastian Österlund, Pietro Frigo,  Kaveh Razavi, Herbert Bos, Cristiano Giuffrida, Giorgi Maisuradze, Moritz  Lipp, Michael Schwarz, Daniel Gruss, and Jo Van Bulck discovered that Intel  processors using Transactional Synchronization Extensions (TSX) could  expose memory contents previously stored in microarchitectural buffers to a  malicious process that is executing on the same CPU core. A local attacker  could use this to expose sensitive information. (CVE-2019-11135)   It was discovered that the Intel i915 graphics chipsets allowed userspace  to modify page table entries via writes to MMIO from the Blitter Command  Streamer and expose kernel memory information. A local attacker could use  this to expose sensitive information or possibly elevate privileges.  (CVE-2019-0155)   Deepak Gupta discovered that on certain Intel processors, the Linux kernel  did not properly perform invalidation on page table updates by virtual  guest operating systems. A local attacker in a guest VM could use this to  cause a denial of service (host system crash). (CVE-2018-12207)   It was discovered that the Intel i915 graphics chipsets could cause a  system hang when userspace performed a read from GT memory mapped input  output (MMIO) when the product is in certain low power states. A local  attacker could use this to cause a denial of service. (CVE-2019-0154)   Hui Peng discovered that the Atheros AR6004 USB Wi-Fi device driver for the  Linux kernel did not properly validate endpoint descriptors returned by the  device. A physically proximate attacker could use this to cause a denial of  service (system crash). (CVE-2019-15098)   It was discovered that a buffer overflow existed in the 802.11 Wi-Fi  configuration interface for the Linux kernel when handling beacon settings.  A local attacker could use this to cause a denial of service (system crash)  or possibly execute arbitrary code. (CVE-2019-16746)   Ori Nimron discovered that the AX25 network protocol implementation in the  Linux kernel did not properly perform permissions checks. A local attacker  could use this to create a raw socket. (CVE-2019-17052)   Ori Nimron discovered that the IEEE 802.15.4 Low-Rate Wireless network  protocol implementation in the Linux kernel did not properly perform  permissions checks. A local attacker could use this to create a raw socket.  (CVE-2019-17053)   Ori Nimron discovered that the Appletalk network protocol implementation in  the Linux kernel did not properly perform permissions checks. A local  attacker could use this to create a raw socket. (CVE-2019-17054)   Ori Nimron discovered that the modular ISDN network protocol implementation  in the Linux kernel did not properly perform permissions checks. A local  attacker could use this to create a raw socket. (CVE-2019-17055)   Ori Nimron discovered that the Near field Communication (NFC) network  protocol implementation in the Linux kernel did not properly perform  permissions checks. A local attacker could use this to create a raw socket.  (CVE-2019-17056)   Nico Waisman discovered that a buffer overflow existed in the Realtek Wi-Fi  driver for the Linux kernel when handling Notice of Absence frames. A  physically proximate attacker could use this to cause a denial of service  (system crash) or possibly execute arbitrary code. (CVE-2019-17666)   Maddie Stone discovered that the Binder IPC Driver implementation in the  Linux kernel contained a use-after-free vulnerability. A local attacker  could use this to cause a denial of service (system crash) or possibly  execute arbitrary code. (CVE-2019-2215)  Update Instructions:  Run `sudo pro fix USN-4186-3` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.4.0-169-generic - 4.4.0-169.198 linux-image-4.4.0-169-powerpc64-emb - 4.4.0-169.198 linux-image-4.4.0-169-generic-lpae - 4.4.0-169.198 linux-image-4.4.0-169-powerpc64-smp - 4.4.0-169.198 linux-image-4.4.0-169-powerpc-smp - 4.4.0-169.198 linux-image-4.4.0-169-powerpc-e500mc - 4.4.0-169.198 linux-image-4.4.0-169-lowlatency - 4.4.0-169.198 No subscription required  linux-image-powerpc64-smp-lts-utopic - 4.4.0.169.177 linux-image-generic-lts-wily - 4.4.0.169.177 linux-image-powerpc64-emb-lts-vivid - 4.4.0.169.177 linux-image-powerpc-e500mc - 4.4.0.169.177 linux-image-generic-lpae-lts-xenial - 4.4.0.169.177 linux-image-generic-lpae-lts-utopic - 4.4.0.169.177 linux-image-powerpc-e500mc-lts-vivid - 4.4.0.169.177 linux-image-powerpc-e500mc-lts-wily - 4.4.0.169.177 linux-image-generic-lts-vivid - 4.4.0.169.177 linux-image-generic-lpae-lts-wily - 4.4.0.169.177 linux-image-virtual-lts-vivid - 4.4.0.169.177 linux-image-powerpc-e500mc-lts-xenial - 4.4.0.169.177 linux-image-virtual-lts-utopic - 4.4.0.169.177 linux-image-virtual - 4.4.0.169.177 linux-image-powerpc64-emb-lts-wily - 4.4.0.169.177 linux-image-lowlatency-lts-vivid - 4.4.0.169.177 linux-image-generic-lts-utopic - 4.4.0.169.177 linux-image-powerpc64-emb - 4.4.0.169.177 linux-image-powerpc-smp-lts-xenial - 4.4.0.169.177 linux-image-powerpc64-smp-lts-vivid - 4.4.0.169.177 linux-image-lowlatency-lts-wily - 4.4.0.169.177 linux-image-generic - 4.4.0.169.177 linux-image-lowlatency-lts-xenial - 4.4.0.169.177 linux-image-powerpc64-smp-lts-xenial - 4.4.0.169.177 linux-image-powerpc64-emb-lts-utopic - 4.4.0.169.177 linux-image-generic-lts-xenial - 4.4.0.169.177 linux-image-virtual-lts-wily - 4.4.0.169.177 linux-image-powerpc-e500mc-lts-utopic - 4.4.0.169.177 linux-image-powerpc-smp - 4.4.0.169.177 linux-image-generic-lpae-lts-vivid - 4.4.0.169.177 linux-image-generic-lpae - 4.4.0.169.177 linux-image-powerpc64-smp-lts-wily - 4.4.0.169.177 linux-image-powerpc64-emb-lts-xenial - 4.4.0.169.177 linux-image-powerpc-smp-lts-wily - 4.4.0.169.177 linux-image-powerpc64-smp - 4.4.0.169.177 linux-image-powerpc-smp-lts-utopic - 4.4.0.169.177 linux-image-powerpc-smp-lts-vivid - 4.4.0.169.177 linux-image-lowlatency - 4.4.0.169.177 linux-image-virtual-lts-xenial - 4.4.0.169.177 linux-image-lowlatency-lts-utopic - 4.4.0.169.177 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4186-3",
				"ref_url": "https://ubuntu.com/security/notices/USN-4186-3"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2019-11-13"
			},
			"bug": [
				"https://bugs.launchpad.net/bugs/1852141"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:418630000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
