{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:33611000000",
	"version": "1",
	"metadata": {
		"title": "USN-3361-1 -- Linux kernel (HWE) vulnerabilities",
		"description": "USN-3358-1 fixed vulnerabilities in the Linux kernel for Ubuntu 17.04. This update provides the corresponding updates for the Linux Hardware Enablement (HWE) kernel from Ubuntu 17.04 for Ubuntu 16.04 LTS. Please note that this update changes the Linux HWE kernel to the 4.10 based kernel from Ubuntu 17.04, superseding the 4.8 based HWE kernel from Ubuntu 16.10.  Ben Harris discovered that the Linux kernel would strip extended privilege attributes of files when performing a failed unprivileged system call. A local attacker could use this to cause a denial of service. (CVE-2015-1350)  Ralf Spenneberg discovered that the ext4 implementation in the Linux kernel did not properly validate meta block groups. An attacker with physical access could use this to specially craft an ext4 image that causes a denial of service (system crash). (CVE-2016-10208)  Peter Pi discovered that the colormap handling for frame buffer devices in the Linux kernel contained an integer overflow. A local attacker could use this to disclose sensitive information (kernel memory). (CVE-2016-8405)  It was discovered that an integer overflow existed in the InfiniBand RDMA over ethernet (RXE) transport implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2016-8636)  Vlad Tsyrklevich discovered an integer overflow vulnerability in the VFIO PCI driver for the Linux kernel. A local attacker with access to a vfio PCI device file could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2016-9083, CVE-2016-9084)  CAI Qian discovered that the sysctl implementation in the Linux kernel did not properly perform reference counting in some situations. An unprivileged attacker could use this to cause a denial of service (system hang). (CVE-2016-9191)  It was discovered that the keyring implementation in the Linux kernel in some situations did not prevent special internal keyrings from being joined by userspace keyrings. A privileged local attacker could use this to bypass module verification. (CVE-2016-9604)  Dmitry Vyukov, Andrey Konovalov, Florian Westphal, and Eric Dumazet discovered that the netfiler subsystem in the Linux kernel mishandled IPv6 packet reassembly. A local user could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2016-9755)  Andy Lutomirski and Willy Tarreau discovered that the KVM implementation in the Linux kernel did not properly emulate instructions on the SS segment register. A local attacker in a guest virtual machine could use this to cause a denial of service (guest OS crash) or possibly gain administrative privileges in the guest OS. (CVE-2017-2583)  Dmitry Vyukov discovered that the KVM implementation in the Linux kernel improperly emulated certain instructions. A local attacker could use this to obtain sensitive information (kernel memory). (CVE-2017-2584)  Dmitry Vyukov discovered that KVM implementation in the Linux kernel improperly emulated the VMXON instruction. A local attacker in a guest OS could use this to cause a denial of service (memory consumption) in the host OS. (CVE-2017-2596)  It was discovered that SELinux in the Linux kernel did not properly handle empty writes to /proc/pid/attr. A local attacker could use this to cause a denial of service (system crash). (CVE-2017-2618)  Daniel Jiang discovered that a race condition existed in the ipv4 ping socket implementation in the Linux kernel. A local privileged attacker could use this to cause a denial of service (system crash). (CVE-2017-2671)  It was discovered that the freelist-randomization in the SLAB memory allocator allowed duplicate freelist entries. A local attacker could use this to cause a denial of service (system crash). (CVE-2017-5546)  It was discovered that the KLSI KL5KUSB105 serial-to-USB device driver in the Linux kernel did not properly initialize memory related to logging. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2017-5549)  It was discovered that a fencepost error existed in the pipe_advance() function in the Linux kernel. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2017-5550)  It was discovered that the Linux kernel did not clear the setgid bit during a setxattr call on a tmpfs filesystem. A local attacker could use this to gain elevated group privileges. (CVE-2017-5551)  Murray McAllister discovered that an integer overflow existed in the VideoCore DRM driver of the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-5576)  Gareth Evans discovered that the shm IPC subsystem in the Linux kernel did not properly restrict mapping page zero. A local privileged attacker could use this to execute arbitrary code. (CVE-2017-5669)  Andrey Konovalov discovered an out-of-bounds access in the IPv6 Generic Routing Encapsulation (GRE) tunneling implementation in the Linux kernel. An attacker could use this to possibly expose sensitive information. (CVE-2017-5897)  Andrey Konovalov discovered that the IPv4 implementation in the Linux kernel did not properly handle invalid IP options in some situations. An attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2017-5970)  Di Shen discovered that a race condition existed in the perf subsystem of the Linux kernel. A local attacker could use this to cause a denial of service or possibly gain administrative privileges. (CVE-2017-6001)  Dmitry Vyukov discovered that the Linux kernel did not properly handle TCP packets with the URG flag. A remote attacker could use this to cause a denial of service. (CVE-2017-6214)  Andrey Konovalov discovered that the LLC subsytem in the Linux kernel did not properly set up a destructor in certain situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2017-6345)  It was discovered that a race condition existed in the AF_PACKET handling code in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-6346)  Andrey Konovalov discovered that the IP layer in the Linux kernel made improper assumptions about internal data layout when performing checksums. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-6347)  Dmitry Vyukov discovered race conditions in the Infrared (IrDA) subsystem in the Linux kernel. A local attacker could use this to cause a denial of service (deadlock). (CVE-2017-6348)  Dmitry Vyukov discovered that the generic SCSI (sg) subsystem in the Linux kernel contained a stack-based buffer overflow. A local attacker with access to an sg device could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-7187)  It was discovered that a NULL pointer dereference existed in the Direct Rendering Manager (DRM) driver for VMWare devices in the Linux kernel. A local attacker could use this to cause a denial of service (system crash). (CVE-2017-7261)  It was discovered that the USB Cypress HID drivers for the Linux kernel did not properly validate reported information from the device. An attacker with physical access could use this to expose sensitive information (kernel memory). (CVE-2017-7273)  Eric Biggers discovered a memory leak in the keyring implementation in the Linux kernel. A local attacker could use this to cause a denial of service (memory consumption). (CVE-2017-7472)  It was discovered that an information leak existed in the set_mempolicy and mbind compat syscalls in the Linux kernel. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2017-7616)  Sabrina Dubroca discovered that the asynchronous cryptographic hash (ahash) implementation in the Linux kernel did not properly handle a full request queue. A local attacker could use this to cause a denial of service (infinite recursion). (CVE-2017-7618)  Tuomas Haanp채채 and Ari Kauppi discovered that the NFSv2 and NFSv3 server implementations in the Linux kernel did not properly handle certain long RPC replies. A remote attacker could use this to cause a denial of service (system crash). (CVE-2017-7645)  Tommi Rantala and Brad Spengler discovered that the memory manager in the Linux kernel did not properly enforce the CONFIG_STRICT_DEVMEM protection mechanism. A local attacker with access to /dev/mem could use this to expose sensitive information or possibly execute arbitrary code. (CVE-2017-7889)  Tuomas Haanp채채 and Ari Kauppi discovered that the NFSv2 and NFSv3 server implementations in the Linux kernel did not properly check for the end of buffer. A remote attacker could use this to craft requests that cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-7895)  It was discovered that an integer underflow existed in the Edgeport USB Serial Converter device driver of the Linux kernel. An attacker with physical access could use this to expose sensitive information (kernel memory). (CVE-2017-8924)  It was discovered that the USB ZyXEL omni.net LCD PLUS driver in the Linux kernel did not properly perform reference counting. A local attacker could use this to cause a denial of service (tty exhaustion). (CVE-2017-8925)  Jann Horn discovered that bpf in Linux kernel does not restrict the output of the print_bpf_insn function. A local attacker could use this to obtain sensitive address information. (CVE-2017-9150)  Update Instructions:  Run `sudo pro fix USN-3361-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.10.0-27-generic - 4.10.0-27.30~16.04.2 linux-image-4.10.0-27-generic-lpae - 4.10.0-27.30~16.04.2 linux-image-extra-4.10.0-27-generic - 4.10.0-27.30~16.04.2 linux-image-4.10.0-27-lowlatency - 4.10.0-27.30~16.04.2 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3361-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3361-1"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2015-1350",
				"ref_url": "https://ubuntu.com/security/CVE-2015-1350"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2016-10208",
				"ref_url": "https://ubuntu.com/security/CVE-2016-10208"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2016-8405",
				"ref_url": "https://ubuntu.com/security/CVE-2016-8405"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2016-8636",
				"ref_url": "https://ubuntu.com/security/CVE-2016-8636"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2016-9083",
				"ref_url": "https://ubuntu.com/security/CVE-2016-9083"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2016-9084",
				"ref_url": "https://ubuntu.com/security/CVE-2016-9084"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2016-9191",
				"ref_url": "https://ubuntu.com/security/CVE-2016-9191"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2016-9604",
				"ref_url": "https://ubuntu.com/security/CVE-2016-9604"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2016-9755",
				"ref_url": "https://ubuntu.com/security/CVE-2016-9755"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-2583",
				"ref_url": "https://ubuntu.com/security/CVE-2017-2583"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-2584",
				"ref_url": "https://ubuntu.com/security/CVE-2017-2584"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-2596",
				"ref_url": "https://ubuntu.com/security/CVE-2017-2596"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-2618",
				"ref_url": "https://ubuntu.com/security/CVE-2017-2618"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-2671",
				"ref_url": "https://ubuntu.com/security/CVE-2017-2671"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-5546",
				"ref_url": "https://ubuntu.com/security/CVE-2017-5546"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-5549",
				"ref_url": "https://ubuntu.com/security/CVE-2017-5549"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-5550",
				"ref_url": "https://ubuntu.com/security/CVE-2017-5550"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-5551",
				"ref_url": "https://ubuntu.com/security/CVE-2017-5551"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-5576",
				"ref_url": "https://ubuntu.com/security/CVE-2017-5576"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-5669",
				"ref_url": "https://ubuntu.com/security/CVE-2017-5669"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-5897",
				"ref_url": "https://ubuntu.com/security/CVE-2017-5897"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-5970",
				"ref_url": "https://ubuntu.com/security/CVE-2017-5970"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-6001",
				"ref_url": "https://ubuntu.com/security/CVE-2017-6001"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-6214",
				"ref_url": "https://ubuntu.com/security/CVE-2017-6214"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-6345",
				"ref_url": "https://ubuntu.com/security/CVE-2017-6345"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-6346",
				"ref_url": "https://ubuntu.com/security/CVE-2017-6346"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-6347",
				"ref_url": "https://ubuntu.com/security/CVE-2017-6347"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-6348",
				"ref_url": "https://ubuntu.com/security/CVE-2017-6348"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-7187",
				"ref_url": "https://ubuntu.com/security/CVE-2017-7187"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-7261",
				"ref_url": "https://ubuntu.com/security/CVE-2017-7261"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-7273",
				"ref_url": "https://ubuntu.com/security/CVE-2017-7273"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-7472",
				"ref_url": "https://ubuntu.com/security/CVE-2017-7472"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-7616",
				"ref_url": "https://ubuntu.com/security/CVE-2017-7616"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-7618",
				"ref_url": "https://ubuntu.com/security/CVE-2017-7618"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-7645",
				"ref_url": "https://ubuntu.com/security/CVE-2017-7645"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-7889",
				"ref_url": "https://ubuntu.com/security/CVE-2017-7889"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-7895",
				"ref_url": "https://ubuntu.com/security/CVE-2017-7895"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-8924",
				"ref_url": "https://ubuntu.com/security/CVE-2017-8924"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-8925",
				"ref_url": "https://ubuntu.com/security/CVE-2017-8925"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-9150",
				"ref_url": "https://ubuntu.com/security/CVE-2017-9150"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "Medium",
			"issued": {
				"date": "2017-07-21"
			},
			"cve": [
				{
					"text": "CVE-2015-1350",
					"href": "https://ubuntu.com/security/CVE-2015-1350",
					"priority": "low",
					"public": "20160502",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3361-1,4904-1"
				},
				{
					"text": "CVE-2016-10208",
					"href": "https://ubuntu.com/security/CVE-2016-10208",
					"priority": "low",
					"public": "20170206",
					"cvss_score": "4.3",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3234-2,3234-1,3361-1,3754-1"
				},
				{
					"text": "CVE-2016-8405",
					"href": "https://ubuntu.com/security/CVE-2016-8405",
					"priority": "low",
					"public": "20170112",
					"cvss_score": "4.7",
					"cvss_vector": "CVSS:3.0/AV:L/AC:H/PR:N/UI:R/S:U/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "3361-1,3381-1,3381-2"
				},
				{
					"text": "CVE-2016-8636",
					"href": "https://ubuntu.com/security/CVE-2016-8636",
					"priority": "medium",
					"public": "20170222",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3361-1"
				},
				{
					"text": "CVE-2016-9083",
					"href": "https://ubuntu.com/security/CVE-2016-9083",
					"priority": "medium",
					"public": "20161127",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3312-1,3312-2,3361-1,3422-1,3422-2"
				},
				{
					"text": "CVE-2016-9084",
					"href": "https://ubuntu.com/security/CVE-2016-9084",
					"priority": "medium",
					"public": "20161127",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3312-1,3312-2,3361-1,3422-1,3422-2"
				},
				{
					"text": "CVE-2016-9191",
					"href": "https://ubuntu.com/security/CVE-2016-9191",
					"priority": "medium",
					"public": "20161127",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3208-1,3208-2,3361-1,3422-1,3422-2"
				},
				{
					"text": "CVE-2016-9604",
					"href": "https://ubuntu.com/security/CVE-2016-9604",
					"priority": "medium",
					"public": "20161231",
					"cvss_score": "4.4",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:H/UI:N/S:U/C:N/I:H/A:N",
					"cvss_severity": "medium",
					"usns": "3314-1,3312-1,3312-2,3361-1,3422-1,3422-2"
				},
				{
					"text": "CVE-2016-9755",
					"href": "https://ubuntu.com/security/CVE-2016-9755",
					"priority": "medium",
					"public": "20161228",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3359-1,3361-1"
				},
				{
					"text": "CVE-2017-2583",
					"href": "https://ubuntu.com/security/CVE-2017-2583",
					"priority": "medium",
					"public": "20170206",
					"cvss_score": "8.4",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3208-1,3208-2,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-2584",
					"href": "https://ubuntu.com/security/CVE-2017-2584",
					"priority": "medium",
					"public": "20170114",
					"cvss_score": "7.1",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:H",
					"cvss_severity": "high",
					"usns": "3208-1,3208-2,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-2596",
					"href": "https://ubuntu.com/security/CVE-2017-2596",
					"priority": "medium",
					"public": "20170206",
					"cvss_score": "6.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:C/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3293-1,3312-1,3312-2,3361-1"
				},
				{
					"text": "CVE-2017-2618",
					"href": "https://ubuntu.com/security/CVE-2017-2618",
					"priority": "low",
					"public": "20170209",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3361-1,3381-1,3381-2"
				},
				{
					"text": "CVE-2017-2671",
					"href": "https://ubuntu.com/security/CVE-2017-2671",
					"priority": "negligible",
					"public": "20170405",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3314-1,3312-1,3312-2,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-5546",
					"href": "https://ubuntu.com/security/CVE-2017-5546",
					"priority": "low",
					"public": "20170206",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3361-1"
				},
				{
					"text": "CVE-2017-5549",
					"href": "https://ubuntu.com/security/CVE-2017-5549",
					"priority": "low",
					"public": "20170206",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "3208-1,3208-2,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-5550",
					"href": "https://ubuntu.com/security/CVE-2017-5550",
					"priority": "medium",
					"public": "20170206",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "3361-1"
				},
				{
					"text": "CVE-2017-5551",
					"href": "https://ubuntu.com/security/CVE-2017-5551",
					"priority": "medium",
					"public": "20170206",
					"cvss_score": "4.4",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:N",
					"cvss_severity": "medium",
					"usns": "3234-2,3234-1,3359-1,3361-1"
				},
				{
					"text": "CVE-2017-5576",
					"href": "https://ubuntu.com/security/CVE-2017-5576",
					"priority": "medium",
					"public": "20170206",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3359-1,3361-1"
				},
				{
					"text": "CVE-2017-5669",
					"href": "https://ubuntu.com/security/CVE-2017-5669",
					"priority": "medium",
					"public": "20170224",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3265-1,3265-2,3361-1,3583-1,3583-2"
				},
				{
					"text": "CVE-2017-5897",
					"href": "https://ubuntu.com/security/CVE-2017-5897",
					"priority": "low",
					"public": "20170323",
					"cvss_score": "9.8",
					"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "critical",
					"usns": "3265-1,3265-2,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-5970",
					"href": "https://ubuntu.com/security/CVE-2017-5970",
					"priority": "medium",
					"public": "20170214",
					"cvss_score": "7.5",
					"cvss_vector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "high",
					"usns": "3265-1,3265-2,3361-1,3422-1,3422-2"
				},
				{
					"text": "CVE-2017-6001",
					"href": "https://ubuntu.com/security/CVE-2017-6001",
					"priority": "medium",
					"public": "20170218",
					"cvss_score": "7.0",
					"cvss_vector": "CVSS:3.0/AV:L/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3312-1,3312-2,3361-1"
				},
				{
					"text": "CVE-2017-6214",
					"href": "https://ubuntu.com/security/CVE-2017-6214",
					"priority": "medium",
					"public": "20170223",
					"cvss_score": "7.5",
					"cvss_vector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "high",
					"usns": "3265-1,3265-2,3361-1,3422-1,3422-2"
				},
				{
					"text": "CVE-2017-6345",
					"href": "https://ubuntu.com/security/CVE-2017-6345",
					"priority": "low",
					"public": "20170301",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3265-1,3265-2,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-6346",
					"href": "https://ubuntu.com/security/CVE-2017-6346",
					"priority": "medium",
					"public": "20170301",
					"cvss_score": "7.0",
					"cvss_vector": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3265-1,3265-2,3361-1,3422-1,3422-2"
				},
				{
					"text": "CVE-2017-6347",
					"href": "https://ubuntu.com/security/CVE-2017-6347",
					"priority": "medium",
					"public": "20170301",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3265-1,3265-2,3361-1"
				},
				{
					"text": "CVE-2017-6348",
					"href": "https://ubuntu.com/security/CVE-2017-6348",
					"priority": "low",
					"public": "20170301",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3265-1,3265-2,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-7187",
					"href": "https://ubuntu.com/security/CVE-2017-7187",
					"priority": "medium",
					"public": "20170320",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3293-1,3291-1,3291-2,3291-3,3361-1,3422-1,3422-2"
				},
				{
					"text": "CVE-2017-7261",
					"href": "https://ubuntu.com/security/CVE-2017-7261",
					"priority": "low",
					"public": "20170324",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3293-1,3291-1,3291-2,3291-3,3361-1,3406-1,3406-2"
				},
				{
					"text": "CVE-2017-7273",
					"href": "https://ubuntu.com/security/CVE-2017-7273",
					"priority": "medium",
					"public": "20170327",
					"cvss_score": "6.6",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3361-1,3406-1,3406-2"
				},
				{
					"text": "CVE-2017-7472",
					"href": "https://ubuntu.com/security/CVE-2017-7472",
					"priority": "medium",
					"public": "20170511",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3314-1,3312-1,3312-2,3361-1,3422-1,3422-2"
				},
				{
					"text": "CVE-2017-7616",
					"href": "https://ubuntu.com/security/CVE-2017-7616",
					"priority": "medium",
					"public": "20170410",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "3293-1,3291-1,3291-2,3291-3,3361-1,3406-1,3406-2"
				},
				{
					"text": "CVE-2017-7618",
					"href": "https://ubuntu.com/security/CVE-2017-7618",
					"priority": "medium",
					"public": "20170410",
					"cvss_score": "7.5",
					"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "high",
					"usns": "3314-1,3312-1,3312-2,3361-1"
				},
				{
					"text": "CVE-2017-7645",
					"href": "https://ubuntu.com/security/CVE-2017-7645",
					"priority": "medium",
					"public": "20170418",
					"cvss_score": "7.5",
					"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "high",
					"usns": "3314-1,3312-1,3312-2,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-7889",
					"href": "https://ubuntu.com/security/CVE-2017-7889",
					"priority": "medium",
					"public": "20170416",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3314-1,3312-1,3312-2,3361-1,3583-1,3583-2"
				},
				{
					"text": "CVE-2017-7895",
					"href": "https://ubuntu.com/security/CVE-2017-7895",
					"priority": "medium",
					"public": "20170428",
					"cvss_score": "9.8",
					"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "critical",
					"usns": "3314-1,3312-1,3312-2,3359-1,3361-1,3360-1,3360-2"
				},
				{
					"text": "CVE-2017-8924",
					"href": "https://ubuntu.com/security/CVE-2017-8924",
					"priority": "medium",
					"public": "20170512",
					"cvss_score": "4.6",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "3359-1,3361-1,3360-1,3360-2"
				},
				{
					"text": "CVE-2017-8925",
					"href": "https://ubuntu.com/security/CVE-2017-8925",
					"priority": "medium",
					"public": "20170512",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3359-1,3361-1,3360-1,3360-2"
				},
				{
					"text": "CVE-2017-9150",
					"href": "https://ubuntu.com/security/CVE-2017-9150",
					"priority": "medium",
					"public": "20170522",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "3345-1,3359-1,3361-1,3364-1,3364-2,3364-3"
				}
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:336110000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
