{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:32912000000",
	"version": "1",
	"metadata": {
		"title": "USN-3291-2 -- Linux kernel vulnerabilities",
		"description": "USN-3291-1 fixed vulnerabilities in the generic Linux kernel. This update provides the corresponding updates for the Linux kernel built for specific processors and cloud environments.  Dmitry Vyukov discovered that the generic SCSI (sg) subsystem in the Linux kernel contained a stack-based buffer overflow. A local attacker with access to an sg device could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-7187)  It was discovered that a NULL pointer dereference existed in the Direct Rendering Manager (DRM) driver for VMWare devices in the Linux kernel. A local attacker could use this to cause a denial of service (system crash). (CVE-2017-7261)  Li Qiang discovered that an integer overflow vulnerability existed in the Direct Rendering Manager (DRM) driver for VMWare devices in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-7294)  It was discovered that an information leak existed in the set_mempolicy and mbind compat syscalls in the Linux kernel. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2017-7616)  Update Instructions:  Run `sudo pro fix USN-3291-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.4.0-1013-gke - 4.4.0-1013.13 linux-image-extra-4.4.0-1013-gke - 4.4.0-1013.13 No subscription required  linux-image-4.4.0-1017-aws - 4.4.0-1017.26 No subscription required  linux-image-4.4.0-1055-raspi2 - 4.4.0-1055.62 No subscription required  linux-image-4.4.0-1058-snapdragon - 4.4.0-1058.62 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3291-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-3291-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2017-05-17"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:329120000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:329120000010",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:329120000020",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:329120000030",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
