{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:43091000000",
	"version": "1",
	"metadata": {
		"title": "USN-4309-1 -- Vim vulnerabilities",
		"description": "It was discovered that Vim incorrectly handled certain sources. An attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 12.04 ESM, Ubuntu 14.04 ESM and Ubuntu 16.04 LTS (CVE-2017-11109)  It was discovered that Vim incorrectly handled certain files. An attacker could possibly use this issue to execute arbitrary code. This issue only affected Ubuntu 12.04 ESM and Ubuntu 14.04 ESM. (CVE-2017-5953)  It was discovered that Vim incorrectly handled certain inputs. An attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 16.06 LTS. (CVE-2018-20786)  It was discovered that Vim incorrectly handled certain inputs. An attacker could possibly use this issue to cause a denial of service or execute arbitrary code. This issue only affected Ubuntu 18.04 LTS and Ubuntu 19.10. (CVE-2019-20079)  It was discovered that Vim incorrectly handled certain files. An attacker could possibly use this issue to execute arbitrary code. This issue only affected Ubuntu 12.04 ESM, Ubuntu 14.04 ESM and Ubuntu 16.04 LTS. (CVE-2017-6349, CVE-2017-6350)  Update Instructions:  Run `sudo pro fix USN-4309-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  vim-common - 2:7.4.1689-3ubuntu1.4 vim-nox-py2 - 2:7.4.1689-3ubuntu1.4 vim-gnome - 2:7.4.1689-3ubuntu1.4 vim-athena-py2 - 2:7.4.1689-3ubuntu1.4 vim-athena - 2:7.4.1689-3ubuntu1.4 vim-gtk - 2:7.4.1689-3ubuntu1.4 vim-gui-common - 2:7.4.1689-3ubuntu1.4 vim - 2:7.4.1689-3ubuntu1.4 vim-gtk3-py2 - 2:7.4.1689-3ubuntu1.4 vim-doc - 2:7.4.1689-3ubuntu1.4 vim-gtk-py2 - 2:7.4.1689-3ubuntu1.4 vim-tiny - 2:7.4.1689-3ubuntu1.4 vim-gnome-py2 - 2:7.4.1689-3ubuntu1.4 vim-gtk3 - 2:7.4.1689-3ubuntu1.4 vim-nox - 2:7.4.1689-3ubuntu1.4 vim-runtime - 2:7.4.1689-3ubuntu1.4 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4309-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4309-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-03-23"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:430910000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
