{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:32891000000",
	"version": "1",
	"metadata": {
		"title": "USN-3289-1 -- QEMU vulnerabilities",
		"description": "Li Qiang discovered that QEMU incorrectly handled VirtFS directory sharing. A privileged attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. (CVE-2017-7377, CVE-2017-8086)  Jiangxin discovered that QEMU incorrectly handled the Cirrus VGA device. A privileged attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. (CVE-2017-7718)  Li Qiang and Jiangxin discovered that QEMU incorrectly handled the Cirrus VGA device when being used with a VNC connection. A privileged attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service, or possibly execute arbitrary code on the host. In the default installation, when QEMU is used with libvirt, attackers would be isolated by the libvirt AppArmor profile. (CVE-2017-7980)  Jiang Xin discovered that QEMU incorrectly handled the audio subsystem. A privileged attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. (CVE-2017-8309)  Jiang Xin discovered that QEMU incorrectly handled the input subsystem. A privileged attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. This issue only affected Ubuntu 16.04 LTS, Ubuntu 16.10 and Ubuntu 17.04. (CVE-2017-8379)  Update Instructions:  Run `sudo pro fix USN-3289-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  qemu-system-common - 1:2.5+dfsg-5ubuntu10.14 qemu-user-static - 1:2.5+dfsg-5ubuntu10.14 qemu-system-s390x - 1:2.5+dfsg-5ubuntu10.14 qemu-block-extra - 1:2.5+dfsg-5ubuntu10.14 qemu-kvm - 1:2.5+dfsg-5ubuntu10.14 qemu-user - 1:2.5+dfsg-5ubuntu10.14 qemu-guest-agent - 1:2.5+dfsg-5ubuntu10.14 qemu-system - 1:2.5+dfsg-5ubuntu10.14 qemu-utils - 1:2.5+dfsg-5ubuntu10.14 qemu-system-aarch64 - 1:2.5+dfsg-5ubuntu10.14 qemu - 1:2.5+dfsg-5ubuntu10.14 qemu-user-binfmt - 1:2.5+dfsg-5ubuntu10.14 qemu-system-x86 - 1:2.5+dfsg-5ubuntu10.14 qemu-system-misc - 1:2.5+dfsg-5ubuntu10.14 qemu-system-sparc - 1:2.5+dfsg-5ubuntu10.14 qemu-system-arm - 1:2.5+dfsg-5ubuntu10.14 qemu-system-ppc - 1:2.5+dfsg-5ubuntu10.14 qemu-system-mips - 1:2.5+dfsg-5ubuntu10.14 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3289-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3289-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2017-05-16"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:328910000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
