{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:42571000000",
	"version": "1",
	"metadata": {
		"title": "USN-4257-1 -- OpenJDK vulnerabilities",
		"description": "It was discovered that OpenJDK incorrectly handled exceptions during deserialization in BeanContextSupport. An attacker could possibly use this issue to cause a denial of service or other unspecified impact. (CVE-2020-2583)  It was discovered that OpenJDK incorrectly validated properties of SASL messages included in Kerberos GSSAPI. An unauthenticated remote attacker with network access via Kerberos could possibly use this issue to insert, modify or obtain sensitive information. (CVE-2020-2590)  It was discovered that OpenJDK incorrectly validated URLs. An attacker could possibly use this issue to insert, edit or obtain sensitive information. (CVE-2020-2593)  It was discovered that OpenJDK Security component still used MD5 algorithm. A remote attacker could possibly use this issue to obtain sensitive information. (CVE-2020-2601)  It was discovered that OpenJDK incorrectly handled the application of serialization filters. An attacker could possibly use this issue to bypass the intended filter during serialization. (CVE-2020-2604)  Bo Zhang and Long Kuan discovered that OpenJDK incorrectly handled X.509 certificates. An attacker could possibly use this issue to cause a denial of service. (CVE-2020-2654)  Bengt Jonsson, Juraj Somorovsky, Kostis Sagonas, Paul Fiterau Brostean and Robert Merget discovered that OpenJDK incorrectly handled CertificateVerify TLS handshake messages. A remote attacker could possibly use this issue to insert, edit or obtain sensitive information. This issue only affected OpenJDK 11. (CVE-2020-2655)  It was discovered that OpenJDK incorrectly enforced the limit of datagram sockets that can be created by a code running within a Java sandbox. An attacker could possibly use this issue to bypass the sandbox restrictions causing a denial of service. This issue only affected OpenJDK 8. (CVE-2020-2659)  Update Instructions:  Run `sudo pro fix USN-4257-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  openjdk-8-doc - 8u242-b08-0ubuntu3~16.04 openjdk-8-jdk - 8u242-b08-0ubuntu3~16.04 openjdk-8-jre-headless - 8u242-b08-0ubuntu3~16.04 openjdk-8-jre - 8u242-b08-0ubuntu3~16.04 openjdk-8-jdk-headless - 8u242-b08-0ubuntu3~16.04 openjdk-8-source - 8u242-b08-0ubuntu3~16.04 openjdk-8-jre-zero - 8u242-b08-0ubuntu3~16.04 openjdk-8-demo - 8u242-b08-0ubuntu3~16.04 openjdk-8-jre-jamvm - 8u242-b08-0ubuntu3~16.04 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4257-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4257-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-01-28"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:425710000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
