{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:30991000000",
	"version": "1",
	"metadata": {
		"title": "USN-3099-1 -- Linux kernel vulnerabilities",
		"description": "Vladimír Beneš discovered an unbounded recursion in the VLAN and TEB Generic Receive Offload (GRO) processing implementations in the Linux kernel, A remote attacker could use this to cause a stack corruption, leading to a denial of service (system crash). (CVE-2016-7039)  Marco Grassi discovered a use-after-free condition could occur in the TCP retransmit queue handling code in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2016-6828)  Pengfei Wang discovered a race condition in the s390 SCLP console driver for the Linux kernel when handling ioctl()s. A local attacker could use this to obtain sensitive information from kernel memory. (CVE-2016-6130)  Pengfei Wang discovered a race condition in the Adaptec AAC RAID controller driver in the Linux kernel when handling ioctl()s. A local attacker could use this to cause a denial of service (system crash). (CVE-2016-6480)  Update Instructions:  Run `sudo pro fix USN-3099-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.4.0-42-powerpc-smp - 4.4.0-42.62 linux-image-4.4.0-42-generic-lpae - 4.4.0-42.62 linux-image-4.4.0-42-powerpc-e500mc - 4.4.0-42.62 linux-image-4.4.0-42-powerpc64-emb - 4.4.0-42.62 linux-image-extra-4.4.0-42-generic - 4.4.0-42.62 linux-image-4.4.0-42-generic - 4.4.0-42.62 linux-image-4.4.0-42-powerpc64-smp - 4.4.0-42.62 linux-image-4.4.0-42-lowlatency - 4.4.0-42.62 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3099-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3099-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-10-11"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:309910000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
