{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:37761000000",
	"version": "1",
	"metadata": {
		"title": "USN-3776-1 -- Linux kernel vulnerabilities",
		"description": "Jann Horn discovered that the vmacache subsystem did not properly handle sequence number overflows, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2018-17182)  It was discovered that the paravirtualization implementation in the Linux kernel did not properly handle some indirect calls, reducing the effectiveness of Spectre v2 mitigations for paravirtual guests. A local attacker could use this to expose sensitive information. (CVE-2018-15594)  It was discovered that microprocessors utilizing speculative execution and prediction of return addresses via Return Stack Buffer (RSB) may allow unauthorized memory reads via sidechannel attacks. An attacker could use this to expose sensitive information. (CVE-2018-15572)  It was discovered that a NULL pointer dereference could be triggered in the OCFS2 file system implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash). (CVE-2017-18216)  It was discovered that a race condition existed in the raw MIDI driver for the Linux kernel, leading to a double free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-10902)  It was discovered that a stack-based buffer overflow existed in the iSCSI target implementation of the Linux kernel. A remote attacker could use this to cause a denial of service (system crash). (CVE-2018-14633)  It was discovered that the YUREX USB device driver for the Linux kernel did not properly restrict user space reads or writes. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-16276)  It was discovered that a memory leak existed in the IRDA subsystem of the Linux kernel. A local attacker could use this to cause a denial of service (kernel memory exhaustion). (CVE-2018-6554)  It was discovered that a use-after-free vulnerability existed in the IRDA implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-6555)  Update Instructions:  Run `sudo pro fix USN-3776-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.4.0-1035-kvm - 4.4.0-1035.41 No subscription required  linux-image-4.4.0-1069-aws - 4.4.0-1069.79 No subscription required  linux-image-4.4.0-1098-raspi2 - 4.4.0-1098.106 No subscription required  linux-image-4.4.0-1102-snapdragon - 4.4.0-1102.107 No subscription required  linux-image-4.4.0-137-powerpc-smp - 4.4.0-137.163 linux-image-4.4.0-137-generic - 4.4.0-137.163 linux-image-4.4.0-137-powerpc-e500mc - 4.4.0-137.163 linux-image-4.4.0-137-generic-lpae - 4.4.0-137.163 linux-image-4.4.0-137-lowlatency - 4.4.0-137.163 linux-image-4.4.0-137-powerpc64-smp - 4.4.0-137.163 linux-image-extra-4.4.0-137-generic - 4.4.0-137.163 linux-image-4.4.0-137-powerpc64-emb - 4.4.0-137.163 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3776-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3776-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2018-10-01"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:377610000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:377610000010",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:377610000020",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:377610000030",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:377610000040",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
