{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:34683000000",
	"version": "1",
	"metadata": {
		"title": "USN-3468-3 -- Linux kernel (GCP) vulnerabilities",
		"description": "It was discovered that the KVM subsystem in the Linux kernel did not properly bound guest IRQs. A local attacker in a guest VM could use this to cause a denial of service (host system crash). (CVE-2017-1000252)  It was discovered that the Flash-Friendly File System (f2fs) implementation in the Linux kernel did not properly validate superblock metadata. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-10663)  Anthony Perard discovered that the Xen virtual block driver did not properly initialize some data structures before passing them to user space. A local attacker in a guest VM could use this to expose sensitive information from the host OS or other guest VMs. (CVE-2017-10911)  It was discovered that a use-after-free vulnerability existed in the POSIX message queue implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-11176)  Dave Chinner discovered that the XFS filesystem did not enforce that the realtime inode flag was settable only on filesystems on a realtime device. A local attacker could use this to cause a denial of service (system crash). (CVE-2017-14340)  Update Instructions:  Run `sudo pro fix USN-3468-3` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-extra-4.10.0-1008-gcp - 4.10.0-1008.8 linux-image-4.10.0-1008-gcp - 4.10.0-1008.8 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3468-3",
				"ref_url": "https://ubuntu.com/security/notices/USN-3468-3"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2017-10-31"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:346830000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
