{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:32532000000",
	"version": "1",
	"metadata": {
		"title": "USN-3253-2 -- Nagios regression",
		"description": "USN-3253-1 fixed vulnerabilities in Nagios. The update prevented log files from being displayed in the web interface. This update fixes the problem.  We apologize for the inconvenience.  Original advisory details:   It was discovered that Nagios incorrectly handled certain long strings. A  remote authenticated attacker could use this issue to cause Nagios to  crash, resulting in a denial of service, or possibly obtain sensitive  information. (CVE-2013-7108, CVE-2013-7205)    It was discovered that Nagios incorrectly handled certain long messages to  cmd.cgi. A remote attacker could possibly use this issue to cause Nagios to  crash, resulting in a denial of service. (CVE-2014-1878)    Dawid Golunski discovered that Nagios incorrectly handled symlinks when  accessing log files. A local attacker could possibly use this issue to  elevate privileges. In the default installation of Ubuntu, this should be  prevented by the Yama link restrictions. (CVE-2016-9566)  Update Instructions:  Run `sudo pro fix USN-3253-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  nagios3-core - 3.5.1.dfsg-2.1ubuntu1.3 nagios3-doc - 3.5.1.dfsg-2.1ubuntu1.3 nagios3-cgi - 3.5.1.dfsg-2.1ubuntu1.3 nagios3-common - 3.5.1.dfsg-2.1ubuntu1.3 nagios3 - 3.5.1.dfsg-2.1ubuntu1.3 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3253-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-3253-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2017-06-07"
			},
			"bug": [
				"https://launchpad.net/bugs/1690380"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:325320000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
