{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:62001000000",
	"version": "1",
	"metadata": {
		"title": "USN-6200-1 -- ImageMagick vulnerabilities",
		"description": "It was discovered that ImageMagick incorrectly handled the \"-authenticate\" option for password-protected PDF files. An attacker could possibly use this issue to inject additional shell commands and perform arbitrary code execution. This issue only affected Ubuntu 20.04 LTS. (CVE-2020-29599)  It was discovered that ImageMagick incorrectly handled certain values when processing PDF files. If a user or automated system using ImageMagick were tricked into opening a specially crafted PDF file, an attacker could exploit this to cause a denial of service. This issue only affected Ubuntu 20.04 LTS. (CVE-2021-20224)  Zhang Xiaohui discovered that ImageMagick incorrectly handled certain values when processing image data. If a user or automated system using ImageMagick were tricked into opening a specially crafted image, an attacker could exploit this to cause a denial of service. This issue only affected Ubuntu 20.04 LTS. (CVE-2021-20241, CVE-2021-20243)  It was discovered that ImageMagick incorrectly handled certain values when processing visual effects based image files. By tricking a user into opening a specially crafted image file, an attacker could crash the application causing a denial of service. This issue only affected Ubuntu 20.04 LTS. (CVE-2021-20244, CVE-2021-20309)  It was discovered that ImageMagick incorrectly handled certain values when performing resampling operations. By tricking a user into opening a specially crafted image file, an attacker could crash the application causing a denial of service. This issue only affected Ubuntu 20.04 LTS. (CVE-2021-20246)  It was discovered that ImageMagick incorrectly handled certain values when processing thumbnail image data. By tricking a user into opening a specially crafted image file, an attacker could crash the application causing a denial of service. This issue only affected Ubuntu 20.04 LTS. (CVE-2021-20312)  It was discovered that ImageMagick incorrectly handled memory cleanup when performing certain cryptographic operations. Under certain conditions sensitive cryptographic information could be disclosed. This issue only affected Ubuntu 20.04 LTS. (CVE-2021-20313)  It was discovered that ImageMagick did not use the correct rights when specifically excluded by a module policy. An attacker could use this issue to read and write certain restricted files. This issue only affected Ubuntu 20.04 LTS. (CVE-2021-39212)  It was discovered that ImageMagick incorrectly handled memory under certain circumstances. If a user were tricked into opening a specially crafted image file, an attacker could possibly exploit this issue to cause a denial of service or other unspecified impact. This issue only affected Ubuntu 20.04 LTS. (CVE-2022-28463, CVE-2022-32545, CVE-2022-32546, CVE-2022-32547)  It was discovered that ImageMagick incorrectly handled memory under certain circumstances. If a user were tricked into opening a specially crafted image file, an attacker could possibly exploit this issue to cause a denial of service or other unspecified impact. This issue only affected Ubuntu 22.04 LTS, Ubuntu 22.10, and Ubuntu 23.04. (CVE-2021-3610, CVE-2023-1906, CVE-2023-3428)  It was discovered that ImageMagick incorrectly handled certain values when processing specially crafted SVG files. By tricking a user into opening a specially crafted SVG file, an attacker could crash the application causing a denial of service. This issue only affected Ubuntu 20.04 LTS, Ubuntu 22.04 LTS, Ubuntu 22.10, and Ubuntu 23.04. (CVE-2023-1289)  It was discovered that ImageMagick incorrectly handled memory under certain circumstances. If a user were tricked into opening a specially crafted tiff file, an attacker could possibly exploit this issue to cause a denial of service or other unspecified impact. This issue only affected Ubuntu 22.04 LTS, Ubuntu 22.10, and Ubuntu 23.04. (CVE-2023-3195)  It was discovered that ImageMagick incorrectly handled memory under certain circumstances. If a user were tricked into opening a specially crafted image file, an attacker could possibly exploit this issue to cause a denial of service or other unspecified impact. (CVE-2023-34151)  Update Instructions:  Run `sudo pro fix USN-6200-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  imagemagick-common - 8:6.8.9.9-7ubuntu5.16+esm8 libmagickcore-6.q16-dev - 8:6.8.9.9-7ubuntu5.16+esm8 libmagickcore-dev - 8:6.8.9.9-7ubuntu5.16+esm8 imagemagick - 8:6.8.9.9-7ubuntu5.16+esm8 imagemagick-doc - 8:6.8.9.9-7ubuntu5.16+esm8 libmagickwand-dev - 8:6.8.9.9-7ubuntu5.16+esm8 libmagickcore-6.q16-2-extra - 8:6.8.9.9-7ubuntu5.16+esm8 libmagick++-6-headers - 8:6.8.9.9-7ubuntu5.16+esm8 libimage-magick-q16-perl - 8:6.8.9.9-7ubuntu5.16+esm8 libimage-magick-perl - 8:6.8.9.9-7ubuntu5.16+esm8 libmagick++-dev - 8:6.8.9.9-7ubuntu5.16+esm8 imagemagick-6.q16 - 8:6.8.9.9-7ubuntu5.16+esm8 libmagick++-6.q16-5v5 - 8:6.8.9.9-7ubuntu5.16+esm8 perlmagick - 8:6.8.9.9-7ubuntu5.16+esm8 libmagickwand-6.q16-2 - 8:6.8.9.9-7ubuntu5.16+esm8 libmagickcore-6-arch-config - 8:6.8.9.9-7ubuntu5.16+esm8 libmagick++-6.q16-dev - 8:6.8.9.9-7ubuntu5.16+esm8 libmagickwand-6.q16-dev - 8:6.8.9.9-7ubuntu5.16+esm8 libmagickcore-6-headers - 8:6.8.9.9-7ubuntu5.16+esm8 libmagickwand-6-headers - 8:6.8.9.9-7ubuntu5.16+esm8 libmagickcore-6.q16-2 - 8:6.8.9.9-7ubuntu5.16+esm8 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6200-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6200-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-07-04"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:620010000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
