{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:31531000000",
	"version": "1",
	"metadata": {
		"title": "USN-3153-1 -- Oxide vulnerabilities",
		"description": "Multiple vulnerabilities were discovered in Chromium. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to conduct cross-site scripting (XSS) attacks, read uninitialized memory, obtain sensitive information, spoof the webview URL, bypass same origin restrictions, cause a denial of service via application crash, or execute arbitrary code. (CVE-2016-5204, CVE-2016-5205, CVE-2016-5207, CVE-2016-5208, CVE-2016-5209, CVE-2016-5212, CVE-2016-5215, CVE-2016-5222, CVE-2016-5224, CVE-2016-5225, CVE-2016-5226, CVE-2016-9650, CVE-2016-9652)  Multiple vulnerabilities were discovered in V8. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to obtain sensitive information, cause a denial of service via application crash, or execute arbitrary code. (CVE-2016-5213, CVE-2016-5219, CVE-2016-9651)  An integer overflow was discovered in ANGLE. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via application crash, or execute arbitrary code. (CVE-2016-5221)  Update Instructions:  Run `sudo pro fix USN-3153-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  liboxideqtcore0 - 1.19.4-0ubuntu0.16.04.1 liboxideqt-qmlplugin - 1.19.4-0ubuntu0.16.04.1 liboxideqtquick-dev - 1.19.4-0ubuntu0.16.04.1 oxideqt-codecs-extra - 1.19.4-0ubuntu0.16.04.1 liboxideqtcore-dev - 1.19.4-0ubuntu0.16.04.1 oxideqt-doc - 1.19.4-0ubuntu0.16.04.1 oxideqt-codecs - 1.19.4-0ubuntu0.16.04.1 liboxideqtquick0 - 1.19.4-0ubuntu0.16.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3153-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3153-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-12-09"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:315310000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
