{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:49461000000",
	"version": "1",
	"metadata": {
		"title": "USN-4946-1 -- Linux kernel vulnerabilities",
		"description": "It was discovered that the DRM subsystem in the Linux kernel contained double-free vulnerabilities. A privileged attacker could possibly use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-20292)  Olivier Benjamin, Norbert Manthey, Martin Mazein, and Jan H. Schönherr discovered that the Xen paravirtualization backend in the Linux kernel did not properly propagate errors to frontend drivers in some situations. An attacker in a guest VM could possibly use this to cause a denial of service (host domain crash). (CVE-2021-26930)  Jan Beulich discovered that multiple Xen backends in the Linux kernel did not properly handle certain error conditions under paravirtualization. An attacker in a guest VM could possibly use this to cause a denial of service (host domain crash). (CVE-2021-26931)  Jan Beulich discovered that the Xen netback backend in the Linux kernel did not properly handle certain error conditions under paravirtualization. An attacker in a guest VM could possibly use this to cause a denial of service (host domain crash). (CVE-2021-28038)  It was discovered that the Xen paravirtualization backend in the Linux kernel did not properly deallocate memory in some situations. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2021-28688)  It was discovered that the Freescale Gianfar Ethernet driver for the Linux kernel did not properly handle receive queue overrun when jumbo frames were enabled in some situations. An attacker could use this to cause a denial of service (system crash). (CVE-2021-29264)  It was discovered that the USB/IP driver in the Linux kernel contained race conditions during the update of local and shared status. An attacker could use this to cause a denial of service (system crash). (CVE-2021-29265)  It was discovered that a race condition existed in the netfilter subsystem of the Linux kernel when replacing tables. A local attacker could use this to cause a denial of service (system crash). (CVE-2021-29650)  Arnd Bergmann discovered that the video4linux subsystem in the Linux kernel did not properly deallocate memory in some situations. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2021-30002)  Update Instructions:  Run `sudo pro fix USN-4946-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.15.0-1071-oracle - 4.15.0-1071.79~16.04.1 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro  linux-image-4.15.0-1099-gcp - 4.15.0-1099.112~16.04.1 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro  linux-image-4.15.0-1102-aws - 4.15.0-1102.109~16.04.1 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro  linux-image-4.15.0-143-generic - 4.15.0-143.147~16.04.3 linux-image-4.15.0-143-lowlatency - 4.15.0-143.147~16.04.3 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro  linux-image-oracle - 4.15.0.1071.59 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro  linux-image-gke - 4.15.0.1099.100 linux-image-gcp - 4.15.0.1099.100 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro  linux-image-aws-hwe - 4.15.0.1102.93 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro  linux-image-virtual-hwe-16.04 - 4.15.0.143.139 linux-image-virtual-hwe-16.04-edge - 4.15.0.143.139 linux-image-lowlatency-hwe-16.04-edge - 4.15.0.143.139 linux-image-oem - 4.15.0.143.139 linux-image-lowlatency-hwe-16.04 - 4.15.0.143.139 linux-image-generic-hwe-16.04 - 4.15.0.143.139 linux-image-generic-hwe-16.04-edge - 4.15.0.143.139 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4946-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4946-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2021-05-11"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:494610000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:494610000010",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:494610000020",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:494610000030",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
