{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:29741000000",
	"version": "1",
	"metadata": {
		"title": "USN-2974-1 -- QEMU vulnerabilities",
		"description": "Zuozhi Fzz discovered that QEMU incorrectly handled USB OHCI emulation support. A privileged attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. (CVE-2016-2391)  Qinghao Tang discovered that QEMU incorrectly handled USB Net emulation support. A privileged attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. (CVE-2016-2392)  Qinghao Tang discovered that QEMU incorrectly handled USB Net emulation support. A privileged attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service, or possibly leak host memory bytes. (CVE-2016-2538)  Hongke Yang discovered that QEMU incorrectly handled NE2000 emulation support. A privileged attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. (CVE-2016-2841)  Ling Liu discovered that QEMU incorrectly handled IP checksum routines. An attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service, or possibly leak host memory bytes. (CVE-2016-2857)  It was discovered that QEMU incorrectly handled the PRNG back-end support. An attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. This issue only applied to Ubuntu 14.04 LTS, Ubuntu 15.10 and Ubuntu 16.04 LTS. (CVE-2016-2858)  Wei Xiao and Qinghao Tang discovered that QEMU incorrectly handled access in the VGA module. A privileged attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service, or possibly execute arbitrary code on the host. In the default installation, when QEMU is used with libvirt, attackers would be isolated by the libvirt AppArmor profile. (CVE-2016-3710)  Zuozhi Fzz discovered that QEMU incorrectly handled access in the VGA module. A privileged attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service, or possibly execute arbitrary code on the host. In the default installation, when QEMU is used with libvirt, attackers would be isolated by the libvirt AppArmor profile. (CVE-2016-3712)  Oleksandr Bazhaniuk discovered that QEMU incorrectly handled Luminary Micro Stellaris ethernet controller emulation. A remote attacker could use this issue to cause QEMU to crash, resulting in a denial of service. (CVE-2016-4001)  Oleksandr Bazhaniuk discovered that QEMU incorrectly handled MIPSnet controller emulation. A remote attacker could use this issue to cause QEMU to crash, resulting in a denial of service. (CVE-2016-4002)  Donghai Zdh discovered that QEMU incorrectly handled the Task Priority Register(TPR). A privileged attacker inside the guest could use this issue to possibly leak host memory bytes. This issue only applied to Ubuntu 14.04 LTS, Ubuntu 15.10 and Ubuntu 16.04 LTS. (CVE-2016-4020)  Du Shaobo discovered that QEMU incorrectly handled USB EHCI emulation support. A privileged attacker inside the guest could use this issue to cause QEMU to consume resources, resulting in a denial of service. (CVE-2016-4037)  Update Instructions:  Run `sudo pro fix USN-2974-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  qemu-system-common - 1:2.5+dfsg-5ubuntu10.1 qemu-user-static - 1:2.5+dfsg-5ubuntu10.1 qemu-system-s390x - 1:2.5+dfsg-5ubuntu10.1 qemu-block-extra - 1:2.5+dfsg-5ubuntu10.1 qemu-kvm - 1:2.5+dfsg-5ubuntu10.1 qemu-user - 1:2.5+dfsg-5ubuntu10.1 qemu-guest-agent - 1:2.5+dfsg-5ubuntu10.1 qemu-system - 1:2.5+dfsg-5ubuntu10.1 qemu-utils - 1:2.5+dfsg-5ubuntu10.1 qemu-system-aarch64 - 1:2.5+dfsg-5ubuntu10.1 qemu - 1:2.5+dfsg-5ubuntu10.1 qemu-user-binfmt - 1:2.5+dfsg-5ubuntu10.1 qemu-system-x86 - 1:2.5+dfsg-5ubuntu10.1 qemu-system-misc - 1:2.5+dfsg-5ubuntu10.1 qemu-system-sparc - 1:2.5+dfsg-5ubuntu10.1 qemu-system-arm - 1:2.5+dfsg-5ubuntu10.1 qemu-system-ppc - 1:2.5+dfsg-5ubuntu10.1 qemu-system-mips - 1:2.5+dfsg-5ubuntu10.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2974-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2974-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-05-12"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:297410000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
