{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:57272000000",
	"version": "1",
	"metadata": {
		"title": "USN-5727-2 -- Linux kernel (GCP) vulnerabilities",
		"description": "It was discovered that a race condition existed in the instruction emulator of the Linux kernel on Arm 64-bit systems. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-20422)  It was discovered that the KVM implementation in the Linux kernel did not properly handle virtual CPUs without APICs in certain situations. A local attacker could possibly use this to cause a denial of service (host system crash). (CVE-2022-2153)  Hao Sun and Jiacheng Xu discovered that the NILFS file system implementation in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-2978)  Abhishek Shah discovered a race condition in the PF_KEYv2 implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information (kernel memory). (CVE-2022-3028)  It was discovered that the IDT 77252 ATM PCI device driver in the Linux kernel did not properly remove any pending timers during device exit, resulting in a use-after-free vulnerability. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-3635)  It was discovered that the Netlink Transformation (XFRM) subsystem in the Linux kernel contained a reference counting error. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-36879)  Xingyuan Mo and Gengjia Chen discovered that the Promise SuperTrak EX storage controller driver in the Linux kernel did not properly handle certain structures. A local attacker could potentially use this to expose sensitive information (kernel memory). (CVE-2022-40768)  Update Instructions:  Run `sudo pro fix USN-5727-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-unsigned-4.15.0-1138-gcp - 4.15.0-1138.154~16.04.1 linux-modules-extra-4.15.0-1138-gcp - 4.15.0-1138.154~16.04.1 linux-gcp-headers-4.15.0-1138 - 4.15.0-1138.154~16.04.1 linux-modules-4.15.0-1138-gcp - 4.15.0-1138.154~16.04.1 linux-image-4.15.0-1138-gcp - 4.15.0-1138.154~16.04.1 linux-headers-4.15.0-1138-gcp - 4.15.0-1138.154~16.04.1 linux-tools-4.15.0-1138-gcp - 4.15.0-1138.154~16.04.1 linux-buildinfo-4.15.0-1138-gcp - 4.15.0-1138.154~16.04.1 linux-gcp-tools-4.15.0-1138 - 4.15.0-1138.154~16.04.1 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro  linux-image-gke - 4.15.0.1138.132 linux-tools-gcp - 4.15.0.1138.132 linux-image-gcp - 4.15.0.1138.132 linux-modules-extra-gcp - 4.15.0.1138.132 linux-modules-extra-gke - 4.15.0.1138.132 linux-headers-gke - 4.15.0.1138.132 linux-gke - 4.15.0.1138.132 linux-gcp - 4.15.0.1138.132 linux-headers-gcp - 4.15.0.1138.132 linux-tools-gke - 4.15.0.1138.132 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5727-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-5727-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-11-18"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:572720000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
