{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:33501000000",
	"version": "1",
	"metadata": {
		"title": "USN-3350-1 -- poppler vulnerabilities",
		"description": "Aleksandar Nikolic discovered that poppler incorrectly handled JPEG 2000 images. If a user or automated system were tricked into opening a crafted PDF file, an attacker could cause a denial of service or possibly execute arbitrary code with privileges of the user invoking the program. (CVE-2017-2820)  Jiaqi Peng discovered that the poppler pdfunite tool incorrectly parsed certain malformed PDF documents. If a user or automated system were tricked into opening a crafted PDF file, an attacker could cause poppler to crash, resulting in a denial of service. (CVE-2017-7511)  It was discovered that the poppler pdfunite tool incorrectly parsed certain malformed PDF documents. If a user or automated system were tricked into opening a crafted PDF file, an attacker could cause poppler to hang, resulting in a denial of service. (CVE-2017-7515)  It was discovered that poppler incorrectly handled JPEG 2000 images. If a user or automated system were tricked into opening a crafted PDF file, an attacker could cause cause poppler to crash, resulting in a denial of service. (CVE-2017-9083)  It was discovered that poppler incorrectly handled memory when processing PDF documents. If a user or automated system were tricked into opening a crafted PDF file, an attacker could cause poppler to consume resources, resulting in a denial of service. (CVE-2017-9406, CVE-2017-9408)  Alberto Garcia, Francisco Oca, and Suleman Ali discovered that the poppler pdftocairo tool incorrectly parsed certain malformed PDF documents. If a user or automated system were tricked into opening a crafted PDF file, an attacker could cause poppler to crash, resulting in a denial of service. (CVE-2017-9775)  Update Instructions:  Run `sudo pro fix USN-3350-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libpoppler58 - 0.41.0-0ubuntu1.2 poppler-utils - 0.41.0-0ubuntu1.2 libpoppler-cpp-dev - 0.41.0-0ubuntu1.2 libpoppler-cpp0 - 0.41.0-0ubuntu1.2 gir1.2-poppler-0.18 - 0.41.0-0ubuntu1.2 libpoppler-glib-doc - 0.41.0-0ubuntu1.2 libpoppler-dev - 0.41.0-0ubuntu1.2 libpoppler-glib8 - 0.41.0-0ubuntu1.2 libpoppler-private-dev - 0.41.0-0ubuntu1.2 libpoppler-qt4-dev - 0.41.0-0ubuntu1.2 libpoppler-glib-dev - 0.41.0-0ubuntu1.2 libpoppler-qt4-4 - 0.41.0-0ubuntu1.2 libpoppler-qt5-dev - 0.41.0-0ubuntu1.2 libpoppler-qt5-1 - 0.41.0-0ubuntu1.2 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3350-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3350-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2017-07-07"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:335010000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
