{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:32391000000",
	"version": "1",
	"metadata": {
		"title": "USN-3239-1 -- GNU C Library vulnerabilities",
		"description": "It was discovered that the GNU C Library incorrectly handled the strxfrm() function. An attacker could use this issue to cause a denial of service or possibly execute arbitrary code. This issue only affected Ubuntu 12.04 LTS and Ubuntu 14.04 LTS. (CVE-2015-8982)  It was discovered that an integer overflow existed in the _IO_wstr_overflow() function of the GNU C Library. An attacker could use this to cause a denial of service or possibly execute arbitrary code. This issue only affected Ubuntu 12.04 LTS and Ubuntu 14.04 LTS. (CVE-2015-8983)  It was discovered that the fnmatch() function in the GNU C Library did not properly handle certain malformed patterns. An attacker could use this to cause a denial of service. This issue only affected Ubuntu 12.04 LTS and Ubuntu 14.04 LTS. (CVE-2015-8984)  Alexander Cherepanov discovered a stack-based buffer overflow in the glob implementation of the GNU C Library. An attacker could use this to specially craft a directory layout and cause a denial of service. (CVE-2016-1234)  Florian Weimer discovered a NULL pointer dereference in the DNS resolver of the GNU C Library. An attacker could use this to cause a denial of service. (CVE-2015-5180)  Michael Petlan discovered an unbounded stack allocation in the getaddrinfo() function of the GNU C Library. An attacker could use this to cause a denial of service. (CVE-2016-3706)  Aldy Hernandez discovered an unbounded stack allocation in the sunrpc implementation in the GNU C Library. An attacker could use this to cause a denial of service. (CVE-2016-4429)  Tim Ruehsen discovered that the getaddrinfo() implementation in the GNU C Library did not properly track memory allocations. An attacker could use this to cause a denial of service. This issue only affected Ubuntu 16.04 LTS. (CVE-2016-5417)  Andreas Schwab discovered that the GNU C Library on ARM 32-bit platforms did not properly set up execution contexts. An attacker could use this to cause a denial of service. (CVE-2016-6323)  Update Instructions:  Run `sudo pro fix USN-3239-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libc6-i386 - 2.23-0ubuntu6 libc6-ppc64 - 2.23-0ubuntu6 libc6-dev-s390 - 2.23-0ubuntu6 glibc-source - 2.23-0ubuntu6 libc-bin - 2.23-0ubuntu6 libc6-x32 - 2.23-0ubuntu6 libc6-s390 - 2.23-0ubuntu6 libc6-armel - 2.23-0ubuntu6 libc6-pic - 2.23-0ubuntu6 libc6-dev-ppc64 - 2.23-0ubuntu6 libc6-dev-armel - 2.23-0ubuntu6 glibc-doc - 2.23-0ubuntu6 multiarch-support - 2.23-0ubuntu6 libc6-dev - 2.23-0ubuntu6 libc6-amd64 - 2.23-0ubuntu6 libc6-dev-amd64 - 2.23-0ubuntu6 libc6 - 2.23-0ubuntu6 locales-all - 2.23-0ubuntu6 libc6-dev-x32 - 2.23-0ubuntu6 locales - 2.23-0ubuntu6 libc6-udeb - 2.23-0ubuntu6 libc6-dev-i386 - 2.23-0ubuntu6 libc-dev-bin - 2.23-0ubuntu6 nscd - 2.23-0ubuntu6 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3239-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3239-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2017-03-21"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:323910000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
