{
	"class": "patch",
	"id": "oval:com.ubuntu.xenial:def:42721000000",
	"version": "1",
	"metadata": {
		"title": "USN-4272-1 -- Pillow vulnerabilities",
		"description": "It was discovered that Pillow incorrectly handled certain images. An attacker could possibly use this issue to cause a denial of service. (CVE-2019-16865, CVE-2019-19911)  It was discovered that Pillow incorrectly handled certain images. An attacker could possibly use this issue to execute arbitrary code. (CVE-2020-5312)  It was discovered that Pillow incorrectly handled certain TIFF images. An attacker could possibly use this issue to cause a crash. This issue only affected Ubuntu 19.10. (CVE-2020-5310)  It was discovered that Pillow incorrectly handled certain SGI images. An attacker could possibly use this issue to execute arbitrary code or cause a crash. This issue only affected Ubuntu 18.04 and Ubuntu 19.10. (CVE-2020-5311)  It was discovered that Pillow incorrectly handled certain PCX images. An attackter could possibly use this issue to execute arbitrary code or cause a crash. (CVE-2020-5312)  It was discovered that Pillow incorrectly handled certain Flip images. An attacker could possibly use this issue to execute arbitrary code or cause a crash. (CVE-2020-5313)  Update Instructions:  Run `sudo pro fix USN-4272-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  python3-pil.imagetk - 3.1.2-0ubuntu1.3 python-pil-doc - 3.1.2-0ubuntu1.3 python3-pil - 3.1.2-0ubuntu1.3 python-pil.imagetk - 3.1.2-0ubuntu1.3 python-imaging - 3.1.2-0ubuntu1.3 python-pil - 3.1.2-0ubuntu1.3 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4272-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4272-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-02-06"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:427210000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
