{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:201755320000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2017-5532 on Ubuntu 18.04 ESM (bionic) - medium.",
		"Description": "A vulnerability in the report renderer component of TIBCO JasperReports Server, TIBCO JasperReports Server Community Edition, TIBCO JasperReports Server for ActiveMatrix BPM, TIBCO JasperReports Library, TIBCO JasperReports Library for ActiveMatrix BPM, TIBCO Jaspersoft for AWS with Multi-Tenancy, TIBCO Jaspersoft Reporting and Analytics for AWS, TIBCO Jaspersoft Studio, and TIBCO Jaspersoft Studio for ActiveMatrix BPM may allow a subset of authorized users to perform persistent cross-site scripting (XSS) attacks. Affected releases are TIBCO JasperReports Server 6.2.3 and below; 6.3.0; 6.3.1; 6.3.2; 6.4.0, TIBCO JasperReports Server Community Edition 6.4.0 and below, TIBCO JasperReports Server for ActiveMatrix BPM 6.4.0 and below, TIBCO JasperReports Library 6.2.3 and below; 6.3.0; 6.3.1; 6.3.2; 6.4.0; 6.4.1, TIBCO JasperReports Library for ActiveMatrix BPM 6.4.1 and below, TIBCO Jaspersoft for AWS with Multi-Tenancy 6.4.0 and below, TIBCO Jaspersoft Reporting and Analytics for AWS 6.4.0 and below, TIBCO Jaspersoft Studio 6.2.3 and below; 6.3.0; 6.3.1; 6.3.2; 6.4.0, and TIBCO Jaspersoft Studio for ActiveMatrix BPM 6.4.0 and below.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 18.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2017-5532",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-5532"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2017 Canonical Ltd.",
			"PublicDate": "2017-11-15 21:29:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2017-5532",
				"href": "https://ubuntu.com/security/CVE-2017-5532",
				"public": "20171115",
				"cvss_score": "5.4",
				"cvss_vector": "CVSS:3.0/AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:L/A:N"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": "msalvatore> \"... a malicious user can gain access toa more privileged account.\""
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.bionic:tst:2017149410000000",
				"comment": "jasperreports package in bionic is affected and may need fixing."
			}
		]
	}
}
