{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2023413370000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-41337 on Ubuntu 18.04 ESM (bionic) - medium",
		"description": "h2o is an HTTP server with support for HTTP/1.x, HTTP/2 and HTTP/3. Inversion 2.3.0-beta2 and prior, when h2o is configured to listen to multipleaddresses or ports with each of them using different backend serversmanaged by multiple entities, a malicious backend entity that also has theopportunity to observe or inject packets exchanged between the client andh2o may misdirect HTTPS requests going to other backends and observe thecontents of that HTTPS request being sent. The attack involves a victimclient trying to resume a TLS connection and an attacker redirecting thepackets to a different address or port than that intended by the client.The attacker must already have been configured by the administrator of h2oto act as a backend to one of the addresses or ports that the h2o instancelistens to. Session IDs and tickets generated by h2o are not bound toinformation specific to the server address, port, or the X.509 certificate,and therefore it is possible for an attacker to force the victim connectionto wrongfully resume against a different server address or port on whichthe same h2o instance is listening. Once a TLS session is misdirected toresume to a server address / port that is configured to use anattacker-controlled server as the backend, depending on the configuration,HTTPS requests from the victim client may be forwarded to the attacker'sserver. An H2O instance is vulnerable to this attack only if the instanceis configured to listen to different addresses or ports using the listendirective at the host level and the instance is configured to connect tobackend servers managed by multiple entities. A patch is available atcommit 35760540337a47e5150da0f4a66a609fad2ef0ab. As a workaround, one maystop using using host-level listen directives in favor of global-levelones.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-41337",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-41337"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-12-12 20:15:00 UTC",
			"bug": [
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=1059413"
			],
			"cve": {
				"text": "CVE-2023-41337",
				"href": "https://ubuntu.com/security/CVE-2023-41337",
				"public": "20231212",
				"cvss_score": "6.7",
				"cvss_vector": "CVSS:3.1/AV:A/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201806080000000",
						"comment": "h2o package in esm-apps/bionic is affected and may need fixing."
					}
				]
			}
		]
	}
}
