{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2022311560000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2022-31156 on Ubuntu 18.04 ESM (bionic) - medium",
		"Description": "Gradle is a build tool. Dependency verification is a security feature inGradle Build Tool that was introduced to allow validation of externaldependencies either through their checksum or cryptographic signatures. Inversions 6.2 through 7.4.2, there are some cases in which Gradle may skipthat verification and accept a dependency that would otherwise fail thebuild as an untrusted external artifact. This can occur in two ways. Whensignature verification is disabled but the verification metadata containsentries for dependencies that only have a `gpg` element but no `checksum`element. When signature verification is enabled, the verification metadatacontains entries for dependencies with a `gpg` element but there is nosignature file on the remote repository. In both cases, the verificationwill accept the dependency, skipping signature verification and notcomplaining that the dependency has no checksum entry. For builds that arevulnerable, there are two risks. Gradle could download a malicious binaryfrom a repository outside your organization due to name squatting. Forthose still using HTTP only and not HTTPS for downloading dependencies, thebuild could download a malicious library instead of the expected one.Gradle 7.5 patches this issue by making sure to run checksum verificationif signature verification cannot be completed, whatever the reason. Twoworkarounds are available: Remove all `gpg` elements from dependencyverification metadata if you disable signature validation and/or avoidadding `gpg` entries for dependencies that do not have signature files.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 18.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-31156",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-31156"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2022 Canonical Ltd.",
			"PublicDate": "2022-07-14 20:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2022-31156",
				"href": "https://ubuntu.com/security/CVE-2022-31156",
				"public": "20220714",
				"cvss_score": "4.4",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:H/UI:N/S:U/C:N/I:H/A:N"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2019150520000000",
						"comment": "gradle package in esm-apps/bionic is affected and may need fixing."
					}
				]
			}
		]
	}
}
