{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2022231240000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-23124 on Ubuntu 18.04 ESM (bionic) - medium",
		"description": "This vulnerability allows remote attackers to disclose sensitiveinformation on affected installations of Netatalk. Authentication is notrequired to exploit this vulnerability. The specific flaw exists within theget_finderinfo method. The issue results from the lack of proper validationof user-supplied data, which can result in a read past the end of anallocated buffer. An attacker can leverage this in conjunction with othervulnerabilities to execute arbitrary code in the context of root. WasZDI-CAN-15870.This vulnerability allows remote attackers to disclose sensitiveinformation on affected installations of Netatalk. Authentication is notrequired to exploit this vulnerability.The specific flaw exists within the get_finderinfo method. The issueresults from the lack of proper validation of user-supplied data, which canresult in a read past the end of an allocated buffer. An attacker canleverage this in conjunction with other vulnerabilities to executearbitrary code in the context of root.]",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-23124",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-23124"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-03-21 08:36:00 UTC",
			"cve": {
				"text": "CVE-2022-23124",
				"href": "https://ubuntu.com/security/CVE-2022-23124",
				"public": "20220321",
				"cvss_score": "9.8",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
				"usns": "6146-1"
			},
			"public_date_at_usn": "2022-03-21 08:36:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-6146-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202201940000000",
						"comment": "netatalk: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'changes too intrusive')."
					}
				]
			}
		]
	}
}
