{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2020120620000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2020-12062 on Ubuntu 18.04 ESM (bionic) - negligible.",
		"Description": "** DISPUTED ** The scp client in OpenSSH 8.2 incorrectly sends duplicate responses to the server upon a utimes system call failure, which allows a malicious unprivileged user on the remote server to overwrite arbitrary files in the client's download directory by creating a crafted subdirectory anywhere on the remote server. The victim must use the command scp -rp to download a file hierarchy containing, anywhere inside, this crafted subdirectory. NOTE: the vendor points out that \"this attack can achieve no more than a hostile peer is already able to achieve within the scp protocol\" and \"utimes does not fail under normal circumstances.\"",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 18.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-12062",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-12062"
		},
		"advisory": {
			"Severity": "Negligible",
			"Rights": "Copyright (C) 2020 Canonical Ltd.",
			"PublicDate": "2020-06-01 16:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2020-12062",
				"href": "https://ubuntu.com/security/CVE-2020-12062",
				"public": "20200601",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": "seth-arnold> openssh-ssh1 is provided for compatibility with old devices that cannot be upgraded to modern protocols. Thus we may not provide security support for this package if doing so would prevent access to equipment. mdeslaur> this issue has been disputed as being a security issue, we will not be fixing this issue in Ubuntu."
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2020141450000000",
						"comment": "openssh: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2018206850000010",
						"comment": "openssh-ssh1: while related to the CVE in some way, a decision has been made to ignore this issue."
					}
				]
			}
		]
	}
}
