{
	"class": "patch",
	"id": "oval:com.ubuntu.impish:def:53201000000",
	"version": "1",
	"metadata": {
		"title": "5320-1 -- Expat vulnerabilities and regression",
		"description": "USN-5288-1 fixed several vulnerabilities in Expat. For CVE-2022-25236 it caused a regression and an additional patch was required. This update address this regression and several other vulnerabilities.  It was discovered that Expat incorrectly handled certain files. An attacker could possibly use this issue to cause a denial of service. (CVE-2022-25313)  It was discovered that Expat incorrectly handled certain files. An attacker could possibly use this issue to cause a crash or execute arbitrary code. This issue only affected Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, and Ubuntu 21.10. (CVE-2022-25314)  It was discovered that Expat incorrectly handled certain files. An attacker could possibly use this issue to cause a crash or execute arbitrary code. (CVE-2022-25315)  Original advisory details:   It was discovered that Expat incorrectly handled certain files.  An attacker could possibly use this issue to cause a crash or  execute arbitrary code. (CVE-2022-25236)  Update Instructions:  Run `sudo ua fix USN-5320-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  expat - 2.4.1-2ubuntu0.3 libexpat1-dev - 2.4.1-2ubuntu0.3 libexpat1 - 2.4.1-2ubuntu0.3 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 21.10"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5320-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5320-1"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-25313",
				"ref_url": "https://ubuntu.com/security/CVE-2022-25313"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-25314",
				"ref_url": "https://ubuntu.com/security/CVE-2022-25314"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-25315",
				"ref_url": "https://ubuntu.com/security/CVE-2022-25315"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "Medium",
			"issued": {
				"date": "2022-03-10"
			},
			"bug": [
				"https://launchpad.net/bugs/1963903"
			]
		}
	},
	"criteria": {
		"operator": "OR",
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.impish:tst:532010000000",
				"comment": "Interim Release"
			}
		]
	}
}
