{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2023343250000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-34325 on Ubuntu 18.04 LTS (bionic) - medium",
		"description": "[This CNA information record relates to multiple CVEs; the text explainswhich aspects/vulnerabilities correspond to which CVE.] libfsimage containsparsing code for several filesystems, most of them based on grub-legacycode. libfsimage is used by pygrub to inspect guest disks. Pygrub runs asthe same user as the toolstack (root in a priviledged domain). At least oneissue has been reported to the Xen Security Team that allows an attacker totrigger a stack buffer overflow in libfsimage. After further analisys theXen Security Team is no longer confident in the suitability of libfsimagewhen run against guest controlled input with super user priviledges. Inorder to not affect current deployments that rely on pygrub patches areprovided in the resolution section of the advisory that allow runningpygrub in deprivileged mode. CVE-2023-4949 refers to the original issue inthe upstream grub project (\"An attacker with local access to a system(either through a disk or external drive) can present a modified XFSpartition to grub-legacy in such a way to exploit a memory corruption ingrub’s XFS file system implementation.\") CVE-2023-34325 refers specificallyto the vulnerabilities in Xen's copy of libfsimage, which is decended froma very old version of grub.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-34325",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-34325"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-01-05 17:15:00 UTC",
			"cve": {
				"text": "CVE-2023-34325",
				"href": "https://ubuntu.com/security/CVE-2023-34325",
				"public": "20240105",
				"cvss_score": "7.8",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2018109820000000",
						"comment": "xen: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
