{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2023280960000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-28096 on Ubuntu 18.04 LTS (bionic) - medium",
		"description": "OpenSIPS, a Session Initiation Protocol (SIP) server implementation, has amemory leak starting in the 2.3 branch and priot to versions 3.1.8 and3.2.5. The memory leak was detected in the function `parse_mi_request`while performing coverage-guided fuzzing. This issue can be reproduced bysending multiple requests of the form `{\"jsonrpc\": \"2.0\",\"method\":\"log_le`. This malformed message was tested against an instance of OpenSIPSvia FIFO transport layer and was found to increase the memory consumptionover time. To abuse this memory leak, attackers need to reach themanagement interface (MI) which typically should only be exposed on trustedinterfaces. In cases where the MI is exposed to the internet withoutauthentication, abuse of this issue will lead to memory exhaustion whichmay affect the underlying system’s availability. No authentication istypically required to reproduce this issue. On the other hand, memory leaksmay occur in other areas of OpenSIPS where the cJSON library is used forparsing JSON objects. The issue has been fixed in versions 3.1.8 and 3.2.5.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-28096",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-28096"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-03-15 22:15:00 UTC",
			"cve": {
				"text": "CVE-2023-28096",
				"href": "https://ubuntu.com/security/CVE-2023-28096",
				"public": "20230315",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2023275960000000",
						"comment": "opensips package in bionic is affected and may need fixing."
					}
				]
			}
		]
	}
}
