{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:202416350000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-1635 on Ubuntu 18.04 LTS (bionic) - medium",
		"description": "A vulnerability was found in Undertow. This vulnerability impacts a serverthat supports the wildfly-http-client protocol. Whenever a malicious useropens and closes a connection with the HTTP port of the server and thencloses the connection immediately, the server will end with both memory andopen file limits exhausted at some point, depending on the amount of memoryavailable. At HTTP upgrade to remoting, the WriteTimeoutStreamSinkConduitleaks connections if RemotingConnection is closed by RemotingServerConnectionOpenListener. Because the remoting connection originates inUndertow as part of the HTTP upgrade, there is an external layer to theremoting connection. This connection is unaware of the outermost layer whenclosing the connection during the connection opening procedure. Hence, theUndertow WriteTimeoutStreamSinkConduit is not notified of the closedconnection in this scenario. Because WriteTimeoutStreamSinkConduit createsa timeout task, the whole dependency tree leaks via that task, which isadded to XNIO WorkerThread. So, the workerThread points to the Undertowconduit, which contains the connections and causes the leak.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-1635",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-1635"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-02-19 22:15:00 UTC",
			"cve": {
				"text": "CVE-2024-1635",
				"href": "https://ubuntu.com/security/CVE-2024-1635",
				"public": "20240219"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2017121650000000",
						"comment": "undertow package in bionic is affected and may need fixing."
					}
				]
			}
		]
	}
}
