{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2019195770000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2019-19577 on Ubuntu 18.04 LTS (bionic) - medium",
		"description": "An issue was discovered in Xen through 4.12.x allowing x86 AMD HVM guest OSusers to cause a denial of service or possibly gain privileges bytriggering data-structure access during pagetable-height updates. Whenrunning on AMD systems with an IOMMU, Xen attempted to dynamically adaptthe number of levels of pagetables (the pagetable height) in the IOMMUaccording to the guest's address space size. The code to select and updatethe height had several bugs. Notably, the update was done without taking alock which is necessary for safe operation. A malicious guest administratorcan cause Xen to access data structures while they are being modified,causing Xen to crash. Privilege escalation is thought to be very difficultbut cannot be ruled out. Additionally, there is a potential memory leak of4kb per guest boot, under memory pressure. Only Xen on AMD CPUs isvulnerable. Xen running on Intel CPUs is not vulnerable. ARM systems arenot vulnerable. Only systems where guests are given direct access tophysical devices are vulnerable. Systems which do not use PCI pass-throughare not vulnerable. Only HVM guests can exploit the vulnerability. PV andPVH guests cannot. All versions of Xen with IOMMU support are vulnerable.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2019-19577",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-19577"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2019 Canonical Ltd.",
			"public_date": "2019-12-11 18:16:00 UTC",
			"cve": {
				"text": "CVE-2019-19577",
				"href": "https://ubuntu.com/security/CVE-2019-19577",
				"public": "20191211",
				"cvss_score": "7.2",
				"cvss_vector": "CVSS:3.1/AV:P/AC:L/PR:H/UI:N/S:C/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2018109820000000",
						"comment": "xen package in bionic is affected and may need fixing."
					}
				]
			}
		]
	}
}
