{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2022236300000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-23630 on Ubuntu 18.04 LTS (bionic) - medium",
		"description": "Gradle is a build tool with a focus on build automation and support formulti-language development. In some cases, Gradle may skip thatverification and accept a dependency that would otherwise fail the build asan untrusted external artifact. This occurs when dependency verification isdisabled on one or more configurations and those configurations have commondependencies with other configurations that have dependency verificationenabled. If the configuration that has dependency verification disabled isresolved first, Gradle does not verify the common dependencies for theconfiguration that has dependency verification enabled. Gradle 7.4 fixesthat issue by validating artifacts at least once if they are present in aresolved configuration that has dependency verification active. For userswho cannot update either do not use`ResolutionStrategy.disableDependencyVerification()` and do not use pluginsthat use that method to disable dependency verification for a singleconfiguration or make sure resolution of configuration that disable thatfeature do not happen in builds that resolve configuration where thefeature is enabled.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-23630",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-23630"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-02-10 20:15:00 UTC",
			"cve": {
				"text": "CVE-2022-23630",
				"href": "https://ubuntu.com/security/CVE-2022-23630",
				"public": "20220210",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2019150520000000",
						"comment": "gradle package in bionic is affected and may need fixing."
					}
				]
			}
		]
	}
}
