{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2021212610000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-21261 on Ubuntu 18.04 LTS (bionic) - medium.",
		"Description": "Flatpak is a system for building, distributing, and running sandboxed desktop applications on Linux. A bug was discovered in the `flatpak-portal` service that can allow sandboxed applications to execute arbitrary code on the host system (a sandbox escape). This sandbox-escape bug is present in versions from 0.11.4 and before fixed versions 1.8.5 and 1.10.0. The Flatpak portal D-Bus service (`flatpak-portal`, also known by its D-Bus service name `org.freedesktop.portal.Flatpak`) allows apps in a Flatpak sandbox to launch their own subprocesses in a new sandbox instance, either with the same security settings as the caller or with more restrictive security settings. For example, this is used in Flatpak-packaged web browsers such as Chromium to launch subprocesses that will process untrusted web content, and give those subprocesses a more restrictive sandbox than the browser itself. In vulnerable versions, the Flatpak portal service passes caller-specified environment variables to non-sandboxed processes on the host system, and in particular to the `flatpak run` command that is used to launch the new sandbox instance. A malicious or compromised Flatpak app could set environment variables that are trusted by the `flatpak run` command, and use them to execute arbitrary code that is not in a sandbox. As a workaround, this vulnerability can be mitigated by preventing the `flatpak-portal` service from starting, but that mitigation will prevent many Flatpak apps from working correctly. This is fixed in versions 1.8.5 and 1.10.0.\n\nUpdate Instructions:\n\nRun `sudo pro fix CVE-2021-21261` to fix the vulnerability. The problem can be corrected\nby updating your system to the following package versions:\n\nflatpak - 1.0.9-0ubuntu0.2\nflatpak-tests - 1.0.9-0ubuntu0.2\ngir1.2-flatpak-1.0 - 1.0.9-0ubuntu0.2\nlibflatpak0 - 1.0.9-0ubuntu0.2\nNo subscription required",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 18.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-21261",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-21261"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2021 Canonical Ltd.",
			"PublicDate": "2021-01-14 20:15:00 UTC",
			"Bug": [
				"https://bugs.launchpad.net/bugs/1911473"
			],
			"cve": {
				"text": "CVE-2021-21261",
				"href": "https://ubuntu.com/security/CVE-2021-21261",
				"public": "20210114",
				"cvss_score": "8.8",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H",
				"usns": "4721-1"
			},
			"PublicDateAtUsn": "2021-01-14 20:15:00 UTC",
			"AssignedTo": "pfsmorigo",
			"DiscoveredBy": "Simon McVittie",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.bionic:tst:2021212610000000",
				"comment": "flatpak package in bionic was vulnerable but has been fixed (note: '1.0.9-0ubuntu0.2')."
			}
		]
	}
}
