{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:201857410000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2018-5741 on Ubuntu 18.04 LTS (bionic) - negligible.",
		"Description": "To provide fine-grained controls over the ability to use Dynamic DNS (DDNS) to update records in a zone, BIND 9 provides a feature called update-policy. Various rules can be configured to limit the types of updates that can be performed by a client, depending on the key used when sending the update request. Unfortunately, some rule types were not initially documented, and when documentation for them was added to the Administrator Reference Manual (ARM) in change #3112, the language that was added to the ARM at that time incorrectly described the behavior of two rule types, krb5-subdomain and ms-subdomain. This incorrect documentation could mislead operators into believing that policies they had configured were more restrictive than they actually were. This affects BIND versions prior to BIND 9.11.5 and BIND 9.12.3.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 18.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2018-5741",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-5741"
		},
		"advisory": {
			"Severity": "Negligible",
			"Rights": "Copyright (C) 2019 Canonical Ltd.",
			"PublicDate": "2019-01-16 20:29:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2018-5741",
				"href": "https://ubuntu.com/security/CVE-2018-5741",
				"public": "20190116",
				"cvss_score": "6.5",
				"cvss_vector": "CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:N"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": "mdeslaur> per the ISC advisory: \"At the present time, ISC is not providing any code changing the behavior of the update-policy feature.\" deferring for now to see if the policy will change  documentation changes went into 9.11.5  we will not be changing the documentation in our stable releases"
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.bionic:tst:202328280000000",
				"comment": "bind9: while related to the CVE in some way, a decision has been made to ignore this issue."
			}
		]
	}
}
