{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2024273090000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-27309 on Ubuntu 18.04 LTS (bionic) - medium",
		"description": "While an Apache Kafka cluster is being migrated from ZooKeeper mode toKRaft mode, in some cases ACLs will not be correctly enforced. Twopreconditions are needed to trigger the bug: 1. The administrator decidesto remove an ACL 2. The resource associated with the removed ACL continuesto have two or more other ACLs associated with it after the removal. Whenthose two preconditions are met, Kafka will treat the resource as if it hadonly one ACL associated with it after the removal, rather than the two ormore that would be correct. The incorrect condition is cleared by removingall brokers in ZK mode, or by adding a new ACL to the affected resource.Once the migration is completed, there is no metadata loss (the ACLs allremain). The full impact depends on the ACLs in use. If only ALLOW ACLswere configured during the migration, the impact would be limited toavailability impact. if DENY ACLs were configured, the impact could includeconfidentiality and integrity impact depending on the ACLs configured, asthe DENY ACLs might be ignored due to this vulnerability during themigration period.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-27309",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-27309"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-04-12 07:15:00 UTC",
			"bug": [
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=786460"
			],
			"cve": {
				"text": "CVE-2024-27309",
				"href": "https://ubuntu.com/security/CVE-2024-27309",
				"public": "20240412"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2021381530000000",
						"comment": "kafka package in bionic is affected and may need fixing."
					}
				]
			}
		]
	}
}
