{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2020141450000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2020-14145 on Ubuntu 18.04 LTS (bionic) - low.",
		"Description": "The client side in OpenSSH 5.7 through 8.4 has an Observable Discrepancy leading to an information leak in the algorithm negotiation. This allows man-in-the-middle attackers to target initial connection attempts (where no host key for the server has been cached by the client). NOTE: some reports state that 8.5 and 8.6 are also affected.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 18.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-14145",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-14145"
		},
		"advisory": {
			"Severity": "Low",
			"Rights": "Copyright (C) 2020 Canonical Ltd.",
			"PublicDate": "2020-06-29 18:15:00 UTC",
			"Bug": [
				"https://bugzilla.mindrot.org/show_bug.cgi?id=3313",
				"https://bugs.launchpad.net/ubuntu/+source/openssh/+bug/2030275",
				"https://bugs.launchpad.net/ubuntu/+source/openssh/+bug/2030275"
			],
			"cve": {
				"text": "CVE-2020-14145",
				"href": "https://ubuntu.com/security/CVE-2020-14145",
				"public": "20200629",
				"cvss_score": "5.9",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N",
				"usns": "6279-1"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": "seth-arnold> openssh-ssh1 is provided for compatibility with old devices that cannot be upgraded to modern protocols. Thus we may not provide security support for this package if doing so would prevent access to equipment. mdeslaur> Per the advisory, \"The developers of OpenSSH are not planning to change the behavior of OpenSSH regarding this issue\" We will not be releasing updates for Ubuntu for this issue.  On 2020-12-02, it was announced that a partial mitigation has been commited by OpenSSH developers in 8.4p1 that improves this issue in a very specific scenario, specifically when the client has a host key that happens to match the first entry in the preferred algorithm list: https://www.openwall.com/lists/oss-security/2020/12/02/1  The mitigation does not solve this vulnerability in most use cases.  litios> OpenSSH cannot be fixed to fully mitigate this CVE as fixing it would disable the reordering of host key algorithms, breaking RFC 4253. The partial mitigation disables this reordering only in a single specific situation. Marking as ignored. mdeslaur> The upstream OpenSSH developers marked the bug associated with this issue as \"Won't Fix\", stating \"we consider the automatic ordering of host key algorithms an important feature for security. ... Disabling this feature wholesale would IMO result in a net *loss* of security as it would force more connections that already have learned a hostkey to accept a new one of a different algorithm, thereby needlessly exposing them to MITM risk.\"  Jammy and later Ubuntu releases contain the OpenSSH version that includes the mitigation. Focal and older Ubuntu releases have been updated to include the mitigation in USN-6279-1.  This issue only affects the OpenSSH client, not the server."
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2020141450000000",
						"comment": "openssh: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was deferred')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2018206850000010",
						"comment": "openssh-ssh1: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was deferred')."
					}
				]
			}
		]
	}
}
