{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2023405870000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-40587 on Ubuntu 18.04 LTS (bionic) - low",
		"description": "Pyramid is an open source Python web framework. A path traversalvulnerability in Pyramid versions 2.0.0 and 2.0.1 impacts users of Python3.11 that are using a Pyramid static view with a full filesystem path andhave a `index.html` file that is located exactly one directory above thelocation of the static view's file system path. No further path traversalexists, and the only file that could be disclosed accidentally is`index.html`. Pyramid version 2.0.2 rejects any path that contains anull-byte out of caution. While valid in directory/file names, we wouldstrongly consider it a mistake to use null-bytes in namingfiles/directories. Secondly, Python 3.11, and 3.12 has fixed the underlyingissue in `os.path.normpath` to no longer truncate on the first `0x00`found, returning the behavior to pre-3.11 Python, un an as of yetunreleased version. Fixes will be available in:Python 3.12.0rc2 and 3.11.5.Some workarounds are available. Use a version of Python 3 that is notaffected, downgrade to Python 3.10 series temporarily, or wait until Python3.11.5 is released and upgrade to the latest version of Python 3.11 series.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-40587",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40587"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-08-25 21:15:00 UTC",
			"cve": {
				"text": "CVE-2023-40587",
				"href": "https://ubuntu.com/security/CVE-2023-40587",
				"public": "20230825",
				"cvss_score": "5.3",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2023405870000000",
						"comment": "python-pyramid package in bionic is affected and may need fixing."
					}
				]
			}
		]
	}
}
