{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:202436610000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-3661 on Ubuntu 18.04 LTS (bionic) - medium",
		"description": "By design, the DHCP protocol does not authenticate messages, including forexample the classless static route option (121). An attacker with theability to send DHCP messages can manipulate routes to redirect VPNtraffic, allowing the attacker to read, disrupt, or possibly modify networktraffic that was expected to be protected by the VPN. Many, if not most VPNsystems based on IP routing are susceptible to such attacks.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-3661",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-3661"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-06 19:15:00 UTC",
			"cve": {
				"text": "CVE-2024-3661",
				"href": "https://ubuntu.com/security/CVE-2024-3661",
				"public": "20240506"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000000",
						"comment": "connman package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000010",
						"comment": "gadmin-openvpn-client package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000020",
						"comment": "gadmin-openvpn-server package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000030",
						"comment": "kvpnc package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201853890000000",
						"comment": "libreswan package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000040",
						"comment": "n2n package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000050",
						"comment": "network-manager-fortisslvpn package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000060",
						"comment": "network-manager-iodine package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000070",
						"comment": "network-manager-l2tp package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000080",
						"comment": "network-manager-openconnect package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000090",
						"comment": "network-manager-openvpn package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000100",
						"comment": "network-manager-pptp package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000110",
						"comment": "network-manager-strongswan package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000120",
						"comment": "network-manager-vpnc package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2020128230000000",
						"comment": "openconnect package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202070410000000",
						"comment": "openfortivpn package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201875440000000",
						"comment": "openvpn package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000130",
						"comment": "pptp-linux package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000140",
						"comment": "pptpd package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000150",
						"comment": "quicktun package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000160",
						"comment": "sshuttle package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2018167370000000",
						"comment": "tinc package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202436610000170",
						"comment": "vpnc package in bionic is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2021468730000000",
						"comment": "wireguard package in bionic is affected, but a decision has been made to defer addressing it."
					}
				]
			}
		]
	}
}
