{
	"class": "patch",
	"id": "oval:com.ubuntu.mantic:def:66521000000",
	"version": "1",
	"metadata": {
		"title": "USN-6652-1 -- Linux kernel (Azure) vulnerabilities",
		"description": "Marek Marczykowski-Górecki discovered that the Xen event channel infrastructure implementation in the Linux kernel contained a race condition. An attacker in a guest VM could possibly use this to cause a denial of service (paravirtualized device unavailability). (CVE-2023-34324)  Zheng Wang discovered a use-after-free in the Renesas Ethernet AVB driver in the Linux kernel during device removal. A privileged attacker could use this to cause a denial of service (system crash). (CVE-2023-35827)  Tom Dohrmann discovered that the Secure Encrypted Virtualization (SEV) implementation for AMD processors in the Linux kernel contained a race condition when accessing MMIO registers. A local attacker in a SEV guest VM could possibly use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-46813)  It was discovered that the io_uring subsystem in the Linux kernel contained a race condition, leading to a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-46862)  It was discovered that a race condition existed in the ATM (Asynchronous Transfer Mode) subsystem of the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-51780)  It was discovered that a race condition existed in the AppleTalk networking subsystem of the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-51781)  It was discovered that the netfilter subsystem in the Linux kernel did not properly validate inner tunnel netlink attributes, leading to a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-5972)  It was discovered that the TLS subsystem in the Linux kernel did not properly perform cryptographic operations in some situations, leading to a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-6176)  Jann Horn discovered that a race condition existed in the Linux kernel when handling io_uring over sockets, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-6531)  Xingyuan Mo discovered that the netfilter subsystem in the Linux kernel did not properly handle dynset expressions passed from userspace, leading to a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-6622)  Zhenghan Wang discovered that the generic ID allocator implementation in the Linux kernel did not properly check for null bitmap when releasing IDs. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-6915)  Robert Morris discovered that the CIFS network file system implementation in the Linux kernel did not properly validate certain server commands fields, leading to an out-of-bounds read vulnerability. An attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2024-0565)  Jann Horn discovered that the io_uring subsystem in the Linux kernel did not properly handle the release of certain buffer rings. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2024-0582)  It was discovered that the TIPC protocol implementation in the Linux kernel did not properly handle locking during tipc_crypto_key_revoke() operations. A local attacker could use this to cause a denial of service (kernel deadlock). (CVE-2024-0641)  Jann Horn discovered that the TLS subsystem in the Linux kernel did not properly handle spliced messages, leading to an out-of-bounds write vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2024-0646)  Update Instructions:  Run `sudo pro fix USN-6652-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-modules-iwlwifi-6.5.0-1015-azure - 6.5.0-1015.15 linux-cloud-tools-6.5.0-1015-azure - 6.5.0-1015.15 linux-modules-6.5.0-1015-azure - 6.5.0-1015.15 linux-azure-cloud-tools-6.5.0-1015 - 6.5.0-1015.15 linux-azure-headers-6.5.0-1015 - 6.5.0-1015.15 linux-modules-extra-6.5.0-1015-azure - 6.5.0-1015.15 linux-image-6.5.0-1015-azure-fde - 6.5.0-1015.15 linux-tools-6.5.0-1015-azure - 6.5.0-1015.15 linux-modules-ivsc-6.5.0-1015-azure - 6.5.0-1015.15 linux-headers-6.5.0-1015-azure - 6.5.0-1015.15 linux-image-unsigned-6.5.0-1015-azure - 6.5.0-1015.15 linux-buildinfo-6.5.0-1015-azure - 6.5.0-1015.15 linux-modules-ipu6-6.5.0-1015-azure - 6.5.0-1015.15 linux-azure-tools-6.5.0-1015 - 6.5.0-1015.15 linux-image-6.5.0-1015-azure - 6.5.0-1015.15 No subscription required  linux-image-azure-fde - 6.5.0.1015.17 linux-azure - 6.5.0.1015.17 linux-image-azure - 6.5.0.1015.17 linux-modules-ipu6-azure - 6.5.0.1015.17 linux-cloud-tools-azure - 6.5.0.1015.17 linux-tools-azure - 6.5.0.1015.17 linux-modules-iwlwifi-azure - 6.5.0.1015.17 linux-modules-ivsc-azure - 6.5.0.1015.17 linux-modules-extra-azure - 6.5.0.1015.17 linux-azure-fde - 6.5.0.1015.17 linux-headers-azure - 6.5.0.1015.17 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 23.10"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6652-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6652-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2024-02-23"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:665210000000",
						"comment": "Interim Release"
					}
				]
			}
		]
	}
}
