{
	"class": "patch",
	"id": "oval:com.ubuntu.mantic:def:64222000000",
	"version": "1",
	"metadata": {
		"title": "USN-6422-2 -- Ring vulnerabilities",
		"description": "It was discovered that Ring incorrectly handled certain inputs. If a user or an automated system were tricked into opening a specially crafted input file, a remote attacker could possibly use this issue to execute arbitrary code. (CVE-2021-37706)  It was discovered that Ring incorrectly handled certain inputs. If a user or an automated system were tricked into opening a specially crafted input file, a remote attacker could possibly use this issue to cause a denial of service. (CVE-2023-27585)   Original advisory details:     It was discovered that Ring incorrectly handled certain inputs. If a user or  an automated system were tricked into opening a specially crafted input file,  a remote attacker could possibly use this issue to execute arbitrary code.  (CVE-2021-37706)    It was discovered that Ring incorrectly handled certain inputs. If a user or  an automated system were tricked into opening a specially crafted input file,  a remote attacker could possibly use this issue to cause a denial of service.  This issue only affected Ubuntu 18.04 LTS and Ubuntu 20.04 LTS.   (CVE-2021-43299, CVE-2021-43300, CVE-2021-43301, CVE-2021-43302,   CVE-2021-43303, CVE-2021-43804, CVE-2021-43845, CVE-2022-21723,   CVE-2022-23537, CVE-2022-23547, CVE-2022-23608, CVE-2022-24754,  CVE-2022-24763, CVE-2022-24764, CVE-2022-24793, CVE-2022-31031,  CVE-2022-39244)    It was discovered that Ring incorrectly handled certain inputs. If a user or  an automated system were tricked into opening a specially crafted input file,  a remote attacker could possibly use this issue to cause a denial of service.  This issue only affected Ubuntu 20.04 LTS. (CVE-2022-21722)    It was discovered that Ring incorrectly handled certain inputs. If a user or  an automated system were tricked into opening a specially crafted input file,  a remote attacker could possibly use this issue to cause a denial of service.  (CVE-2023-27585)  Update Instructions:  Run `sudo pro fix USN-6422-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  jami-daemon - 20230206.0~ds2-1.3ubuntu0.1 jami - 20230206.0~ds2-1.3ubuntu0.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 23.10"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6422-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-6422-2"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2021-37706",
				"ref_url": "https://ubuntu.com/security/CVE-2021-37706"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2023-27585",
				"ref_url": "https://ubuntu.com/security/CVE-2023-27585"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "Medium",
			"issued": {
				"date": "2023-10-24"
			},
			"cve": [
				{
					"text": "CVE-2021-37706",
					"href": "https://ubuntu.com/security/CVE-2021-37706",
					"priority": "medium",
					"public": "20211222",
					"cvss_score": "9.8",
					"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "critical",
					"usns": "6422-1,6422-2"
				},
				{
					"text": "CVE-2023-27585",
					"href": "https://ubuntu.com/security/CVE-2023-27585",
					"priority": "medium",
					"public": "20230314",
					"cvss_score": "7.5",
					"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "high",
					"usns": "6422-1,6422-2"
				}
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:642220000000",
						"comment": "Interim Release"
					}
				]
			}
		]
	}
}
