{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2024453100000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-45310 on Ubuntu 22.04 LTS (jammy) - low",
		"description": "runc is a CLI tool for spawning and running containers according to the OCIspecification. runc 1.1.13 and earlier, as well as 1.2.0-rc2 and earlier,can be tricked into creating empty files or directories in arbitrarylocations in the host filesystem by sharing a volume between two containersand exploiting a race with `os.MkdirAll`. While this could be used tocreate empty files, existing files would not be truncated. An attacker musthave the ability to start containers using some kind of custom volumeconfiguration. Containers using user namespaces are still affected, but thescope of places an attacker can create inodes can be significantly reduced.Sufficiently strict LSM policies (SELinux/Apparmor) can also in principleblock this attack -- we suspect the industry standard SELinux policy mayrestrict this attack's scope but the exact scope of protection hasn't beenanalysed. This is exploitable using runc directly as well as through Dockerand Kubernetes. The issue is fixed in runc v1.1.14 and v1.2.0-rc3.Some workarounds are available. Using user namespaces restricts this attackfairly significantly such that the attacker can only create inodes indirectories that the remapped root user/group has write access to. Unlessthe root user is remapped to an actualuser on the host (such as with rootless containers that don't use`/etc/sub[ug]id`), this in practice means that an attacker would only beable to create inodes in world-writable directories. A strict enoughSELinux or AppArmor policy could in principle also restrict the scope if aspecific label is applied to the runc runtime, though neither the extent towhich the standard existing policies block this attack nor what exactpolicies are needed to sufficiently restrict this attack have beenthoroughly tested.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-45310",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-45310"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-09-03 19:15:00 UTC",
			"cve": {
				"text": "CVE-2024-45310",
				"href": "https://ubuntu.com/security/CVE-2024-45310",
				"public": "20240903"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2024453100000000",
						"comment": "runc-app package in jammy is affected and needs fixing."
					}
				]
			}
		]
	}
}
