{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2024478830000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-47883 on Ubuntu 22.04 LTS (jammy) - medium",
		"description": "The OpenRefine fork of the MIT Simile Butterfly server is a modular webapplication framework. The Butterfly framework uses the `java.net.URL`class to refer to (what are expected to be) local resource files, likeimages or templates. This works: \"opening a connection\" to these URLs opensthe local file. However, prior to version 1.2.6, if a `file:/` URL isdirectly given where a relative path (resource name) is expected, this isalso accepted in some code paths; the app then fetches the file, from aremote machine if indicated, and uses it as if it was a trusted part of theapp's codebase. This leads to multiple weaknesses and potential weaknesses.An attacker that has network access to the application could use it to gainaccess to files, either on the the server's filesystem (path traversal) orshared by nearby machines (server-side request forgery with e.g. SMB). Anattacker that can lead or redirect a user to a crafted URL belonging to theapp could cause arbitrary attacker-controlled JavaScript to be loaded inthe victim's browser (cross-site scripting). If an app is written in such away that an attacker can influence the resource name used for a template,that attacker could cause the app to fetch and execute anattacker-controlled template (remote code execution). Version 1.2.6contains a patch.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-47883",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-47883"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-10-24 21:15:00 UTC",
			"cve": {
				"text": "CVE-2024-47883",
				"href": "https://ubuntu.com/security/CVE-2024-47883",
				"public": "20241024",
				"cvss_score": "9.1",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2024478830000000",
						"comment": "openrefine-butterfly package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
