{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:34091000000",
	"version": "1",
	"metadata": {
		"title": "USN-3409-1 -- FontForge vulnerabilities",
		"description": "It was discovered that FontForge was vulnerable to a heap-based buffer over-read. A remote attacker could use a crafted file to DoS or execute arbitrary code. (CVE-2017-11568, CVE-2017-11569, CVE-2017-11572)  It was discovered that FontForge was vulnerable to a stack-based buffer overflow. A remote attacker could use a crafted file to DoS or execute arbitrary code. (CVE-2017-11571)  It was discovered that FontForge was vulnerable to a heap-based buffer overflow. A remote attacker could use a crafted file to DoS or execute arbitrary code. (CVE-2017-11574)  It was discovered that FontForge was vulnerable to a buffer over-read. A remote attacker could use a crafted file to DoS or execute arbitrary code. (CVE-2017-11575, CVE-2017-11577)  It was discovered that FontForge wasn't correctly checking the sign of a vector size. A remote attacker could use a crafted file to DoS. (CVE-2017-11576)  Update Instructions:  Run `sudo pro fix USN-3409-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  fontforge-common - 20120731.b-5ubuntu0.1 fontforge - 20120731.b-5ubuntu0.1 libfontforge-dev - 20120731.b-5ubuntu0.1 libfontforge1 - 20120731.b-5ubuntu0.1 fontforge-nox - 20120731.b-5ubuntu0.1 libgdraw4 - 20120731.b-5ubuntu0.1 python-fontforge - 20120731.b-5ubuntu0.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3409-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3409-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2017-09-04"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:340910000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
