{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:28551000000",
	"version": "1",
	"metadata": {
		"title": "USN-2855-1 -- Samba vulnerabilities",
		"description": "Thilo Uttendorfer discovered that the Samba LDAP server incorrectly handled certain packets. A remote attacker could use this issue to cause the LDAP server to stop responding, resulting in a denial of service. This issue only affected Ubuntu 14.04 LTS, Ubuntu 15.04 and Ubuntu 15.10. (CVE-2015-3223)  Jan Kasprzak discovered that Samba incorrectly handled certain symlinks. A remote attacker could use this issue to access files outside the exported share path. (CVE-2015-5252)  Stefan Metzmacher discovered that Samba did not enforce signing when creating encrypted connections. If a remote attacker were able to perform a machine-in-the-middle attack, this flaw could be exploited to view sensitive information. (CVE-2015-5296)  It was discovered that Samba incorrectly performed access control when using the VFS shadow_copy2 module. A remote attacker could use this issue to access snapshots, contrary to intended permissions. (CVE-2015-5299)  Douglas Bagnall discovered that Samba incorrectly handled certain string lengths. A remote attacker could use this issue to possibly access sensitive information. (CVE-2015-5330)  It was discovered that the Samba LDAP server incorrectly handled certain packets. A remote attacker could use this issue to cause the LDAP server to stop responding, resulting in a denial of service. This issue only affected Ubuntu 14.04 LTS, Ubuntu 15.04 and Ubuntu 15.10. (CVE-2015-7540)  Andrew Bartlett discovered that Samba incorrectly checked administrative privileges during creation of machine accounts. A remote attacker could possibly use this issue to bypass intended access restrictions in certain environments. This issue only affected Ubuntu 14.04 LTS, Ubuntu 15.04 and Ubuntu 15.10. (CVE-2015-8467)  Update Instructions:  Run `sudo pro fix USN-2855-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libnss-winbind - 2:4.1.6+dfsg-1ubuntu2.14.04.11 libpam-winbind - 2:4.1.6+dfsg-1ubuntu2.14.04.11 libwbclient0 - 2:4.1.6+dfsg-1ubuntu2.14.04.11 samba-common - 2:4.1.6+dfsg-1ubuntu2.14.04.11 samba-libs - 2:4.1.6+dfsg-1ubuntu2.14.04.11 libsmbsharemodes0 - 2:4.1.6+dfsg-1ubuntu2.14.04.11 samba-testsuite - 2:4.1.6+dfsg-1ubuntu2.14.04.11 samba - 2:4.1.6+dfsg-1ubuntu2.14.04.11 libsmbclient - 2:4.1.6+dfsg-1ubuntu2.14.04.11 samba-common-bin - 2:4.1.6+dfsg-1ubuntu2.14.04.11 libsmbsharemodes-dev - 2:4.1.6+dfsg-1ubuntu2.14.04.11 samba-vfs-modules - 2:4.1.6+dfsg-1ubuntu2.14.04.11 winbind - 2:4.1.6+dfsg-1ubuntu2.14.04.11 smbclient - 2:4.1.6+dfsg-1ubuntu2.14.04.11 python-samba - 2:4.1.6+dfsg-1ubuntu2.14.04.11 libwbclient-dev - 2:4.1.6+dfsg-1ubuntu2.14.04.11 samba-dsdb-modules - 2:4.1.6+dfsg-1ubuntu2.14.04.11 samba-dev - 2:4.1.6+dfsg-1ubuntu2.14.04.11 libsmbclient-dev - 2:4.1.6+dfsg-1ubuntu2.14.04.11 libparse-pidl-perl - 2:4.1.6+dfsg-1ubuntu2.14.04.11 registry-tools - 2:4.1.6+dfsg-1ubuntu2.14.04.11 samba-doc - 2:4.1.6+dfsg-1ubuntu2.14.04.11 libpam-smbpass - 2:4.1.6+dfsg-1ubuntu2.14.04.11 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2855-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2855-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-01-05"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:285510000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
