{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:28121000000",
	"version": "1",
	"metadata": {
		"title": "USN-2812-1 -- libxml2 vulnerabilities",
		"description": "Florian Weimer discovered that libxml2 incorrectly handled certain XML data. If a user or automated system were tricked into opening a specially crafted document, an attacker could possibly cause resource consumption, resulting in a denial of service. This issue only affected Ubuntu 12.04 LTS, Ubuntu 14.04 LTS and Ubuntu 15.04. (CVE-2015-1819)  Michal Zalewski discovered that libxml2 incorrectly handled certain XML data. If a user or automated system were tricked into opening a specially crafted document, an attacker could possibly cause libxml2 to crash, resulting in a denial of service. This issue only affected Ubuntu 12.04 LTS, Ubuntu 14.04 LTS and Ubuntu 15.04. (CVE-2015-7941)  Kostya Serebryany discovered that libxml2 incorrectly handled certain XML data. If a user or automated system were tricked into opening a specially crafted document, an attacker could possibly cause libxml2 to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2015-7942)  Gustavo Grieco discovered that libxml2 incorrectly handled certain XML data. If a user or automated system were tricked into opening a specially crafted document, an attacker could possibly cause libxml2 to crash, resulting in a denial of service. This issue only affected Ubuntu 14.04 LTS. (CVE-2015-8035)  Update Instructions:  Run `sudo pro fix USN-2812-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  python-libxml2 - 2.9.1+dfsg1-3ubuntu4.5 libxml2-utils - 2.9.1+dfsg1-3ubuntu4.5 libxml2 - 2.9.1+dfsg1-3ubuntu4.5 libxml2-udeb - 2.9.1+dfsg1-3ubuntu4.5 libxml2-doc - 2.9.1+dfsg1-3ubuntu4.5 libxml2-dev - 2.9.1+dfsg1-3ubuntu4.5 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2812-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2812-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2015-11-16"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:281210000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
