{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:26811000000",
	"version": "1",
	"metadata": {
		"title": "USN-2681-1 -- Linux kernel vulnerabilities",
		"description": "A flaw was discovered in the user space memory copying for the pipe iovecs in the Linux kernel. An unprivileged local user could exploit this flaw to cause a denial of service (system crash) or potentially escalate their privileges. (CVE-2015-1805)  A flaw was discovered in the kvm (kernel virtual machine) subsystem's kvm_apic_has_events function. A unprivileged local user could exploit this flaw to cause a denial of service (system crash). (CVE-2015-4692)  Daniel Borkmann reported a kernel crash in the Linux kernel's BPF filter JIT optimization. A local attacker could exploit this flaw to cause a denial of service (system crash). (CVE-2015-4700)  A flaw was discovered in how the Linux kernel handles invalid UDP checksums. A remote attacker could exploit this flaw to cause a denial of service using a flood of UDP packets with invalid checksums. (CVE-2015-5364)  A flaw was discovered in how the Linux kernel handles invalid UDP checksums. A remote attacker can cause a denial of service against applications that use epoll by injecting a single packet with an invalid checksum. (CVE-2015-5366)  A double free flaw was discovered in the Linux kernel's path lookup. A local user could cause a denial of service (Oops). (CVE-2015-5706)  Update Instructions:  Run `sudo pro fix USN-2681-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-3.13.0-58-powerpc64-smp - 3.13.0-58.97 linux-image-extra-3.13.0-58-generic - 3.13.0-58.97 linux-image-3.13.0-58-powerpc-e500 - 3.13.0-58.97 linux-image-3.13.0-58-generic - 3.13.0-58.97 linux-image-3.13.0-58-powerpc64-emb - 3.13.0-58.97 linux-image-3.13.0-58-powerpc-smp - 3.13.0-58.97 linux-image-3.13.0-58-generic-lpae - 3.13.0-58.97 linux-image-3.13.0-58-lowlatency - 3.13.0-58.97 linux-image-3.13.0-58-powerpc-e500mc - 3.13.0-58.97 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2681-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2681-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2015-07-23"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:268110000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
