{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:25631000000",
	"version": "1",
	"metadata": {
		"title": "USN-2563-1 -- Linux kernel vulnerabilities",
		"description": "Sun Baoliang discovered a use after free flaw in the Linux kernel's SCTP (Stream Control Transmission Protocol) subsystem during INIT collisions. A remote attacker could exploit this flaw to cause a denial of service (system crash) or potentially escalate their privileges on the system. (CVE-2015-1421)  Marcelo Leitner discovered a flaw in the Linux kernel's routing of packets to too many different dsts/too fast. A remote attacker on the same subnet can exploit this flaw to cause a denial of service (system crash). (CVE-2015-1465)  An integer overflow was discovered in the stack randomization feature of the Linux kernel on 64 bit platforms. A local attacker could exploit this flaw to bypass the Address Space Layout Randomization (ASLR) protection mechanism. (CVE-2015-1593)  An information leak was discovered in the Linux Kernel's handling of userspace configuration of the link layer control (LLC). A local user could exploit this flaw to read data from other sysctl settings. (CVE-2015-2041)  An information leak was discovered in how the Linux kernel handles setting the Reliable Datagram Sockets (RDS) settings. A local user could exploit this flaw to read data from other sysctl settings. (CVE-2015-2042)  Update Instructions:  Run `sudo pro fix USN-2563-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-3.13.0-49-powerpc-e500mc - 3.13.0-49.81 linux-image-3.13.0-49-powerpc-e500 - 3.13.0-49.81 linux-image-3.13.0-49-powerpc-smp - 3.13.0-49.81 linux-image-3.13.0-49-powerpc64-smp - 3.13.0-49.81 linux-image-extra-3.13.0-49-generic - 3.13.0-49.81 linux-image-3.13.0-49-powerpc64-emb - 3.13.0-49.81 linux-image-3.13.0-49-lowlatency - 3.13.0-49.81 linux-image-3.13.0-49-generic - 3.13.0-49.81 linux-image-3.13.0-49-generic-lpae - 3.13.0-49.81 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2563-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2563-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2015-04-08"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:256310000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
