{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:31832000000",
	"version": "1",
	"metadata": {
		"title": "USN-3183-2 -- GnuTLS vulnerability",
		"description": "USN-3183-1 fixed CVE-2016-8610 in GnuTLS in Ubuntu 16.04 LTS and Ubuntu 16.10. This update provides the corresponding update for Ubuntu 12.04 LTS and Ubuntu 14.04 LTS.  Original advisory details:   Stefan Buehler discovered that GnuTLS incorrectly verified the serial  length of OCSP responses. A remote attacker could possibly use this issue  to bypass certain certificate validation measures. This issue only applied  to Ubuntu 16.04 LTS. (CVE-2016-7444)    Shi Lei discovered that GnuTLS incorrectly handled certain warning alerts.  A remote attacker could possibly use this issue to cause GnuTLS to hang,  resulting in a denial of service. This issue has only been addressed in  Ubuntu 16.04 LTS and Ubuntu 16.10. (CVE-2016-8610)    It was discovered that GnuTLS incorrectly decoded X.509 certificates with a  Proxy Certificate Information extension. A remote attacker could use this  issue to cause GnuTLS to crash, resulting in a denial of service, or  possibly execute arbitrary code. This issue only affected Ubuntu 16.04 LTS  and Ubuntu 16.10. (CVE-2017-5334)    It was discovered that GnuTLS incorrectly handled certain OpenPGP  certificates. A remote attacker could possibly use this issue to cause  GnuTLS to crash, resulting in a denial of service, or possibly execute  arbitrary code. (CVE-2017-5335, CVE-2017-5336, CVE-2017-5337)  Update Instructions:  Run `sudo pro fix USN-3183-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  gnutls26-doc - 2.12.23-12ubuntu2.7 libgnutlsxx27 - 2.12.23-12ubuntu2.7 libgnutls26 - 2.12.23-12ubuntu2.7 libgnutls-dev - 2.12.23-12ubuntu2.7 libgnutls-openssl27 - 2.12.23-12ubuntu2.7 No subscription required  gnutls-bin - 3.0.11+really2.12.23-12ubuntu2.7 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3183-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-3183-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2017-03-20"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:318320000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:318320000010",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
