{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:27451000000",
	"version": "1",
	"metadata": {
		"title": "USN-2745-1 -- QEMU vulnerabilities",
		"description": "Lian Yihan discovered that QEMU incorrectly handled certain payload messages in the VNC display driver. A malicious guest could use this issue to cause the QEMU process to hang, resulting in a denial of service. This issue only affected Ubuntu 12.04 LTS and Ubuntu 14.04 LTS. (CVE-2015-5239)  Qinghao Tang discovered that QEMU incorrectly handled receiving certain packets in the NE2000 network driver. A malicious guest could use this issue to cause the QEMU process to hang, resulting in a denial of service. (CVE-2015-5278)  Qinghao Tang discovered that QEMU incorrectly handled receiving certain packets in the NE2000 network driver. A malicious guest could use this issue to cause a denial of service, or possibly execute arbitrary code on the host as the user running the QEMU process. In the default installation, when QEMU is used with libvirt, attackers would be isolated by the libvirt AppArmor profile. (CVE-2015-5279)  Qinghao Tang discovered that QEMU incorrectly handled transmit descriptor data when sending network packets. A malicious guest could use this issue to cause the QEMU process to hang, resulting in a denial of service. (CVE-2015-6815)  Qinghao Tang discovered that QEMU incorrectly handled ATAPI command permissions. A malicious guest could use this issue to cause the QEMU process to crash, resulting in a denial of service. (CVE-2015-6855)  Update Instructions:  Run `sudo pro fix USN-2745-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  qemu-system-common - 2.0.0+dfsg-2ubuntu1.19 qemu-user-static - 2.0.0+dfsg-2ubuntu1.19 qemu-system-misc - 2.0.0+dfsg-2ubuntu1.19 qemu - 2.0.0+dfsg-2ubuntu1.19 qemu-kvm - 2.0.0+dfsg-2ubuntu1.19 qemu-user - 2.0.0+dfsg-2ubuntu1.19 qemu-keymaps - 2.0.0+dfsg-2ubuntu1.19 qemu-guest-agent - 2.0.0+dfsg-2ubuntu1.19 qemu-system - 2.0.0+dfsg-2ubuntu1.19 qemu-utils - 2.0.0+dfsg-2ubuntu1.19 qemu-system-aarch64 - 2.0.0+dfsg-2ubuntu1.19 qemu-system-x86 - 2.0.0+dfsg-2ubuntu1.19 qemu-common - 2.0.0+dfsg-2ubuntu1.19 qemu-system-sparc - 2.0.0+dfsg-2ubuntu1.19 qemu-system-arm - 2.0.0+dfsg-2ubuntu1.19 qemu-system-ppc - 2.0.0+dfsg-2ubuntu1.19 qemu-system-mips - 2.0.0+dfsg-2ubuntu1.19 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2745-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2745-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2015-09-24"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:274510000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
