{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:41824000000",
	"version": "1",
	"metadata": {
		"title": "USN-4182-4 -- Intel Microcode regression",
		"description": "USN-4182-2 provided updated Intel Processor Microcode. A regression was discovered that caused some Skylake processors to hang after a warm reboot. This update reverts the microcode for that specific processor family.  We apologize for the inconvenience.  Original advisory details:   Stephan van Schaik, Alyssa Milburn, Sebastian Österlund, Pietro Frigo,  Kaveh Razavi, Herbert Bos, Cristiano Giuffrida, Giorgi Maisuradze, Moritz  Lipp, Michael Schwarz, Daniel Gruss, and Jo Van Bulck discovered that Intel  processors using Transactional Synchronization Extensions (TSX) could  expose memory contents previously stored in microarchitectural buffers to a  malicious process that is executing on the same CPU core. A local attacker  could use this to expose sensitive information. (CVE-2019-11135)   It was discovered that certain Intel Xeon processors did not properly  restrict access to a voltage modulation interface. A local privileged  attacker could use this to cause a denial of service (system crash).  (CVE-2019-11139)  Update Instructions:  Run `sudo pro fix USN-4182-4` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  intel-microcode - 3.20191115.1ubuntu0.14.04.2 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 ESM"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4182-4",
				"ref_url": "https://ubuntu.com/security/notices/USN-4182-4"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2019-12-04"
			},
			"bug": [
				"https://launchpad.net/bugs/1854764"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:418240000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
