{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:23101000000",
	"version": "1",
	"metadata": {
		"title": "USN-2310-1 -- Kerberos vulnerabilities",
		"description": "It was discovered that Kerberos incorrectly handled certain crafted Draft 9 requests. A remote attacker could use this issue to cause the daemon to crash, resulting in a denial of service. This issue only affected Ubuntu 12.04 LTS. (CVE-2012-1016)  It was discovered that Kerberos incorrectly handled certain malformed KRB5_PADATA_PK_AS_REQ AS-REQ requests. A remote attacker could use this issue to cause the daemon to crash, resulting in a denial of service. This issue only affected Ubuntu 10.04 LTS and Ubuntu 12.04 LTS. (CVE-2013-1415)  It was discovered that Kerberos incorrectly handled certain crafted TGS-REQ requests. A remote authenticated attacker could use this issue to cause the daemon to crash, resulting in a denial of service. This issue only affected Ubuntu 10.04 LTS and Ubuntu 12.04 LTS. (CVE-2013-1416)  It was discovered that Kerberos incorrectly handled certain crafted requests when multiple realms were configured. A remote attacker could use this issue to cause the daemon to crash, resulting in a denial of service. This issue only affected Ubuntu 10.04 LTS and Ubuntu 12.04 LTS. (CVE-2013-1418, CVE-2013-6800)  It was discovered that Kerberos incorrectly handled certain invalid tokens. If a remote attacker were able to perform a machine-in-the-middle attack, this flaw could be used to cause the daemon to crash, resulting in a denial of service. (CVE-2014-4341, CVE-2014-4342)  It was discovered that Kerberos incorrectly handled certain mechanisms when used with SPNEGO. If a remote attacker were able to perform a machine-in-the-middle attack, this flaw could be used to cause clients to crash, resulting in a denial of service. (CVE-2014-4343)  It was discovered that Kerberos incorrectly handled certain continuation tokens during SPNEGO negotiations. A remote attacker could use this issue to cause the daemon to crash, resulting in a denial of service. (CVE-2014-4344)  Tomas Kuthan and Greg Hudson discovered that the Kerberos kadmind daemon incorrectly handled buffers when used with the LDAP backend. A remote attacker could use this issue to cause the daemon to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2014-4345)  Update Instructions:  Run `sudo pro fix USN-2310-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libkadm5srv-mit9 - 1.12+dfsg-2ubuntu4.2 libkadm5srv-mit8 - 1.12+dfsg-2ubuntu4.2 libk5crypto3 - 1.12+dfsg-2ubuntu4.2 krb5-user - 1.12+dfsg-2ubuntu4.2 libgssrpc4 - 1.12+dfsg-2ubuntu4.2 libkrb5support0 - 1.12+dfsg-2ubuntu4.2 krb5-doc - 1.12+dfsg-2ubuntu4.2 libkrb5-dev - 1.12+dfsg-2ubuntu4.2 krb5-pkinit - 1.12+dfsg-2ubuntu4.2 libkrb5-3 - 1.12+dfsg-2ubuntu4.2 krb5-kdc-ldap - 1.12+dfsg-2ubuntu4.2 krb5-otp - 1.12+dfsg-2ubuntu4.2 libkadm5clnt-mit9 - 1.12+dfsg-2ubuntu4.2 krb5-gss-samples - 1.12+dfsg-2ubuntu4.2 krb5-multidev - 1.12+dfsg-2ubuntu4.2 krb5-locales - 1.12+dfsg-2ubuntu4.2 libgssapi-krb5-2 - 1.12+dfsg-2ubuntu4.2 krb5-kdc - 1.12+dfsg-2ubuntu4.2 libkrad-dev - 1.12+dfsg-2ubuntu4.2 libkrad0 - 1.12+dfsg-2ubuntu4.2 libkdb5-7 - 1.12+dfsg-2ubuntu4.2 krb5-admin-server - 1.12+dfsg-2ubuntu4.2 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2310-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2310-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2014-08-11"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:231010000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
