{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:25532000000",
	"version": "1",
	"metadata": {
		"title": "USN-2553-2 -- LibTIFF regression",
		"description": "USN-2553-1 fixed vulnerabilities in LibTIFF. One of the security fixes caused a regression when saving certain TIFF files with a Predictor tag. The problematic patch has been temporarily backed out until a more complete fix is available.  We apologize for the inconvenience.  Original advisory details:   William Robinet discovered that LibTIFF incorrectly handled certain  malformed images. If a user or automated system were tricked into opening a  specially crafted image, a remote attacker could crash the application,  leading to a denial of service, or possibly execute arbitrary code with  user privileges. (CVE-2014-8127, CVE-2014-8128, CVE-2014-8129,  CVE-2014-8130)    Paris Zoumpouloglou discovered that LibTIFF incorrectly handled certain  malformed BMP images. If a user or automated system were tricked into  opening a specially crafted BMP image, a remote attacker could crash the  application, leading to a denial of service. (CVE-2014-9330)    Michal Zalewski discovered that LibTIFF incorrectly handled certain  malformed images. If a user or automated system were tricked into opening a  specially crafted image, a remote attacker could crash the application,  leading to a denial of service, or possibly execute arbitrary code with  user privileges. (CVE-2014-9655)  Update Instructions:  Run `sudo pro fix USN-2553-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libtiff-opengl - 4.0.3-7ubuntu0.3 libtiff-tools - 4.0.3-7ubuntu0.3 libtiff5-dev - 4.0.3-7ubuntu0.3 libtiff4-dev - 4.0.3-7ubuntu0.3 libtiff5-alt-dev - 4.0.3-7ubuntu0.3 libtiff5 - 4.0.3-7ubuntu0.3 libtiffxx5 - 4.0.3-7ubuntu0.3 libtiff-doc - 4.0.3-7ubuntu0.3 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2553-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-2553-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2015-04-01"
			},
			"bug": [
				"https://launchpad.net/bugs/1439186"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:255320000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
