{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:43762000000",
	"version": "1",
	"metadata": {
		"title": "USN-4376-2 -- OpenSSL vulnerabilities",
		"description": "USN-4376-1 fixed several vulnerabilities in OpenSSL. This update provides the corresponding update for Ubuntu 12.04 ESM and Ubuntu 14.04 ESM.  Original advisory details:   Cesar Pereida García, Sohaib ul Hassan, Nicola Tuveri, Iaroslav Gridin,  Alejandro Cabrera Aldaya, and Billy Brumley discovered that OpenSSL  incorrectly handled ECDSA signatures. An attacker could possibly use this  issue to perform a timing side-channel attack and recover private ECDSA  keys. (CVE-2019-1547)   Juraj Somorovsky, Robert Merget, and Nimrod Aviram discovered that certain  applications incorrectly used OpenSSL and could be exposed to a padding  oracle attack. A remote attacker could possibly use this issue to decrypt  data. (CVE-2019-1559)   Bernd Edlinger discovered that OpenSSL incorrectly handled certain  decryption functions. In certain scenarios, a remote attacker could  possibly use this issue to perform a padding oracle attack and decrypt  traffic. (CVE-2019-1563)  Update Instructions:  Run `sudo pro fix USN-4376-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libssl1.0.0 - 1.0.1f-1ubuntu2.27+esm1 libssl-dev - 1.0.1f-1ubuntu2.27+esm1 openssl - 1.0.1f-1ubuntu2.27+esm1 libssl-doc - 1.0.1f-1ubuntu2.27+esm1 libcrypto1.0.0-udeb - 1.0.1f-1ubuntu2.27+esm1 libssl1.0.0-udeb - 1.0.1f-1ubuntu2.27+esm1 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4376-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-4376-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-07-09"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:437620000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
