{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:31301000000",
	"version": "1",
	"metadata": {
		"title": "USN-3130-1 -- OpenJDK 7 vulnerabilities",
		"description": "It was discovered that OpenJDK did not restrict the set of algorithms used for Jar integrity verification. An attacker could use this to modify without detection the content of a JAR file, affecting system integrity. (CVE-2016-5542)  It was discovered that the JMX component of OpenJDK did not sufficiently perform classloader consistency checks. An attacker could use this to bypass Java sandbox restrictions. (CVE-2016-5554)  It was discovered that the Hotspot component of OpenJDK did not properly check received Java Debug Wire Protocol (JDWP) packets. An attacker could use this to send debugging commands to a Java application with debugging enabled. (CVE-2016-5573)  It was discovered that the Hotspot component of OpenJDK did not properly check arguments of the System.arraycopy() function in certain cases. An attacker could use this to bypass Java sandbox restrictions. (CVE-2016-5582)  It was discovered that OpenJDK did not properly handle HTTP proxy authentication. An attacker could use this to expose HTTPS server authentication credentials. (CVE-2016-5597)  Update Instructions:  Run `sudo pro fix USN-3130-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  openjdk-7-jre-zero - 7u121-2.6.8-1ubuntu0.14.04.1 openjdk-7-source - 7u121-2.6.8-1ubuntu0.14.04.1 icedtea-7-jre-jamvm - 7u121-2.6.8-1ubuntu0.14.04.1 openjdk-7-jre-lib - 7u121-2.6.8-1ubuntu0.14.04.1 openjdk-7-jdk - 7u121-2.6.8-1ubuntu0.14.04.1 openjdk-7-jre-headless - 7u121-2.6.8-1ubuntu0.14.04.1 openjdk-7-jre - 7u121-2.6.8-1ubuntu0.14.04.1 openjdk-7-demo - 7u121-2.6.8-1ubuntu0.14.04.1 openjdk-7-doc - 7u121-2.6.8-1ubuntu0.14.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3130-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3130-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-11-17"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:313010000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
