{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:25891000000",
	"version": "1",
	"metadata": {
		"title": "USN-2589-1 -- Linux kernel (Utopic HWE) vulnerabilities",
		"description": "Jan Beulich discovered the Xen virtual machine subsystem of the Linux kernel did not properly restrict access to PCI command registers. A local guest user could exploit this flaw to cause a denial of service (host crash). (CVE-2015-2150)  A stack overflow was discovered in the the microcode loader for the intel x86 platform. A local attacker could exploit this flaw to cause a denial of service (kernel crash) or to potentially execute code with kernel privileges. (CVE-2015-2666)  A privilege escalation was discovered in the fork syscall via the int80 entry on 64 bit kernels with 32 bit emulation support. An unprivileged local attacker could exploit this flaw to increase their privileges on the system. (CVE-2015-2830)  It was discovered that the Linux kernel's IPv6 networking stack has a flaw that allows using route advertisement (RA) messages to set the 'hop_limit' to values that are too low. An unprivileged attacker on a local network could exploit this flaw to cause a denial of service (IPv6 messages dropped). (CVE-2015-2922)  Update Instructions:  Run `sudo pro fix USN-2589-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-extra-3.16.0-36-generic - 3.16.0-36.48~14.04.1 linux-image-3.16.0-36-generic-lpae - 3.16.0-36.48~14.04.1 linux-image-3.16.0-36-powerpc64-emb - 3.16.0-36.48~14.04.1 linux-image-3.16.0-36-powerpc64-smp - 3.16.0-36.48~14.04.1 linux-image-3.16.0-36-generic - 3.16.0-36.48~14.04.1 linux-image-3.16.0-36-lowlatency - 3.16.0-36.48~14.04.1 linux-image-3.16.0-36-powerpc-smp - 3.16.0-36.48~14.04.1 linux-image-3.16.0-36-powerpc-e500mc - 3.16.0-36.48~14.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2589-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2589-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2015-04-30"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:258910000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
