{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:36251000000",
	"version": "1",
	"metadata": {
		"title": "USN-3625-1 -- Perl vulnerabilities",
		"description": "It was discovered that Perl incorrectly handled certain regular expressions. An attacker could possibly use this issue to cause Perl to hang, resulting in a denial of service. This issue only affected Ubuntu 14.04 LTS. (CVE-2015-8853)  It was discovered that Perl incorrectly loaded libraries from the current working directory. A local attacker could possibly use this issue to execute arbitrary code. This issue only affected Ubuntu 14.04 LTS and Ubuntu 16.04 LTS. (CVE-2016-6185)  It was discovered that Perl incorrectly handled the rmtree and remove_tree functions. A local attacker could possibly use this issue to set the mode on arbitrary files. This issue only affected Ubuntu 14.04 LTS and Ubuntu 16.04 LTS. (CVE-2017-6512)  Brian Carpenter discovered that Perl incorrectly handled certain regular expressions. An attacker could use this issue to cause Perl to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue has only been addressed in Ubuntu 16.04 LTS and Ubuntu 17.10. (CVE-2018-6797)  Nguyen Duc Manh discovered that Perl incorrectly handled certain regular expressions. An attacker could use this issue to cause Perl to crash, resulting in a denial of service. This issue only affected Ubuntu 16.04 LTS and Ubuntu 17.10. (CVE-2018-6798)  GwanYeong Kim discovered that Perl incorrectly handled certain data when using the pack function. An attacker could use this issue to cause Perl to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2018-6913)  Update Instructions:  Run `sudo pro fix USN-3625-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libperl-dev - 5.18.2-2ubuntu1.4 perl-doc - 5.18.2-2ubuntu1.4 libperl5.18 - 5.18.2-2ubuntu1.4 perl-base - 5.18.2-2ubuntu1.4 perl-modules - 5.18.2-2ubuntu1.4 libcgi-fast-perl - 5.18.2-2ubuntu1.4 perl - 5.18.2-2ubuntu1.4 perl-debug - 5.18.2-2ubuntu1.4 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3625-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3625-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2018-04-16"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:362510000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
