{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:22051000000",
	"version": "1",
	"metadata": {
		"title": "USN-2205-1 -- LibTIFF vulnerabilities",
		"description": "Pedro Ribeiro discovered that LibTIFF incorrectly handled certain malformed images when using the gif2tiff tool. If a user or automated system were tricked into opening a specially crafted GIF image, a remote attacker could crash the application, leading to a denial of service, or possibly execute arbitrary code with user privileges. This issue only affected Ubuntu 10.04 LTS, Ubunu 12.04 LTS, Ubuntu 12.10 and Ubuntu 13.10. (CVE-2013-4231)  Pedro Ribeiro discovered that LibTIFF incorrectly handled certain malformed images when using the tiff2pdf tool. If a user or automated system were tricked into opening a specially crafted TIFF image, a remote attacker could crash the application, leading to a denial of service, or possibly execute arbitrary code with user privileges. This issue only affected Ubuntu 10.04 LTS, Ubunu 12.04 LTS, Ubuntu 12.10 and Ubuntu 13.10. (CVE-2013-4232)  Murray McAllister discovered that LibTIFF incorrectly handled certain malformed images when using the gif2tiff tool. If a user or automated system were tricked into opening a specially crafted GIF image, a remote attacker could crash the application, leading to a denial of service, or possibly execute arbitrary code with user privileges. (CVE-2013-4243)  Huzaifa Sidhpurwala discovered that LibTIFF incorrectly handled certain malformed images when using the gif2tiff tool. If a user or automated system were tricked into opening a specially crafted GIF image, a remote attacker could crash the application, leading to a denial of service, or possibly execute arbitrary code with user privileges. This issue only affected Ubuntu 10.04 LTS, Ubunu 12.04 LTS, Ubuntu 12.10 and Ubuntu 13.10. (CVE-2013-4244)  Update Instructions:  Run `sudo pro fix USN-2205-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libtiff-opengl - 4.0.3-7ubuntu0.1 libtiff-tools - 4.0.3-7ubuntu0.1 libtiff5-dev - 4.0.3-7ubuntu0.1 libtiff4-dev - 4.0.3-7ubuntu0.1 libtiff5-alt-dev - 4.0.3-7ubuntu0.1 libtiff5 - 4.0.3-7ubuntu0.1 libtiffxx5 - 4.0.3-7ubuntu0.1 libtiff-doc - 4.0.3-7ubuntu0.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2205-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2205-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2014-05-06"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:220510000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
