{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:37171000000",
	"version": "1",
	"metadata": {
		"title": "USN-3717-1 -- PolicyKit vulnerabilities",
		"description": "Tavis Ormandy discovered that PolicyKit incorrectly handled certain invalid object paths. A local attacker could possibly use this issue to cause PolicyKit to crash, resulting in a denial of service. This issue only affected Ubuntu 14.04 LTS. (CVE-2015-3218)  It was discovered that PolicyKit incorrectly handled certain duplicate action IDs. A local attacker could use this issue to cause PolicyKit to crash, resulting in a denial of service, or possibly escalate privileges. This issue only affected Ubuntu 14.04 LTS. (CVE-2015-3255)  Tavis Ormandy discovered that PolicyKit incorrectly handled duplicate cookie values. A local attacker could use this issue to cause PolicyKit to crash, resulting in a denial of service, or possibly escalate privileges. This issue only affected Ubuntu 14.04 LTS. (CVE-2015-4625)  Matthias Gerstner discovered that PolicyKit incorrectly checked users. A local attacker could possibly use this issue to cause authentication dialogs to show up for other users, leading to a denial of service or an information leak. (CVE-2018-1116)  Update Instructions:  Run `sudo pro fix USN-3717-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libpolkit-backend-1-0 - 0.105-4ubuntu3.14.04.2 policykit-1-doc - 0.105-4ubuntu3.14.04.2 libpolkit-gobject-1-dev - 0.105-4ubuntu3.14.04.2 libpolkit-agent-1-0 - 0.105-4ubuntu3.14.04.2 libpolkit-gobject-1-0 - 0.105-4ubuntu3.14.04.2 policykit-1 - 0.105-4ubuntu3.14.04.2 gir1.2-polkit-1.0 - 0.105-4ubuntu3.14.04.2 libpolkit-backend-1-dev - 0.105-4ubuntu3.14.04.2 libpolkit-agent-1-dev - 0.105-4ubuntu3.14.04.2 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3717-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3717-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2018-07-16"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:371710000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
