{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:30472000000",
	"version": "1",
	"metadata": {
		"title": "USN-3047-2 -- QEMU regression",
		"description": "USN-3047-1 fixed vulnerabilities in QEMU. The patch to fix CVE-2016-5403 caused a regression which resulted in save/restore failures when virtio memory balloon statistics are enabled. This update temporarily reverts the security fix for CVE-2016-5403 pending further investigation. We apologize for the inconvenience.  Original advisory details:   Li Qiang discovered that QEMU incorrectly handled 53C9X Fast SCSI  controller emulation. A privileged attacker inside the guest could use this  issue to cause QEMU to crash, resulting in a denial of service, or possibly  execute arbitrary code on the host. In the default installation, when QEMU  is used with libvirt, attackers would be isolated by the libvirt AppArmor  profile. This issue only applied to Ubuntu 14.04 LTS and Ubuntu 16.04 LTS.  (CVE-2016-4439, CVE-2016-4441, CVE-2016-5238, CVE-2016-5338, CVE-2016-6351)    Li Qiang and Qinghao Tang discovered that QEMU incorrectly handled the  VMWare VGA module. A privileged attacker inside the guest could use this  issue to cause QEMU to crash, resulting in a denial of service, or possibly  to obtain sensitive host memory. (CVE-2016-4453, CVE-2016-4454)    Li Qiang discovered that QEMU incorrectly handled VMWARE PVSCSI paravirtual  SCSI bus emulation support. A privileged attacker inside the guest could  use this issue to cause QEMU to crash, resulting in a denial of service.  This issue only applied to Ubuntu 14.04 LTS and Ubuntu 16.04 LTS.  (CVE-2016-4952)    Li Qiang discovered that QEMU incorrectly handled MegaRAID SAS 8708EM2 Host  Bus Adapter emulation support. A privileged attacker inside the guest could  use this issue to cause QEMU to crash, resulting in a denial of service, or  possibly to obtain sensitive host memory. This issue only applied to Ubuntu  14.04 LTS and Ubuntu 16.04 LTS. (CVE-2016-5105, CVE-2016-5106,  CVE-2016-5107, CVE-2016-5337)    It was discovered that QEMU incorrectly handled certain iSCSI asynchronous  I/O ioctl calls. An attacker inside the guest could use this issue to cause  QEMU to crash, resulting in a denial of service, or possibly execute  arbitrary code on the host. In the default installation, when QEMU is used  with libvirt, attackers would be isolated by the libvirt AppArmor profile.  This issue only applied to Ubuntu 14.04 LTS and Ubuntu 16.04 LTS.  (CVE-2016-5126)    Zhenhao Hong discovered that QEMU incorrectly handled the Virtio module. A  privileged attacker inside the guest could use this issue to cause QEMU to  crash, resulting in a denial of service. (CVE-2016-5403)  Update Instructions:  Run `sudo pro fix USN-3047-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  qemu-system-common - 2.0.0+dfsg-2ubuntu1.27 qemu-user-static - 2.0.0+dfsg-2ubuntu1.27 qemu-system-misc - 2.0.0+dfsg-2ubuntu1.27 qemu - 2.0.0+dfsg-2ubuntu1.27 qemu-kvm - 2.0.0+dfsg-2ubuntu1.27 qemu-user - 2.0.0+dfsg-2ubuntu1.27 qemu-keymaps - 2.0.0+dfsg-2ubuntu1.27 qemu-guest-agent - 2.0.0+dfsg-2ubuntu1.27 qemu-system - 2.0.0+dfsg-2ubuntu1.27 qemu-utils - 2.0.0+dfsg-2ubuntu1.27 qemu-system-aarch64 - 2.0.0+dfsg-2ubuntu1.27 qemu-system-x86 - 2.0.0+dfsg-2ubuntu1.27 qemu-common - 2.0.0+dfsg-2ubuntu1.27 qemu-system-sparc - 2.0.0+dfsg-2ubuntu1.27 qemu-system-arm - 2.0.0+dfsg-2ubuntu1.27 qemu-system-ppc - 2.0.0+dfsg-2ubuntu1.27 qemu-system-mips - 2.0.0+dfsg-2ubuntu1.27 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3047-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-3047-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-08-12"
			},
			"bug": [
				"https://launchpad.net/bugs/1612089"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:304720000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
