{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:37541000000",
	"version": "1",
	"metadata": {
		"title": "USN-3754-1 -- Linux kernel vulnerabilities",
		"description": "Ralf Spenneberg discovered that the ext4 implementation in the Linux kernel did not properly validate meta block groups. An attacker with physical access could use this to specially craft an ext4 image that causes a denial of service (system crash). (CVE-2016-10208)  It was discovered that an information disclosure vulnerability existed in the ACPI implementation of the Linux kernel. A local attacker could use this to expose sensitive information (kernel memory addresses). (CVE-2017-11472)  It was discovered that a buffer overflow existed in the ACPI table parsing implementation in the Linux kernel. A local attacker could use this to construct a malicious ACPI table that, when loaded, caused a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-11473)  It was discovered that the generic SCSI driver in the Linux kernel did not properly initialize data returned to user space in some situations. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2017-14991)  It was discovered that a race condition existed in the packet fanout implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-15649)  Andrey Konovalov discovered that the Ultra Wide Band driver in the Linux kernel did not properly check for an error condition. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-16526)  Andrey Konovalov discovered that the ALSA subsystem in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-16527)  Andrey Konovalov discovered that the ALSA subsystem in the Linux kernel did not properly validate USB audio buffer descriptors. A physically proximate attacker could use this cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-16529)  Andrey Konovalov discovered that the USB subsystem in the Linux kernel did not properly validate USB interface association descriptors. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2017-16531)  Andrey Konovalov discovered that the usbtest device driver in the Linux kernel did not properly validate endpoint metadata. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2017-16532)  Andrey Konovalov discovered that the USB subsystem in the Linux kernel did not properly validate USB HID descriptors. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2017-16533)  Andrey Konovalov discovered that the USB subsystem in the Linux kernel did not properly validate USB BOS metadata. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2017-16535)  Andrey Konovalov discovered that the Conexant cx231xx USB video capture driver in the Linux kernel did not properly validate interface descriptors. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2017-16536)  Andrey Konovalov discovered that the SoundGraph iMON USB driver in the Linux kernel did not properly validate device metadata. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2017-16537)  It was discovered that the DM04/QQBOX USB driver in the Linux kernel did not properly handle device attachment and warm-start. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-16538)  Andrey Konovalov discovered an out-of-bounds read in the GTCO digitizer USB driver for the Linux kernel. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-16643)  Andrey Konovalov discovered that the video4linux driver for Hauppauge HD PVR USB devices in the Linux kernel did not properly handle some error conditions. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-16644)  Andrey Konovalov discovered that the IMS Passenger Control Unit USB driver in the Linux kernel did not properly validate device descriptors. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2017-16645)  Andrey Konovalov discovered that the QMI WWAN USB driver did not properly validate device descriptors. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2017-16650)  It was discovered that the USB Virtual Host Controller Interface (VHCI) driver in the Linux kernel contained an information disclosure vulnerability. A physically proximate attacker could use this to expose sensitive information (kernel memory). (CVE-2017-16911)  It was discovered that the USB over IP implementation in the Linux kernel did not validate endpoint numbers. A remote attacker could use this to cause a denial of service (system crash). (CVE-2017-16912)  It was discovered that the USB over IP implementation in the Linux kernel did not properly validate CMD_SUBMIT packets. A remote attacker could use this to cause a denial of service (excessive memory consumption). (CVE-2017-16913)  It was discovered that the USB over IP implementation in the Linux kernel contained a NULL pointer dereference error. A remote attacker could use this to cause a denial of service (system crash). (CVE-2017-16914)  It was discovered that the core USB subsystem in the Linux kernel did not validate the number of configurations and interfaces in a device. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2017-17558)  It was discovered that an integer overflow existed in the perf subsystem of the Linux kernel. A local attacker could use this to cause a denial of service (system crash). (CVE-2017-18255)  It was discovered that the keyring subsystem in the Linux kernel did not properly prevent a user from creating keyrings for other users. A local attacker could use this cause a denial of service or expose sensitive information. (CVE-2017-18270)  Andy Lutomirski and Willy Tarreau discovered that the KVM implementation in the Linux kernel did not properly emulate instructions on the SS segment register. A local attacker in a guest virtual machine could use this to cause a denial of service (guest OS crash) or possibly gain administrative privileges in the guest OS. (CVE-2017-2583)  Dmitry Vyukov discovered that the KVM implementation in the Linux kernel improperly emulated certain instructions. A local attacker could use this to obtain sensitive information (kernel memory). (CVE-2017-2584)  It was discovered that the KLSI KL5KUSB105 serial-to-USB device driver in the Linux kernel did not properly initialize memory related to logging. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2017-5549)  Andrey Konovalov discovered an out-of-bounds access in the IPv6 Generic Routing Encapsulation (GRE) tunneling implementation in the Linux kernel. An attacker could use this to possibly expose sensitive information. (CVE-2017-5897)  Andrey Konovalov discovered that the LLC subsytem in the Linux kernel did not properly set up a destructor in certain situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2017-6345)  Dmitry Vyukov discovered race conditions in the Infrared (IrDA) subsystem in the Linux kernel. A local attacker could use this to cause a denial of service (deadlock). (CVE-2017-6348)  Andy Lutomirski discovered that the KVM implementation in the Linux kernel was vulnerable to a debug exception error when single-stepping through a syscall. A local attacker in a non-Linux guest vm could possibly use this to gain administrative privileges in the guest vm. (CVE-2017-7518)  Tuomas Haanpää and Ari Kauppi discovered that the NFSv2 and NFSv3 server implementations in the Linux kernel did not properly handle certain long RPC replies. A remote attacker could use this to cause a denial of service (system crash). (CVE-2017-7645)  Pengfei Wang discovered that a race condition existed in the NXP SAA7164 TV Decoder driver for the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-8831)  Pengfei Wang discovered that the Turtle Beach MultiSound audio device driver in the Linux kernel contained race conditions when fetching from the ring-buffer. A local attacker could use this to cause a denial of service (infinite loop). (CVE-2017-9984, CVE-2017-9985)  It was discovered that the wait4() system call in the Linux kernel did not properly validate its arguments in some situations. A local attacker could possibly use this to cause a denial of service. (CVE-2018-10087)  It was discovered that the kill() system call implementation in the Linux kernel did not properly validate its arguments in some situations. A local attacker could possibly use this to cause a denial of service. (CVE-2018-10124)  Wen Xu discovered that the XFS filesystem implementation in the Linux kernel did not properly validate meta-data information. An attacker could use this to construct a malicious xfs image that, when mounted, could cause a denial of service (system crash). (CVE-2018-10323)  Zhong Jiang discovered that a use-after-free vulnerability existed in the NUMA memory policy implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-10675)  Wen Xu discovered that a buffer overflow existed in the ext4 filesystem implementation in the Linux kernel. An attacker could use this to construct a malicious ext4 image that, when mounted, could cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-10877)  Wen Xu discovered that the ext4 filesystem implementation in the Linux kernel did not properly keep meta-data information consistent in some situations. An attacker could use this to construct a malicious ext4 image that, when mounted, could cause a denial of service (system crash). (CVE-2018-10881)  Wen Xu discovered that the ext4 filesystem implementation in the Linux kernel did not properly handle corrupted meta data in some situations. An attacker could use this to specially craft an ext4 filesystem that caused a denial of service (system crash) when mounted. (CVE-2018-1092)  Wen Xu discovered that the ext4 filesystem implementation in the Linux kernel did not properly handle corrupted meta data in some situations. An attacker could use this to specially craft an ext4 filesystem that caused a denial of service (system crash) when mounted. (CVE-2018-1093)  It was discovered that the cdrom driver in the Linux kernel contained an incorrect bounds check. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2018-10940)  Shankara Pailoor discovered that the JFS filesystem implementation in the Linux kernel contained a buffer overflow when handling extended attributes. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-12233)  Wen Xu discovered that the XFS filesystem implementation in the Linux kernel did not properly handle an error condition with a corrupted xfs image. An attacker could use this to construct a malicious xfs image that, when mounted, could cause a denial of service (system crash). (CVE-2018-13094)  It was discovered that the Linux kernel did not properly handle setgid file creation when performed by a non-member of the group. A local attacker could use this to gain elevated privileges. (CVE-2018-13405)  Silvio Cesare discovered that the generic VESA frame buffer driver in the Linux kernel contained an integer overflow. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-13406)  Daniel Jiang discovered that a race condition existed in the ipv4 ping socket implementation in the Linux kernel. A local privileged attacker could use this to cause a denial of service (system crash). (CVE-2017-2671)  It was discovered that an information leak existed in the generic SCSI driver in the Linux kernel. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2018-1000204)  It was discovered that a memory leak existed in the Serial Attached SCSI (SAS) implementation in the Linux kernel. A physically proximate attacker could use this to cause a denial of service (memory exhaustion). (CVE-2018-10021)  Update Instructions:  Run `sudo pro fix USN-3754-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-3.13.0-157-powerpc-e500 - 3.13.0-157.207 linux-image-3.13.0-157-generic - 3.13.0-157.207 linux-image-3.13.0-157-generic-lpae - 3.13.0-157.207 linux-image-3.13.0-157-powerpc-smp - 3.13.0-157.207 linux-image-3.13.0-157-powerpc-e500mc - 3.13.0-157.207 linux-image-3.13.0-157-lowlatency - 3.13.0-157.207 linux-image-3.13.0-157-powerpc64-smp - 3.13.0-157.207 linux-image-3.13.0-157-powerpc64-emb - 3.13.0-157.207 linux-image-extra-3.13.0-157-generic - 3.13.0-157.207 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3754-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3754-1"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2016-10208",
				"ref_url": "https://ubuntu.com/security/CVE-2016-10208"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-11472",
				"ref_url": "https://ubuntu.com/security/CVE-2017-11472"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-11473",
				"ref_url": "https://ubuntu.com/security/CVE-2017-11473"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-14991",
				"ref_url": "https://ubuntu.com/security/CVE-2017-14991"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-15649",
				"ref_url": "https://ubuntu.com/security/CVE-2017-15649"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16526",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16526"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16527",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16527"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16529",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16529"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16531",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16531"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16532",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16532"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16533",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16533"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16535",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16535"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16536",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16536"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16537",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16537"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16538",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16538"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16643",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16643"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16644",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16644"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16645",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16645"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16650",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16650"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16911",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16911"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16912",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16912"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16913",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16913"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-16914",
				"ref_url": "https://ubuntu.com/security/CVE-2017-16914"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-17558",
				"ref_url": "https://ubuntu.com/security/CVE-2017-17558"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-18255",
				"ref_url": "https://ubuntu.com/security/CVE-2017-18255"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-18270",
				"ref_url": "https://ubuntu.com/security/CVE-2017-18270"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-2583",
				"ref_url": "https://ubuntu.com/security/CVE-2017-2583"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-2584",
				"ref_url": "https://ubuntu.com/security/CVE-2017-2584"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-2671",
				"ref_url": "https://ubuntu.com/security/CVE-2017-2671"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-5549",
				"ref_url": "https://ubuntu.com/security/CVE-2017-5549"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-5897",
				"ref_url": "https://ubuntu.com/security/CVE-2017-5897"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-6345",
				"ref_url": "https://ubuntu.com/security/CVE-2017-6345"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-6348",
				"ref_url": "https://ubuntu.com/security/CVE-2017-6348"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-7518",
				"ref_url": "https://ubuntu.com/security/CVE-2017-7518"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-7645",
				"ref_url": "https://ubuntu.com/security/CVE-2017-7645"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-8831",
				"ref_url": "https://ubuntu.com/security/CVE-2017-8831"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-9984",
				"ref_url": "https://ubuntu.com/security/CVE-2017-9984"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2017-9985",
				"ref_url": "https://ubuntu.com/security/CVE-2017-9985"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2018-1000204",
				"ref_url": "https://ubuntu.com/security/CVE-2018-1000204"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2018-10021",
				"ref_url": "https://ubuntu.com/security/CVE-2018-10021"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2018-10087",
				"ref_url": "https://ubuntu.com/security/CVE-2018-10087"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2018-10124",
				"ref_url": "https://ubuntu.com/security/CVE-2018-10124"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2018-10323",
				"ref_url": "https://ubuntu.com/security/CVE-2018-10323"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2018-10675",
				"ref_url": "https://ubuntu.com/security/CVE-2018-10675"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2018-10877",
				"ref_url": "https://ubuntu.com/security/CVE-2018-10877"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2018-10881",
				"ref_url": "https://ubuntu.com/security/CVE-2018-10881"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2018-1092",
				"ref_url": "https://ubuntu.com/security/CVE-2018-1092"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2018-1093",
				"ref_url": "https://ubuntu.com/security/CVE-2018-1093"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2018-10940",
				"ref_url": "https://ubuntu.com/security/CVE-2018-10940"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2018-12233",
				"ref_url": "https://ubuntu.com/security/CVE-2018-12233"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2018-13094",
				"ref_url": "https://ubuntu.com/security/CVE-2018-13094"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2018-13405",
				"ref_url": "https://ubuntu.com/security/CVE-2018-13405"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2018-13406",
				"ref_url": "https://ubuntu.com/security/CVE-2018-13406"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "Medium",
			"issued": {
				"date": "2018-08-24"
			},
			"cve": [
				{
					"text": "CVE-2016-10208",
					"href": "https://ubuntu.com/security/CVE-2016-10208",
					"priority": "low",
					"public": "20170206",
					"cvss_score": "4.3",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3234-2,3234-1,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-11472",
					"href": "https://ubuntu.com/security/CVE-2017-11472",
					"priority": "low",
					"public": "20170720",
					"cvss_score": "7.1",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:N",
					"cvss_severity": "high",
					"usns": "3619-1,3619-2,3754-1"
				},
				{
					"text": "CVE-2017-11473",
					"href": "https://ubuntu.com/security/CVE-2017-11473",
					"priority": "low",
					"public": "20170720",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3754-1"
				},
				{
					"text": "CVE-2017-14991",
					"href": "https://ubuntu.com/security/CVE-2017-14991",
					"priority": "low",
					"public": "20171003",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "3469-1,3469-2,3754-1"
				},
				{
					"text": "CVE-2017-15649",
					"href": "https://ubuntu.com/security/CVE-2017-15649",
					"priority": "medium",
					"public": "20171019",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3485-1,3485-2,3487-1,3485-3,3754-1"
				},
				{
					"text": "CVE-2017-16526",
					"href": "https://ubuntu.com/security/CVE-2017-16526",
					"priority": "low",
					"public": "20171103",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3485-1,3485-2,3487-1,3485-3,3754-1"
				},
				{
					"text": "CVE-2017-16527",
					"href": "https://ubuntu.com/security/CVE-2017-16527",
					"priority": "medium",
					"public": "20171103",
					"cvss_score": "6.6",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3485-1,3485-2,3487-1,3485-3,3754-1"
				},
				{
					"text": "CVE-2017-16529",
					"href": "https://ubuntu.com/security/CVE-2017-16529",
					"priority": "low",
					"public": "20171103",
					"cvss_score": "6.6",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3485-1,3485-2,3487-1,3485-3,3754-1"
				},
				{
					"text": "CVE-2017-16531",
					"href": "https://ubuntu.com/security/CVE-2017-16531",
					"priority": "low",
					"public": "20171103",
					"cvss_score": "6.6",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3485-1,3485-2,3487-1,3485-3,3754-1"
				},
				{
					"text": "CVE-2017-16532",
					"href": "https://ubuntu.com/security/CVE-2017-16532",
					"priority": "low",
					"public": "20171103",
					"cvss_score": "6.6",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3617-1,3617-2,3617-3,3619-1,3619-2,3754-1"
				},
				{
					"text": "CVE-2017-16533",
					"href": "https://ubuntu.com/security/CVE-2017-16533",
					"priority": "low",
					"public": "20171103",
					"cvss_score": "6.6",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3485-1,3485-2,3487-1,3485-3,3754-1"
				},
				{
					"text": "CVE-2017-16535",
					"href": "https://ubuntu.com/security/CVE-2017-16535",
					"priority": "low",
					"public": "20171103",
					"cvss_score": "6.6",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3485-1,3485-2,3485-3,3507-1,3754-1"
				},
				{
					"text": "CVE-2017-16536",
					"href": "https://ubuntu.com/security/CVE-2017-16536",
					"priority": "low",
					"public": "20171103",
					"cvss_score": "6.6",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3619-1,3619-2,3754-1"
				},
				{
					"text": "CVE-2017-16537",
					"href": "https://ubuntu.com/security/CVE-2017-16537",
					"priority": "low",
					"public": "20171103",
					"cvss_score": "6.6",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3617-1,3617-2,3617-3,3619-1,3619-2,3754-1"
				},
				{
					"text": "CVE-2017-16538",
					"href": "https://ubuntu.com/security/CVE-2017-16538",
					"priority": "low",
					"public": "20171103",
					"cvss_score": "6.6",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3631-1,3631-2,3754-1"
				},
				{
					"text": "CVE-2017-16643",
					"href": "https://ubuntu.com/security/CVE-2017-16643",
					"priority": "low",
					"public": "20171107",
					"cvss_score": "6.6",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3509-1,3509-2,3507-1,3754-1"
				},
				{
					"text": "CVE-2017-16644",
					"href": "https://ubuntu.com/security/CVE-2017-16644",
					"priority": "low",
					"public": "20171107",
					"cvss_score": "6.6",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3754-1,4904-1"
				},
				{
					"text": "CVE-2017-16645",
					"href": "https://ubuntu.com/security/CVE-2017-16645",
					"priority": "low",
					"public": "20171107",
					"cvss_score": "6.6",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3617-1,3617-2,3617-3,3619-1,3619-2,3754-1"
				},
				{
					"text": "CVE-2017-16650",
					"href": "https://ubuntu.com/security/CVE-2017-16650",
					"priority": "low",
					"public": "20171107",
					"cvss_score": "6.6",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3617-1,3617-2,3617-3,3619-1,3619-2,3754-1"
				},
				{
					"text": "CVE-2017-16911",
					"href": "https://ubuntu.com/security/CVE-2017-16911",
					"priority": "medium",
					"public": "20180131",
					"cvss_score": "4.7",
					"cvss_vector": "CVSS:3.0/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "3619-1,3619-2,3754-1"
				},
				{
					"text": "CVE-2017-16912",
					"href": "https://ubuntu.com/security/CVE-2017-16912",
					"priority": "medium",
					"public": "20180131",
					"cvss_score": "5.9",
					"cvss_vector": "CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3619-1,3619-2,3754-1"
				},
				{
					"text": "CVE-2017-16913",
					"href": "https://ubuntu.com/security/CVE-2017-16913",
					"priority": "medium",
					"public": "20180131",
					"cvss_score": "5.9",
					"cvss_vector": "CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3619-1,3619-2,3754-1"
				},
				{
					"text": "CVE-2017-16914",
					"href": "https://ubuntu.com/security/CVE-2017-16914",
					"priority": "medium",
					"public": "20180131",
					"cvss_score": "5.9",
					"cvss_vector": "CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3619-1,3619-2,3754-1"
				},
				{
					"text": "CVE-2017-17558",
					"href": "https://ubuntu.com/security/CVE-2017-17558",
					"priority": "low",
					"public": "20171212",
					"cvss_score": "6.6",
					"cvss_vector": "CVSS:3.0/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3619-1,3619-2,3754-1"
				},
				{
					"text": "CVE-2017-18255",
					"href": "https://ubuntu.com/security/CVE-2017-18255",
					"priority": "low",
					"public": "20180331",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3696-1,3696-2,3754-1"
				},
				{
					"text": "CVE-2017-18270",
					"href": "https://ubuntu.com/security/CVE-2017-18270",
					"priority": "medium",
					"public": "20180518",
					"cvss_score": "7.1",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3754-1"
				},
				{
					"text": "CVE-2017-2583",
					"href": "https://ubuntu.com/security/CVE-2017-2583",
					"priority": "medium",
					"public": "20170206",
					"cvss_score": "8.4",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3208-1,3208-2,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-2584",
					"href": "https://ubuntu.com/security/CVE-2017-2584",
					"priority": "medium",
					"public": "20170114",
					"cvss_score": "7.1",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:H",
					"cvss_severity": "high",
					"usns": "3208-1,3208-2,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-2671",
					"href": "https://ubuntu.com/security/CVE-2017-2671",
					"priority": "negligible",
					"public": "20170405",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3314-1,3312-1,3312-2,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-5549",
					"href": "https://ubuntu.com/security/CVE-2017-5549",
					"priority": "low",
					"public": "20170206",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "3208-1,3208-2,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-5897",
					"href": "https://ubuntu.com/security/CVE-2017-5897",
					"priority": "low",
					"public": "20170323",
					"cvss_score": "9.8",
					"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "critical",
					"usns": "3265-1,3265-2,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-6345",
					"href": "https://ubuntu.com/security/CVE-2017-6345",
					"priority": "low",
					"public": "20170301",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3265-1,3265-2,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-6348",
					"href": "https://ubuntu.com/security/CVE-2017-6348",
					"priority": "low",
					"public": "20170301",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3265-1,3265-2,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-7518",
					"href": "https://ubuntu.com/security/CVE-2017-7518",
					"priority": "medium",
					"public": "20170623",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3619-1,3619-2,3754-1"
				},
				{
					"text": "CVE-2017-7645",
					"href": "https://ubuntu.com/security/CVE-2017-7645",
					"priority": "medium",
					"public": "20170418",
					"cvss_score": "7.5",
					"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "high",
					"usns": "3314-1,3312-1,3312-2,3361-1,3754-1"
				},
				{
					"text": "CVE-2017-8831",
					"href": "https://ubuntu.com/security/CVE-2017-8831",
					"priority": "low",
					"public": "20170508",
					"cvss_score": "6.4",
					"cvss_vector": "CVSS:3.1/AV:P/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3420-1,3420-2,3754-1"
				},
				{
					"text": "CVE-2017-9984",
					"href": "https://ubuntu.com/security/CVE-2017-9984",
					"priority": "low",
					"public": "20170628",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3469-1,3469-2,3754-1"
				},
				{
					"text": "CVE-2017-9985",
					"href": "https://ubuntu.com/security/CVE-2017-9985",
					"priority": "low",
					"public": "20170628",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3469-1,3469-2,3754-1"
				},
				{
					"text": "CVE-2018-1000204",
					"href": "https://ubuntu.com/security/CVE-2018-1000204",
					"priority": "negligible",
					"public": "20180626",
					"cvss_score": "5.3",
					"cvss_vector": "CVSS:3.0/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "3696-1,3696-2,3752-1,3752-2,3754-1,3752-3"
				},
				{
					"text": "CVE-2018-10021",
					"href": "https://ubuntu.com/security/CVE-2018-10021",
					"priority": "negligible",
					"public": "20180411",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3678-1,3678-2,3678-3,3678-4,3696-1,3696-2,3754-1"
				},
				{
					"text": "CVE-2018-10087",
					"href": "https://ubuntu.com/security/CVE-2018-10087",
					"priority": "medium",
					"public": "20180413",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3696-1,3696-2,3754-1"
				},
				{
					"text": "CVE-2018-10124",
					"href": "https://ubuntu.com/security/CVE-2018-10124",
					"priority": "low",
					"public": "20180416",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3696-1,3696-2,3754-1"
				},
				{
					"text": "CVE-2018-10323",
					"href": "https://ubuntu.com/security/CVE-2018-10323",
					"priority": "low",
					"public": "20180424",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3752-1,3752-2,3754-1,3752-3,4486-1"
				},
				{
					"text": "CVE-2018-10675",
					"href": "https://ubuntu.com/security/CVE-2018-10675",
					"priority": "medium",
					"public": "20180502",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3754-1"
				},
				{
					"text": "CVE-2018-10877",
					"href": "https://ubuntu.com/security/CVE-2018-10877",
					"priority": "low",
					"public": "20180718",
					"cvss_score": "6.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:H/UI:R/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "3753-1,3753-2,3754-1,3871-1,3871-3,3871-4,3871-5"
				},
				{
					"text": "CVE-2018-10881",
					"href": "https://ubuntu.com/security/CVE-2018-10881",
					"priority": "low",
					"public": "20180726",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3752-1,3752-2,3753-1,3753-2,3754-1,3752-3"
				},
				{
					"text": "CVE-2018-1092",
					"href": "https://ubuntu.com/security/CVE-2018-1092",
					"priority": "medium",
					"public": "20180401",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3676-1,3676-2,3677-1,3677-2,3678-1,3678-2,3678-3,3678-4,3754-1"
				},
				{
					"text": "CVE-2018-1093",
					"href": "https://ubuntu.com/security/CVE-2018-1093",
					"priority": "medium",
					"public": "20180401",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3676-1,3676-2,3752-1,3752-2,3754-1,3752-3"
				},
				{
					"text": "CVE-2018-10940",
					"href": "https://ubuntu.com/security/CVE-2018-10940",
					"priority": "medium",
					"public": "20180509",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3676-1,3676-2,3695-1,3695-2,3754-1"
				},
				{
					"text": "CVE-2018-12233",
					"href": "https://ubuntu.com/security/CVE-2018-12233",
					"priority": "medium",
					"public": "20180612",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3752-1,3752-2,3753-1,3753-2,3754-1,3752-3"
				},
				{
					"text": "CVE-2018-13094",
					"href": "https://ubuntu.com/security/CVE-2018-13094",
					"priority": "low",
					"public": "20180703",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "3752-1,3752-2,3753-1,3753-2,3754-1,3752-3"
				},
				{
					"text": "CVE-2018-13405",
					"href": "https://ubuntu.com/security/CVE-2018-13405",
					"priority": "medium",
					"public": "20180706",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3752-1,3752-2,3753-1,3753-2,3754-1,3752-3"
				},
				{
					"text": "CVE-2018-13406",
					"href": "https://ubuntu.com/security/CVE-2018-13406",
					"priority": "medium",
					"public": "20180706",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "3752-1,3752-2,3753-1,3753-2,3754-1,3752-3"
				}
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:375410000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
