{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:23901000000",
	"version": "1",
	"metadata": {
		"title": "USN-2390-1 -- Pidgin vulnerabilities",
		"description": "Jacob Appelbaum and an anonymous person discovered that Pidgin incorrectly handled certificate validation. A remote attacker could exploit this to perform a machine-in-the-middle attack to view sensitive information or alter encrypted communications. (CVE-2014-3694)  Yves Younan and Richard Johnson discovered that Pidgin incorrectly handled certain malformed MXit emoticons. A malicious remote server or a machine-in-the-middle could use this issue to cause Pidgin to crash, resulting in a denial of service. (CVE-2014-3695)  Yves Younan and Richard Johnson discovered that Pidgin incorrectly handled certain malformed Groupwise messages. A malicious remote server or a machine-in-the-middle could use this issue to cause Pidgin to crash,  resulting in a denial of service. (CVE-2014-3696)  Thijs Alkemade and Paul Aurich discovered that Pidgin incorrectly handled memory when processing XMPP messages. A malicious remote server or user could use this issue to cause Pidgin to disclosure arbitrary memory, resulting in an information leak. (CVE-2014-3698)  Update Instructions:  Run `sudo pro fix USN-2390-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libpurple-dev - 1:2.10.9-0ubuntu3.2 pidgin - 1:2.10.9-0ubuntu3.2 pidgin-data - 1:2.10.9-0ubuntu3.2 finch-dev - 1:2.10.9-0ubuntu3.2 pidgin-dev - 1:2.10.9-0ubuntu3.2 libpurple-bin - 1:2.10.9-0ubuntu3.2 finch - 1:2.10.9-0ubuntu3.2 libpurple0 - 1:2.10.9-0ubuntu3.2 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2390-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2390-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2014-10-28"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:239010000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
