{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:64082000000",
	"version": "1",
	"metadata": {
		"title": "USN-6408-2 -- libXpm vulnerabilities",
		"description": "USN-6408-1 fixed several vulnerabilities in libXpm. This update provides the corresponding update for Ubuntu 14.04 LTS, Ubuntu 16.04 LTS and Ubuntu 18.04 LTS.  Original advisory details:   Yair Mizrahi discovered that libXpm incorrectly handled certain malformed  XPM image files. If a user were tricked into opening a specially crafted  XPM image file, a remote attacker could possibly use this issue to consume  memory, leading to a denial of service. (CVE-2023-43786)   Yair Mizrahi discovered that libXpm incorrectly handled certain malformed  XPM image files. If a user were tricked into opening a specially crafted  XPM image file, a remote attacker could use this issue to cause libXpm to  crash, leading to a denial of service, or possibly execute arbitrary code.  (CVE-2023-43787)   Alan Coopersmith discovered that libXpm incorrectly handled certain  malformed XPM image files. If a user were tricked into opening a specially  crafted XPM image file, a remote attacker could possibly use this issue to  cause libXpm to crash, leading to a denial of service. (CVE-2023-43788,  CVE-2023-43789)  Update Instructions:  Run `sudo pro fix USN-6408-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  xpmutils - 1:3.5.10-1ubuntu0.1+esm2 libxpm-dev - 1:3.5.10-1ubuntu0.1+esm2 libxpm4 - 1:3.5.10-1ubuntu0.1+esm2 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6408-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-6408-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-10-23"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:640820000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
