{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:62621000000",
	"version": "1",
	"metadata": {
		"title": "USN-6262-1 -- Wireshark vulnerabilities",
		"description": "It was discovered that Wireshark did not properly handle certain NFS packages when certain configuration options were enabled. An attacker could possibly use this issue to cause Wireshark to crash, resulting in a denial of service. (CVE-2020-13164)  It was discovered that Wireshark did not properly handle certain GVCP packages. An attacker could possibly use this issue to cause Wireshark to crash, resulting in a denial of service. This issue only affected Ubuntu 20.04 LTS. (CVE-2020-15466)  It was discovered that Wireshark did not properly handle certain Kafka packages. An attacker could possibly use this issue to cause Wireshark to crash, resulting in a denial of service. This issue only affected Ubuntu 20.04 LTS. (CVE-2020-17498)  It was discovered that Wireshark did not properly handle certain TCP packages containing an invalid 0xFFFF checksum. An attacker could possibly use this issue to cause Wireshark to crash, resulting in a denial of service. (CVE-2020-25862)  It was discovered that Wireshark did not properly handle certain MIME packages containing invalid parts. An attacker could possibly use this issue to cause Wireshark to crash, resulting in a denial of service. (CVE-2020-25863)  Update Instructions:  Run `sudo pro fix USN-6262-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libwsutil-dev - 2.6.10-1~ubuntu14.04.0~esm2 wireshark-dev - 2.6.10-1~ubuntu14.04.0~esm2 tshark - 2.6.10-1~ubuntu14.04.0~esm2 libwireshark-dev - 2.6.10-1~ubuntu14.04.0~esm2 wireshark-qt - 2.6.10-1~ubuntu14.04.0~esm2 libwiretap-dev - 2.6.10-1~ubuntu14.04.0~esm2 wireshark-gtk - 2.6.10-1~ubuntu14.04.0~esm2 libwscodecs2 - 2.6.10-1~ubuntu14.04.0~esm2 wireshark-doc - 2.6.10-1~ubuntu14.04.0~esm2 wireshark-common - 2.6.10-1~ubuntu14.04.0~esm2 libwiretap8 - 2.6.10-1~ubuntu14.04.0~esm2 libwireshark-data - 2.6.10-1~ubuntu14.04.0~esm2 libwireshark11 - 2.6.10-1~ubuntu14.04.0~esm2 libwsutil9 - 2.6.10-1~ubuntu14.04.0~esm2 wireshark - 2.6.10-1~ubuntu14.04.0~esm2 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6262-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6262-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-07-31"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:626210000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
