{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:29092000000",
	"version": "1",
	"metadata": {
		"title": "USN-2909-2 -- Linux kernel (Utopic HWE) regression",
		"description": "USN-2909-1 fixed vulnerabilities in the Ubuntu 14.10 Linux kernel backported to Ubuntu 14.04 LTS. An incorrect locking fix caused a regression that broke graphics displays for Ubuntu 14.04 LTS guests running the Ubuntu 14.10 backport kernel within VMWare virtual machines. This update fixes the problem.  We apologize for the inconvenience.  Original advisory details:   halfdog discovered that OverlayFS, when mounting on top of a FUSE mount,  incorrectly propagated file attributes, including setuid. A local  unprivileged attacker could use this to gain privileges. (CVE-2016-1576)   halfdog discovered that OverlayFS in the Linux kernel incorrectly  propagated security sensitive extended attributes, such as POSIX ACLs. A  local unprivileged attacker could use this to gain privileges.  (CVE-2016-1575)   It was discovered that the Linux kernel's Filesystem in Userspace (FUSE)  implementation did not handle initial zero length segments properly. A  local attacker could use this to cause a denial of service (unkillable  task). (CVE-2015-8785)  Update Instructions:  Run `sudo pro fix USN-2909-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-extra-3.16.0-62-generic - 3.16.0-62.83~14.04.1 linux-image-3.16.0-62-generic-lpae - 3.16.0-62.83~14.04.1 linux-image-3.16.0-62-lowlatency - 3.16.0-62.83~14.04.1 linux-image-3.16.0-62-powerpc-e500mc - 3.16.0-62.83~14.04.1 linux-image-3.16.0-62-powerpc-smp - 3.16.0-62.83~14.04.1 linux-image-3.16.0-62-powerpc64-smp - 3.16.0-62.83~14.04.1 linux-image-3.16.0-62-generic - 3.16.0-62.83~14.04.1 linux-image-3.16.0-62-powerpc64-emb - 3.16.0-62.83~14.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2909-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-2909-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-02-27"
			},
			"bug": [
				"https://launchpad.net/bugs/1548587"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:290920000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
