{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:28671000000",
	"version": "1",
	"metadata": {
		"title": "USN-2867-1 -- libvirt vulnerabilities",
		"description": "It was discovered that libvirt incorrectly handled the firewall rules on bridge networks when the daemon was restarted. This could result in an unintended firewall configuration. This issue only applied to Ubuntu 12.04 LTS. (CVE-2011-4600)  Peter Krempa discovered that libvirt incorrectly handled locking when certain ACL checks failed. A local attacker could use this issue to cause libvirt to stop responding, resulting in a denial of service. This issue only applied to Ubuntu 14.04 LTS. (CVE-2014-8136)  Luyao Huang discovered that libvirt incorrectly handled VNC passwords in shapshot and image files. A remote authenticated user could use this issue to possibly obtain VNC passwords. This issue only affected Ubuntu 14.04 LTS. (CVE-2015-0236)  Han Han discovered that libvirt incorrectly handled volume creation failure when used with NFS. A remote authenticated user could use this issue to cause libvirt to crash, resulting in a denial of service. This issue only applied to Ubuntu 15.10. (CVE-2015-5247)  Ossi Herrala and Joonas Kuorilehto discovered that libvirt incorrectly performed storage pool name validation. A remote authenticated user could use this issue to bypass ACLs and gain access to unintended files. This issue only applied to Ubuntu 14.04 LTS, Ubuntu 15.04 and Ubuntu 15.10. (CVE-2015-5313)  Update Instructions:  Run `sudo pro fix USN-2867-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libvirt0 - 1.2.2-0ubuntu13.1.16 libvirt-dev - 1.2.2-0ubuntu13.1.16 libvirt-doc - 1.2.2-0ubuntu13.1.16 libvirt-bin - 1.2.2-0ubuntu13.1.16 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2867-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2867-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-01-12"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:286710000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
