{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:46022000000",
	"version": "1",
	"metadata": {
		"title": "USN-4602-2 -- Perl vulnerabilities",
		"description": "USN-4602-1 fixed several vulnerabilities in Perl. This update provides the corresponding update for Ubuntu 12.04 ESM and Ubuntu 14.04 ESM.   Original advisory details:   ManhND discovered that Perl incorrectly handled certain regular  expressions. In environments where untrusted regular expressions are  evaluated, a remote attacker could possibly use this issue to cause Perl to  crash, resulting in a denial of service, or possibly execute arbitrary  code. (CVE-2020-10543)   Hugo van der Sanden and Slaven Rezic discovered that Perl incorrectly  handled certain regular expressions. In environments where untrusted  regular expressions are evaluated, a remote attacker could possibly use  this issue to cause Perl to crash, resulting in a denial of service, or  possibly execute arbitrary code. (CVE-2020-10878)   Sergey Aleynikov discovered that Perl incorrectly handled certain regular  expressions. In environments where untrusted regular expressions are  evaluated, a remote attacker could possibly use this issue to cause Perl to  crash, resulting in a denial of service, or possibly execute arbitrary  code. (CVE-2020-12723)  Update Instructions:  Run `sudo pro fix USN-4602-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libperl-dev - 5.18.2-2ubuntu1.7+esm3 perl-doc - 5.18.2-2ubuntu1.7+esm3 libperl5.18 - 5.18.2-2ubuntu1.7+esm3 perl-base - 5.18.2-2ubuntu1.7+esm3 perl-modules - 5.18.2-2ubuntu1.7+esm3 libcgi-fast-perl - 5.18.2-2ubuntu1.7+esm3 perl - 5.18.2-2ubuntu1.7+esm3 perl-debug - 5.18.2-2ubuntu1.7+esm3 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4602-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-4602-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-10-27"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:460220000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
