{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:22901000000",
	"version": "1",
	"metadata": {
		"title": "USN-2290-1 -- Linux kernel vulnerabilities",
		"description": "Sasha Levin reported a flaw in the Linux kernel's point-to-point protocol (PPP) when used with the Layer Two Tunneling Protocol (L2TP). A local user could exploit this flaw to gain administrative privileges. (CVE-2014-4943)  Salva Peiró discovered an information leak in the Linux kernel's media- device driver. A local attacker could exploit this flaw to obtain sensitive information from kernel memory. (CVE-2014-1739)  A bounds check error was discovered in the socket filter subsystem of the Linux kernel. A local user could exploit this flaw to cause a denial of service (system crash) via crafted BPF instructions. (CVE-2014-3144)  A remainder calculation error was discovered in the socket filter subsystem of the Linux kernel. A local user could exploit this flaw to cause a denial of service (system crash) via crafted BPF instructions. (CVE-2014-3145)  A flaw was discovered in the Linux kernel's handling of hugetlb entries. A local user could exploit this flaw to cause a denial service (memory corruption or system crash). (CVE-2014-3940)  Don Bailey and Ludvig Strigeus discovered an integer overflow in the Linux kernel's implementation of the LZ4 decompression algorithm, when used by code not complying with API limitations. An attacker could exploit this flaw to cause a denial of service (memory corruption) or possibly other unspecified impact. (CVE-2014-4611)  Tuomas Räsänen reported the Linux kernel on certain Intel processors does not properly initialize random seeds for network operations, causing TCP sequence numbers, TCP and UDP port numbers and IP ID values to be predictable. A remote attacker could exploit this flaw to spoof or disrupt IP communication. (CVE-2014-7284)  Update Instructions:  Run `sudo pro fix USN-2290-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-3.13.0-32-powerpc64-smp - 3.13.0-32.57 linux-image-3.13.0-32-powerpc-e500 - 3.13.0-32.57 linux-image-3.13.0-32-generic - 3.13.0-32.57 linux-image-3.13.0-32-powerpc64-emb - 3.13.0-32.57 linux-image-3.13.0-32-powerpc-smp - 3.13.0-32.57 linux-image-extra-3.13.0-32-generic - 3.13.0-32.57 linux-image-3.13.0-32-generic-lpae - 3.13.0-32.57 linux-image-3.13.0-32-lowlatency - 3.13.0-32.57 linux-image-3.13.0-32-powerpc-e500mc - 3.13.0-32.57 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2290-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2290-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2014-07-17"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:229010000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
