{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:35931000000",
	"version": "1",
	"metadata": {
		"title": "USN-3593-1 -- Zsh vulnerabilities",
		"description": "It was discovered that Zsh incorrectly handled certain enviroment variables. An attacker could possibly use this issue to gain privileged access to the system. This issue only affected Ubuntu 14.04 LTS. (CVE-2014-10070)  It was discovered that Zsh incorrectly handled certain inputs. An attacker could possibly use this to execute arbitrary code. This issue only affected Ubuntu 14.04 LTS. (CVE-2014-10071)  It was discovered that Zsh incorrectly handled some symbolic links. An attacker could possibly use this to execute arbitrary code. This issue only affected Ubuntu 14.04 LTS. (CVE-2014-10072)  It was discovered that Zsh incorrectly handled certain errors. An attacker could possibly use this issue to cause a denial of service. (CVE-2016-10714)  It was discovered that Zsh incorrectly handled certain commands. An attacker could possibly use this to execute arbitrary code. (CVE-2017-18205)  It was discovered that Zsh incorrectly handled certain symlinks. An attacker could possibly use this to execute arbitrary code. This issue only affected Ubuntu 16.04 LTS and Ubuntu 17.10. (CVE-2017-18206)  It was discovered that Zsh incorrectly handled certain inputs. An attacker could possible use to execute arbitrary code. This issue only affected Ubuntu 17.10. (CVE-2018-7548)  It was discovered that Zsh incorrectly handled certain inputs. An attacker could possibly use this to cause a denial of service. (CVE-2018-7549)  Update Instructions:  Run `sudo pro fix USN-3593-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  zsh-beta-doc - 5.0.2-3ubuntu6.1 zsh-static - 5.0.2-3ubuntu6.1 zsh-common - 5.0.2-3ubuntu6.1 zsh-beta - 5.0.2-3ubuntu6.1 zsh-dev - 5.0.2-3ubuntu6.1 zsh - 5.0.2-3ubuntu6.1 zsh-doc - 5.0.2-3ubuntu6.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3593-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3593-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2018-03-08"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:359310000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
