{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:29841000000",
	"version": "1",
	"metadata": {
		"title": "USN-2984-1 -- PHP vulnerabilities",
		"description": "It was discovered that the PHP Fileinfo component incorrectly handled certain magic files. An attacker could use this issue to cause PHP to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 16.04 LTS. (CVE-2015-8865)  Hans Jerry Illikainen discovered that the PHP Zip extension incorrectly handled certain malformed Zip archives. A remote attacker could use this issue to cause PHP to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 16.04 LTS. (CVE-2016-3078)  It was discovered that PHP incorrectly handled invalid indexes in the SplDoublyLinkedList class. An attacker could use this issue to cause PHP to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 16.04 LTS. (CVE-2016-3132)  It was discovered that the PHP rawurlencode() function incorrectly handled large strings. A remote attacker could use this issue to cause PHP to crash, resulting in a denial of service. This issue only affected Ubuntu 16.04 LTS. (CVE-2016-4070)  It was discovered that the PHP php_snmp_error() function incorrectly handled string formatting. A remote attacker could use this issue to cause PHP to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 16.04 LTS. (CVE-2016-4071)  It was discovered that the PHP phar extension incorrectly handled certain filenames in archives. A remote attacker could use this issue to cause PHP to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 16.04 LTS. (CVE-2016-4072)  It was discovered that the PHP mb_strcut() function incorrectly handled string formatting. A remote attacker could use this issue to cause PHP to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 16.04 LTS. (CVE-2016-4073)  It was discovered that the PHP phar extension incorrectly handled certain archive files. A remote attacker could use this issue to cause PHP to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 12.04 LTS, Ubuntu 14.04 LTS and Ubuntu 15.10. (CVE-2016-4342, CVE-2016-4343)  It was discovered that the PHP bcpowmod() function incorrectly handled memory. A remote attacker could use this issue to cause PHP to crash, resulting in a denial of service, or possibly execute arbitrary code.  (CVE-2016-4537, CVE-2016-4538)  It was discovered that the PHP XML parser incorrectly handled certain malformed XML data. A remote attacker could possibly use this issue to cause PHP to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2016-4539)  It was discovered that certain PHP grapheme functions incorrectly handled negative offsets. A remote attacker could possibly use this issue to cause PHP to crash, resulting in a denial of service. (CVE-2016-4540, CVE-2016-4541)  It was discovered that PHP incorrectly handled certain malformed EXIF tags. A remote attacker could possibly use this issue to cause PHP to crash, resulting in a denial of service. (CVE-2016-4542, CVE-2016-4543, CVE-2016-4544)  Update Instructions:  Run `sudo pro fix USN-2984-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  php5-recode - 5.5.9+dfsg-1ubuntu4.17 php5-cgi - 5.5.9+dfsg-1ubuntu4.17 php5-enchant - 5.5.9+dfsg-1ubuntu4.17 php5-intl - 5.5.9+dfsg-1ubuntu4.17 php5-snmp - 5.5.9+dfsg-1ubuntu4.17 php5-mysql - 5.5.9+dfsg-1ubuntu4.17 php5-odbc - 5.5.9+dfsg-1ubuntu4.17 php5-xsl - 5.5.9+dfsg-1ubuntu4.17 php5-gd - 5.5.9+dfsg-1ubuntu4.17 libapache2-mod-php5 - 5.5.9+dfsg-1ubuntu4.17 php5-tidy - 5.5.9+dfsg-1ubuntu4.17 php5-dev - 5.5.9+dfsg-1ubuntu4.17 php5-pgsql - 5.5.9+dfsg-1ubuntu4.17 php5-curl - 5.5.9+dfsg-1ubuntu4.17 php5 - 5.5.9+dfsg-1ubuntu4.17 php5-gmp - 5.5.9+dfsg-1ubuntu4.17 php5-fpm - 5.5.9+dfsg-1ubuntu4.17 php5-xmlrpc - 5.5.9+dfsg-1ubuntu4.17 php5-sqlite - 5.5.9+dfsg-1ubuntu4.17 php5-ldap - 5.5.9+dfsg-1ubuntu4.17 php5-mysqlnd - 5.5.9+dfsg-1ubuntu4.17 php5-readline - 5.5.9+dfsg-1ubuntu4.17 php5-cli - 5.5.9+dfsg-1ubuntu4.17 php-pear - 5.5.9+dfsg-1ubuntu4.17 php5-sybase - 5.5.9+dfsg-1ubuntu4.17 libapache2-mod-php5filter - 5.5.9+dfsg-1ubuntu4.17 php5-pspell - 5.5.9+dfsg-1ubuntu4.17 php5-common - 5.5.9+dfsg-1ubuntu4.17 libphp5-embed - 5.5.9+dfsg-1ubuntu4.17 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2984-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2984-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-05-24"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:298410000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
