{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:29601000000",
	"version": "1",
	"metadata": {
		"title": "USN-2960-1 -- Oxide vulnerabilities",
		"description": "An out of bounds write was discovered in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash, or execute arbitrary code. (CVE-2016-1660)  It was discovered that Blink assumes that a frame which passes same-origin checks is local in some cases. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash, or execute arbitrary code. (CVE-2016-1661)  A use-after-free was discovered in the V8 bindings in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash, or execute arbitrary code. (CVE-2016-1663)  It was discovered that the JSGenericLowering class in V8 mishandles comparison operators. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to obtain sensitive information. (CVE-2016-1665)  Multiple security issues were discovered in Chromium. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to read uninitialized memory, cause a denial of service via application crash or execute arbitrary code. (CVE-2016-1666)  It was discovered that the TreeScope::adoptIfNeeded function in Blink does not prevent script execution during node-adoption operations. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to bypass same origin restrictions. (CVE-2016-1667)  It was discovered that the forEachForBinding in the V8 bindings in Blink uses an improper creation context. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to bypass same origin restrictions. (CVE-2016-1668)  A buffer overflow was discovered in V8. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash, or execute arbitrary code. (CVE-2016-1669)  A race condition was discovered in ResourceDispatcherHostImpl in Chromium. An attacker could potentially exploit this to make arbitrary HTTP requests. (CVE-2016-1670)  Update Instructions:  Run `sudo pro fix USN-2960-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  liboxideqtcore0 - 1.14.9-0ubuntu0.14.04.1 liboxideqt-qmlplugin - 1.14.9-0ubuntu0.14.04.1 liboxideqtquick-dev - 1.14.9-0ubuntu0.14.04.1 oxideqt-codecs-extra - 1.14.9-0ubuntu0.14.04.1 liboxideqtcore-dev - 1.14.9-0ubuntu0.14.04.1 oxideqmlscene - 1.14.9-0ubuntu0.14.04.1 oxideqt-codecs - 1.14.9-0ubuntu0.14.04.1 liboxideqtquick0 - 1.14.9-0ubuntu0.14.04.1 oxideqt-chromedriver - 1.14.9-0ubuntu0.14.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2960-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2960-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-05-18"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:296010000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
