{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:57901000000",
	"version": "1",
	"metadata": {
		"title": "USN-5790-1 -- Linux kernel vulnerabilities",
		"description": "It was discovered that the BPF verifier in the Linux kernel did not properly handle internal data structures. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2021-4159)  It was discovered that a race condition existed in the Android Binder IPC subsystem in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-20421)  It was discovered that the Intel 740 frame buffer driver in the Linux kernel contained a divide by zero vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-3061)  Gwnaun Jung discovered that the SFB packet scheduling implementation in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3586)  Jann Horn discovered a race condition existed in the Linux kernel when unmapping VMAs in certain situations, resulting in possible use-after-free vulnerabilities. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-39188)  It was discovered that a race condition existed in the EFI capsule loader driver in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-40307)  Zheng Wang and Zhuorao Yang discovered that the RealTek RTL8712U wireless driver in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-4095)  Update Instructions:  Run `sudo pro fix USN-5790-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-azure-cloud-tools-4.15.0-1158 - 4.15.0-1158.173~14.04.1 linux-azure-tools-4.15.0-1158 - 4.15.0-1158.173~14.04.1 linux-headers-4.15.0-1158-azure - 4.15.0-1158.173~14.04.1 linux-image-unsigned-4.15.0-1158-azure - 4.15.0-1158.173~14.04.1 linux-modules-extra-4.15.0-1158-azure - 4.15.0-1158.173~14.04.1 linux-tools-4.15.0-1158-azure - 4.15.0-1158.173~14.04.1 linux-azure-headers-4.15.0-1158 - 4.15.0-1158.173~14.04.1 linux-image-4.15.0-1158-azure - 4.15.0-1158.173~14.04.1 linux-cloud-tools-4.15.0-1158-azure - 4.15.0-1158.173~14.04.1 linux-modules-4.15.0-1158-azure - 4.15.0-1158.173~14.04.1 linux-buildinfo-4.15.0-1158-azure - 4.15.0-1158.173~14.04.1 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro  linux-signed-azure - 4.15.0.1158.125 linux-azure - 4.15.0.1158.125 linux-signed-image-azure - 4.15.0.1158.125 linux-modules-extra-azure - 4.15.0.1158.125 linux-headers-azure - 4.15.0.1158.125 linux-cloud-tools-azure - 4.15.0.1158.125 linux-tools-azure - 4.15.0.1158.125 linux-image-azure - 4.15.0.1158.125 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5790-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5790-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-01-06"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:579010000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
