{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:54872000000",
	"version": "1",
	"metadata": {
		"title": "USN-5487-2 -- Apache HTTP Server regression",
		"description": "USN-5487-1 fixed several vulnerabilities in Apache. Unfortunately, that update introduced a regression when proxying balancer manager connections in some configurations on Ubuntu 14.04 ESM. This update reverts those changes till further fix.  We apologize for the inconvenience.  Original advisory details:   It was discovered that Apache HTTP Server mod_proxy_ajp incorrectly handled  certain crafted request. A remote attacker could possibly use this issue to  perform an HTTP Request Smuggling attack. (CVE-2022-26377)    It was discovered that Apache HTTP Server incorrectly handled certain  request. An attacker could possibly use this issue to cause a denial  of service. (CVE-2022-28614)    It was discovered that Apache HTTP Server incorrectly handled certain request.  An attacker could possibly use this issue to cause a crash or expose  sensitive information. (CVE-2022-28615)    It was discovered that Apache HTTP Server incorrectly handled certain request.  An attacker could possibly use this issue to cause a denial of service.  (CVE-2022-29404)    It was discovered that Apache HTTP Server incorrectly handled certain  request. An attacker could possibly use this issue to cause a crash.  (CVE-2022-30522)    It was discovered that Apache HTTP Server incorrectly handled certain request.  An attacker could possibly use this issue to execute arbitrary code or cause  a crash. (CVE-2022-30556)    It was discovered that Apache HTTP Server incorrectly handled certain request.  An attacker could possibly use this issue to bypass IP based authentication.  (CVE-2022-31813)  Update Instructions:  Run `sudo pro fix USN-5487-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libapache2-mod-proxy-html - 1:2.4.7-1ubuntu4.22+esm6 libapache2-mod-macro - 1:2.4.7-1ubuntu4.22+esm6 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro  apache2-data - 2.4.7-1ubuntu4.22+esm6 apache2-utils - 2.4.7-1ubuntu4.22+esm6 apache2-dev - 2.4.7-1ubuntu4.22+esm6 apache2-suexec-pristine - 2.4.7-1ubuntu4.22+esm6 apache2-suexec-custom - 2.4.7-1ubuntu4.22+esm6 apache2-suexec - 2.4.7-1ubuntu4.22+esm6 apache2 - 2.4.7-1ubuntu4.22+esm6 apache2-mpm-worker - 2.4.7-1ubuntu4.22+esm6 apache2-doc - 2.4.7-1ubuntu4.22+esm6 apache2-mpm-prefork - 2.4.7-1ubuntu4.22+esm6 apache2-mpm-event - 2.4.7-1ubuntu4.22+esm6 apache2-mpm-itk - 2.4.7-1ubuntu4.22+esm6 apache2-bin - 2.4.7-1ubuntu4.22+esm6 apache2.2-bin - 2.4.7-1ubuntu4.22+esm6 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5487-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-5487-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-06-23"
			},
			"bug": [
				"https://launchpad.net/bugs/1979577"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:548720000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:548720000010",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
