{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:24661000000",
	"version": "1",
	"metadata": {
		"title": "USN-2466-1 -- Linux kernel vulnerabilities",
		"description": "A null pointer dereference flaw was discovered in the the Linux kernel's SCTP implementation when ASCONF is used. A remote attacker could exploit this flaw to cause a denial of service (system crash) via a malformed INIT chunk. (CVE-2014-7841)  A race condition with MMIO and PIO transactions in the KVM (Kernel Virtual Machine) subsystem of the Linux kernel was discovered. A guest OS user could exploit this flaw to cause a denial of service (guest OS crash) via a specially crafted application. (CVE-2014-7842)  Miloš Prchlík reported a flaw in how the ARM64 platform handles a single byte overflow in __clear_user. A local user could exploit this flaw to cause a denial of service (system crash) by reading one byte beyond a /dev/zero page boundary. (CVE-2014-7843)  A stack buffer overflow was discovered in the ioctl command handling for the Technotrend/Hauppauge USB DEC devices driver. A local user could exploit this flaw to cause a denial of service (system crash) or possibly gain privileges. (CVE-2014-8884)  Update Instructions:  Run `sudo pro fix USN-2466-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-3.13.0-44-powerpc-smp - 3.13.0-44.73 linux-image-3.13.0-44-powerpc64-emb - 3.13.0-44.73 linux-image-3.13.0-44-generic-lpae - 3.13.0-44.73 linux-image-extra-3.13.0-44-generic - 3.13.0-44.73 linux-image-3.13.0-44-powerpc-e500mc - 3.13.0-44.73 linux-image-3.13.0-44-lowlatency - 3.13.0-44.73 linux-image-3.13.0-44-powerpc64-smp - 3.13.0-44.73 linux-image-3.13.0-44-powerpc-e500 - 3.13.0-44.73 linux-image-3.13.0-44-generic - 3.13.0-44.73 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2466-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2466-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2015-01-13"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:246610000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
