{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:56191000000",
	"version": "1",
	"metadata": {
		"title": "USN-5619-1 -- LibTIFF vulnerabilities",
		"description": "It was discovered that LibTIFF was not properly performing the calculation of data that would eventually be used as a reference for bound-checking operations. An attacker could possibly use this issue to cause a denial of service or to expose sensitive information. This issue only affected Ubuntu 18.04 LTS. (CVE-2020-19131)  It was discovered that LibTIFF was not properly terminating a function execution when processing incorrect data. An attacker could possibly use this issue to cause a denial of service or to expose sensitive information. This issue only affected Ubuntu 18.04 LTS. (CVE-2020-19144)  It was discovered that LibTIFF did not properly manage memory under certain circumstances. If a user were tricked into opening a specially crafted TIFF file using tiffinfo tool, an attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 20.04 LTS and Ubuntu 22.04 LTS. (CVE-2022-1354)  It was discovered that LibTIFF did not properly manage memory under certain circumstances. If a user were tricked into opening a specially crafted TIFF file using tiffcp tool, an attacker could possibly use this issue to      cause a denial of service. (CVE-2022-1355)  It was discovered that LibTIFF was not properly performing checks to avoid division calculations where the denominator value was zero, which could lead to an undefined behaviour situation via a specially crafted file. An attacker could possibly use this issue to cause a denial of service. (CVE-2022-2056, CVE-2022-2057, CVE-2022-2058)  Update Instructions:  Run `sudo pro fix USN-5619-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libtiff-opengl - 4.0.3-7ubuntu0.11+esm4 libtiff-tools - 4.0.3-7ubuntu0.11+esm4 libtiff5-dev - 4.0.3-7ubuntu0.11+esm4 libtiff4-dev - 4.0.3-7ubuntu0.11+esm4 libtiff5-alt-dev - 4.0.3-7ubuntu0.11+esm4 libtiff5 - 4.0.3-7ubuntu0.11+esm4 libtiffxx5 - 4.0.3-7ubuntu0.11+esm4 libtiff-doc - 4.0.3-7ubuntu0.11+esm4 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5619-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5619-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-09-20"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:561910000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
