{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:28871000000",
	"version": "1",
	"metadata": {
		"title": "USN-2887-1 -- Linux kernel vulnerabilities",
		"description": "It was discovered that a use-after-free vulnerability existed in the AF_UNIX implementation in the Linux kernel. A local attacker could use crafted epoll_ctl calls to cause a denial of service (system crash) or expose sensitive information. (CVE-2013-7446)  It was discovered that the KVM implementation in the Linux kernel did not properly restore the values of the Programmable Interrupt Timer (PIT). A user-assisted attacker in a KVM guest could cause a denial of service in the host (system crash). (CVE-2015-7513)  Sasha Levin discovered that the Reliable Datagram Sockets (RDS) implementation in the Linux kernel had a race condition when checking whether a socket was bound or not. A local attacker could use this to cause a denial of service (system crash). (CVE-2015-7990)  It was discovered that the Btrfs implementation in the Linux kernel incorrectly handled compressed inline extants on truncation. A local attacker could use this to expose sensitive information. (CVE-2015-8374)  Update Instructions:  Run `sudo pro fix USN-2887-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-3.13.0-77-powerpc64-emb - 3.13.0-77.121 linux-image-3.13.0-77-generic - 3.13.0-77.121 linux-image-3.13.0-77-powerpc-e500mc - 3.13.0-77.121 linux-image-3.13.0-77-lowlatency - 3.13.0-77.121 linux-image-extra-3.13.0-77-generic - 3.13.0-77.121 linux-image-3.13.0-77-powerpc-smp - 3.13.0-77.121 linux-image-3.13.0-77-powerpc-e500 - 3.13.0-77.121 linux-image-3.13.0-77-powerpc64-smp - 3.13.0-77.121 linux-image-3.13.0-77-generic-lpae - 3.13.0-77.121 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2887-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2887-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-02-02"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:288710000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
