{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:38212000000",
	"version": "1",
	"metadata": {
		"title": "USN-3821-2 -- Linux kernel (Xenial HWE) vulnerabilities",
		"description": "USN-3821-1 fixed vulnerabilities in the Linux kernel for Ubuntu 16.04 LTS. This update provides the corresponding updates for the Linux Hardware Enablement (HWE) kernel from Ubuntu 16.04 LTS for Ubuntu 14.04 LTS.  Wen Xu discovered that the ext4 filesystem implementation in the Linux kernel did not properly ensure that xattr information remained in inode bodies. An attacker could use this to construct a malicious ext4 image that, when mounted, could cause a denial of service (system crash). (CVE-2018-10880)  It was discovered that the alarmtimer implementation in the Linux kernel contained an integer overflow vulnerability. A local attacker could use this to cause a denial of service. (CVE-2018-13053)  Wen Xu discovered that the f2fs filesystem implementation in the Linux kernel did not properly validate metadata. An attacker could use this to construct a malicious f2fs image that, when mounted, could cause a denial of service (system crash). (CVE-2018-13096)  Wen Xu and Po-Ning Tseng discovered that the btrfs filesystem implementation in the Linux kernel did not properly handle relocations in some situations. An attacker could use this to construct a malicious btrfs image that, when mounted, could cause a denial of service (system crash). (CVE-2018-14609)  Wen Xu discovered that the HFS+ filesystem implementation in the Linux kernel did not properly handle malformed catalog data in some situations. An attacker could use this to construct a malicious HFS+ image that, when mounted, could cause a denial of service (system crash). (CVE-2018-14617)  Jann Horn discovered that the procfs file system implementation in the Linux kernel did not properly restrict the ability to inspect the kernel stack of an arbitrary task. A local attacker could use this to expose sensitive information. (CVE-2018-17972)  It was discovered that the KVM implementation in the Linux kernel on ARM 64bit processors did not properly handle some ioctls. An attacker with the privilege to create KVM-based virtual machines could use this to cause a denial of service (host system crash) or execute arbitrary code in the host. (CVE-2018-18021)  Update Instructions:  Run `sudo pro fix USN-3821-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.4.0-1034-aws - 4.4.0-1034.37 No subscription required  linux-image-4.4.0-139-generic-lpae - 4.4.0-139.165~14.04.1 linux-image-4.4.0-139-lowlatency - 4.4.0-139.165~14.04.1 linux-image-4.4.0-139-generic - 4.4.0-139.165~14.04.1 linux-image-4.4.0-139-powerpc-e500mc - 4.4.0-139.165~14.04.1 linux-image-4.4.0-139-powerpc64-smp - 4.4.0-139.165~14.04.1 linux-image-4.4.0-139-powerpc64-emb - 4.4.0-139.165~14.04.1 linux-image-extra-4.4.0-139-generic - 4.4.0-139.165~14.04.1 linux-image-4.4.0-139-powerpc-smp - 4.4.0-139.165~14.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3821-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-3821-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2018-11-14"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:382120000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:382120000010",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
