{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:37972000000",
	"version": "1",
	"metadata": {
		"title": "USN-3797-2 -- Linux kernel (Xenial HWE) vulnerabilities",
		"description": "USN-3797-1 fixed vulnerabilities in the Linux kernel for Ubuntu 16.04 LTS. This update provides the corresponding updates for the Linux Hardware Enablement (HWE) kernel from Ubuntu 16.04 LTS for Ubuntu 14.04 LTS.  Noam Rathaus discovered that a use-after-free vulnerability existed in the Infiniband implementation in the Linux kernel. An attacker could use this to cause a denial of service (system crash). (CVE-2018-14734)  It was discovered that an integer overflow existed in the CD-ROM driver of the Linux kernel. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2018-16658)  It was discovered that a integer overflow existed in the HID Bluetooth implementation in the Linux kernel that could lead to a buffer overwrite. An attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-9363)  Yves Younan discovered that the CIPSO labeling implementation in the Linux kernel did not properly handle IP header options in some situations. A remote attacker could use this to specially craft network traffic that could cause a denial of service (infinite loop). (CVE-2018-10938)  Update Instructions:  Run `sudo pro fix USN-3797-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.4.0-1032-aws - 4.4.0-1032.35 No subscription required  linux-image-4.4.0-138-powerpc-smp - 4.4.0-138.164~14.04.1 linux-image-4.4.0-138-powerpc64-emb - 4.4.0-138.164~14.04.1 linux-image-4.4.0-138-powerpc-e500mc - 4.4.0-138.164~14.04.1 linux-image-4.4.0-138-powerpc64-smp - 4.4.0-138.164~14.04.1 linux-image-extra-4.4.0-138-generic - 4.4.0-138.164~14.04.1 linux-image-4.4.0-138-generic - 4.4.0-138.164~14.04.1 linux-image-4.4.0-138-generic-lpae - 4.4.0-138.164~14.04.1 linux-image-4.4.0-138-lowlatency - 4.4.0-138.164~14.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3797-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-3797-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2018-10-23"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:379720000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:379720000010",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
