{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:30331000000",
	"version": "1",
	"metadata": {
		"title": "USN-3033-1 -- libarchive vulnerabilities",
		"description": "Hanno Böck discovered that libarchive contained multiple security issues when processing certain malformed archive files. A remote attacker could use this issue to cause libarchive to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2015-8916, CVE-2015-8917 CVE-2015-8919, CVE-2015-8920, CVE-2015-8921, CVE-2015-8922, CVE-2015-8923, CVE-2015-8924, CVE-2015-8925, CVE-2015-8926, CVE-2015-8928, CVE-2015-8930, CVE-2015-8931, CVE-2015-8932, CVE-2015-8933, CVE-2015-8934, CVE-2016-5844)  Marcin \"Icewall\" Noga discovered that libarchive contained multiple security issues when processing certain malformed archive files. A remote attacker could use this issue to cause libarchive to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2016-4300, CVE-2016-4302)  It was discovered that libarchive incorrectly handled memory allocation with large cpio symlinks. A remote attacker could use this issue to possibly cause libarchive to crash, resulting in a denial of service. (CVE-2016-4809)  Update Instructions:  Run `sudo pro fix USN-3033-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  bsdcpio - 3.1.2-7ubuntu2.3 libarchive13 - 3.1.2-7ubuntu2.3 bsdtar - 3.1.2-7ubuntu2.3 libarchive-dev - 3.1.2-7ubuntu2.3 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3033-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3033-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-07-14"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:303310000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
