{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:54661000000",
	"version": "1",
	"metadata": {
		"title": "USN-5466-1 -- Linux kernel vulnerabilities",
		"description": "It was discovered that the Linux kernel did not properly restrict access to the kernel debugger when booted in secure boot environments. A privileged attacker could use this to bypass UEFI Secure Boot restrictions. (CVE-2022-21499)  Aaron Adams discovered that the netfilter subsystem in the Linux kernel did not properly handle the removal of stateful expressions in some situations, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-1966)  It was discovered that the SCTP protocol implementation in the Linux kernel did not properly verify VTAGs in some situations. A remote attacker could possibly use this to cause a denial of service (connection disassociation). (CVE-2021-3772)  It was discovered that the btrfs file system implementation in the Linux kernel did not properly handle locking in certain error conditions. A local attacker could use this to cause a denial of service (kernel deadlock). (CVE-2021-4149)  David Bouman discovered that the netfilter subsystem in the Linux kernel did not initialize memory in some situations. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2022-1016)  It was discovered that the virtual graphics memory manager implementation in the Linux kernel was subject to a race condition, potentially leading to an information leak. (CVE-2022-1419)  赵子轩 discovered that the 802.2 LLC type 2 driver in the Linux kernel did not properly perform reference counting in some error conditions. A local attacker could use this to cause a denial of service. (CVE-2022-28356)  It was discovered that the EMS CAN/USB interface implementation in the Linux kernel contained a double-free vulnerability when handling certain error conditions. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2022-28390)  Update Instructions:  Run `sudo pro fix USN-5466-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-azure-cloud-tools-4.15.0-1142 - 4.15.0-1142.156~14.04.1 linux-azure-headers-4.15.0-1142 - 4.15.0-1142.156~14.04.1 linux-azure-tools-4.15.0-1142 - 4.15.0-1142.156~14.04.1 linux-modules-extra-4.15.0-1142-azure - 4.15.0-1142.156~14.04.1 linux-cloud-tools-4.15.0-1142-azure - 4.15.0-1142.156~14.04.1 linux-buildinfo-4.15.0-1142-azure - 4.15.0-1142.156~14.04.1 linux-modules-4.15.0-1142-azure - 4.15.0-1142.156~14.04.1 linux-image-4.15.0-1142-azure - 4.15.0-1142.156~14.04.1 linux-headers-4.15.0-1142-azure - 4.15.0-1142.156~14.04.1 linux-tools-4.15.0-1142-azure - 4.15.0-1142.156~14.04.1 linux-image-unsigned-4.15.0-1142-azure - 4.15.0-1142.156~14.04.1 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro  linux-tools-azure - 4.15.0.1142.113 linux-signed-azure - 4.15.0.1142.113 linux-signed-image-azure - 4.15.0.1142.113 linux-modules-extra-azure - 4.15.0.1142.113 linux-cloud-tools-azure - 4.15.0.1142.113 linux-headers-azure - 4.15.0.1142.113 linux-azure - 4.15.0.1142.113 linux-image-azure - 4.15.0.1142.113 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5466-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5466-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-06-08"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:546610000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
