{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:22323000000",
	"version": "1",
	"metadata": {
		"title": "USN-2232-3 -- OpenSSL regression",
		"description": "USN-2232-1 fixed vulnerabilities in OpenSSL. The upstream fix for CVE-2014-0224 caused a regression for certain applications that use renegotiation, such as PostgreSQL. This update fixes the problem.  Original advisory details:   Jüri Aedla discovered that OpenSSL incorrectly handled invalid DTLS  fragments. A remote attacker could use this issue to cause OpenSSL to  crash, resulting in a denial of service, or possibly execute arbitrary  code. This issue only affected Ubuntu 12.04 LTS, Ubuntu 13.10, and  Ubuntu 14.04 LTS. (CVE-2014-0195)    Imre Rad discovered that OpenSSL incorrectly handled DTLS recursions. A  remote attacker could use this issue to cause OpenSSL to crash, resulting  in a denial of service. (CVE-2014-0221)    KIKUCHI Masashi discovered that OpenSSL incorrectly handled certain  handshakes. A remote attacker could use this flaw to perform a  machine-in-the-middle attack and possibly decrypt and modify traffic.  (CVE-2014-0224)    Felix Gröbert and Ivan Fratrić discovered that OpenSSL incorrectly handled  anonymous ECDH ciphersuites. A remote attacker could use this issue to  cause OpenSSL to crash, resulting in a denial of service. This issue only  affected Ubuntu 12.04 LTS, Ubuntu 13.10, and Ubuntu 14.04 LTS.  (CVE-2014-3470)  Update Instructions:  Run `sudo pro fix USN-2232-3` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libssl1.0.0 - 1.0.1f-1ubuntu2.4 libssl-dev - 1.0.1f-1ubuntu2.4 openssl - 1.0.1f-1ubuntu2.4 libssl-doc - 1.0.1f-1ubuntu2.4 libcrypto1.0.0-udeb - 1.0.1f-1ubuntu2.4 libssl1.0.0-udeb - 1.0.1f-1ubuntu2.4 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2232-3",
				"ref_url": "https://ubuntu.com/security/notices/USN-2232-3"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2014-06-23"
			},
			"bug": [
				"https://launchpad.net/bugs/1332643"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:223230000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
