{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:29141000000",
	"version": "1",
	"metadata": {
		"title": "USN-2914-1 -- OpenSSL vulnerabilities",
		"description": "Yuval Yarom, Daniel Genkin, and Nadia Heninger discovered that OpenSSL was vulnerable to a side-channel attack on modular exponentiation. On certain CPUs, a local attacker could possibly use this issue to recover RSA keys. This flaw is known as CacheBleed. (CVE-2016-0702)  Adam Langley discovered that OpenSSL incorrectly handled memory when parsing DSA private keys. A remote attacker could use this issue to cause OpenSSL to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2016-0705)  Guido Vranken discovered that OpenSSL incorrectly handled hex digit calculation in the BN_hex2bn function. A remote attacker could use this issue to cause OpenSSL to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2016-0797)  Emilia Käsper discovered that OpenSSL incorrectly handled memory when performing SRP user database lookups. A remote attacker could possibly use this issue to cause OpenSSL to consume memory, resulting in a denial of service. (CVE-2016-0798)  Guido Vranken discovered that OpenSSL incorrectly handled memory when printing very long strings. A remote attacker could use this issue to cause OpenSSL to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2016-0799)  Update Instructions:  Run `sudo pro fix USN-2914-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libssl1.0.0 - 1.0.1f-1ubuntu2.18 libssl-dev - 1.0.1f-1ubuntu2.18 openssl - 1.0.1f-1ubuntu2.18 libssl-doc - 1.0.1f-1ubuntu2.18 libcrypto1.0.0-udeb - 1.0.1f-1ubuntu2.18 libssl1.0.0-udeb - 1.0.1f-1ubuntu2.18 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2914-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2914-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-03-01"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:291410000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
