{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:55231000000",
	"version": "1",
	"metadata": {
		"title": "USN-5523-1 -- LibTIFF vulnerabilities",
		"description": "It was discovered that LibTIFF was not properly performing checks to guarantee that allocated memory space existed, which could lead to a NULL pointer dereference via a specially crafted file. An attacker could possibly use this issue to cause a denial of service. (CVE-2022-0907, CVE-2022-0908)  It was discovered that LibTIFF was not properly performing checks to avoid division calculations where the denominator value was zero, which could lead to an undefined behavior situation via a specially crafted file. An attacker could possibly use this issue to cause a denial of service. (CVE-2022-0909)  It was discovered that LibTIFF was not properly performing bounds checks, which could lead to an out-of-bounds read via a specially crafted file. An attacker could possibly use this issue to cause a denial of service or to expose sensitive information. (CVE-2022-0924)  It was discovered that LibTIFF was not properly performing the calculation of data that would eventually be used as a reference for bounds checking operations, which could lead to an out-of-bounds read via a specially crafted file. An attacker could possibly use this issue to cause a denial of service or to expose sensitive information. (CVE-2020-19131)  It was discovered that LibTIFF was not properly terminating a function execution when processing incorrect data, which could lead to an out-of-bounds read via a specially crafted file. An attacker could possibly use this issue to cause a denial of service or to expose sensitive information. (CVE-2020-19144)  It was discovered that LibTIFF was not properly performing checks when setting the value for data later used as reference during memory access, which could lead to an out-of-bounds read via a specially crafted file. An attacker could possibly use this issue to cause a denial of service or to expose sensitive information. (CVE-2022-22844)  Update Instructions:  Run `sudo pro fix USN-5523-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libtiff-opengl - 4.0.3-7ubuntu0.11+esm2 libtiffxx5 - 4.0.3-7ubuntu0.11+esm2 libtiff5-dev - 4.0.3-7ubuntu0.11+esm2 libtiff4-dev - 4.0.3-7ubuntu0.11+esm2 libtiff5-alt-dev - 4.0.3-7ubuntu0.11+esm2 libtiff5 - 4.0.3-7ubuntu0.11+esm2 libtiff-tools - 4.0.3-7ubuntu0.11+esm2 libtiff-doc - 4.0.3-7ubuntu0.11+esm2 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5523-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5523-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-07-19"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:552310000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
