{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:34241000000",
	"version": "1",
	"metadata": {
		"title": "USN-3424-1 -- libxml2 vulnerabilities",
		"description": "It was discovered that a type confusion error existed in libxml2. An attacker could use this to specially construct XML data that could cause a denial of service or possibly execute arbitrary code. (CVE-2017-0663)  It was discovered that libxml2 did not properly validate parsed entity references. An attacker could use this to specially construct XML data that could expose sensitive information. (CVE-2017-7375)  It was discovered that a buffer overflow existed in libxml2 when handling HTTP redirects. An attacker could use this to specially construct XML data that could cause a denial of service or possibly execute arbitrary code. (CVE-2017-7376)  Marcel Böhme and Van-Thuan Pham discovered a buffer overflow in libxml2 when handling elements. An attacker could use this to specially construct XML data that could cause a denial of service or possibly execute arbitrary code. (CVE-2017-9047)  Marcel Böhme and Van-Thuan Pham discovered a buffer overread in libxml2 when handling elements. An attacker could use this to specially construct XML data that could cause a denial of service. (CVE-2017-9048)  Marcel Böhme and Van-Thuan Pham discovered multiple buffer overreads in libxml2 when handling parameter-entity references. An attacker could use these to specially construct XML data that could cause a denial of service. (CVE-2017-9049, CVE-2017-9050)  Update Instructions:  Run `sudo pro fix USN-3424-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  python-libxml2 - 2.9.1+dfsg1-3ubuntu4.10 libxml2-utils - 2.9.1+dfsg1-3ubuntu4.10 libxml2 - 2.9.1+dfsg1-3ubuntu4.10 libxml2-udeb - 2.9.1+dfsg1-3ubuntu4.10 libxml2-doc - 2.9.1+dfsg1-3ubuntu4.10 libxml2-dev - 2.9.1+dfsg1-3ubuntu4.10 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3424-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3424-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2017-09-19"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:342410000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
