{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:28531000000",
	"version": "1",
	"metadata": {
		"title": "USN-2853-1 -- Linux kernel (Wily HWE) vulnerabilities",
		"description": "Felix Wilhelm discovered a race condition in the Xen paravirtualized drivers which can cause double fetch vulnerabilities. An attacker in the paravirtualized guest could exploit this flaw to cause a denial of service (crash the host) or potentially execute arbitrary code on the host. (CVE-2015-8550)  Konrad Rzeszutek Wilk discovered the Xen PCI backend driver does not perform consistency checks on the device's state. An attacker could exploit this flaw to cause a denial of service (NULL dereference) on the host. (CVE-2015-8551)  Konrad Rzeszutek Wilk discovered the Xen PCI backend driver does not perform consistency checks on the device's state. An attacker could exploit this flaw to cause a denial of service by flooding the logging system with WARN() messages causing the initial domain to exhaust disk space. (CVE-2015-8552)  Jann Horn discovered a ptrace issue with user namespaces in the Linux kernel. The namespace owner could potentially exploit this flaw by ptracing a root owned process entering the user namespace to elevate its privileges and potentially gain access outside of the namespace. (http://bugs.launchpad.net/bugs/1527374, CVE-2015-8709)  Update Instructions:  Run `sudo pro fix USN-2853-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.2.0-22-powerpc64-smp - 4.2.0-22.27~14.04.1 linux-image-4.2.0-22-lowlatency - 4.2.0-22.27~14.04.1 linux-image-4.2.0-22-generic - 4.2.0-22.27~14.04.1 linux-image-4.2.0-22-powerpc-e500mc - 4.2.0-22.27~14.04.1 linux-image-4.2.0-22-powerpc-smp - 4.2.0-22.27~14.04.1 linux-image-4.2.0-22-powerpc64-emb - 4.2.0-22.27~14.04.1 linux-image-extra-4.2.0-22-generic - 4.2.0-22.27~14.04.1 linux-image-4.2.0-22-generic-lpae - 4.2.0-22.27~14.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2853-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2853-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2015-12-20"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:285310000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
