{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:37412000000",
	"version": "1",
	"metadata": {
		"title": "USN-3741-2 -- Linux kernel (Xenial HWE) vulnerabilities",
		"description": "USN-3741-1 fixed vulnerabilities in the Linux kernel for Ubuntu 16.04 LTS. This update provides the corresponding updates for the Linux Hardware Enablement (HWE) kernel from Ubuntu 16.04 LTS for Ubuntu 14.04 LTS.  It was discovered that memory present in the L1 data cache of an Intel CPU core may be exposed to a malicious process that is executing on the CPU core. This vulnerability is also known as L1 Terminal Fault (L1TF). A local attacker in a guest virtual machine could use this to expose sensitive information (memory from other guests or the host OS). (CVE-2018-3646)  It was discovered that memory present in the L1 data cache of an Intel CPU core may be exposed to a malicious process that is executing on the CPU core. This vulnerability is also known as L1 Terminal Fault (L1TF). A local attacker could use this to expose sensitive information (memory from the kernel or other processes). (CVE-2018-3620)  Juha-Matti Tilli discovered that the TCP implementation in the Linux kernel performed algorithmically expensive operations in some situations when handling incoming packets. A remote attacker could use this to cause a denial of service. (CVE-2018-5390)  Juha-Matti Tilli discovered that the IP implementation in the Linux kernel performed algorithmically expensive operations in some situations when handling incoming packet fragments. A remote attacker could use this to cause a denial of service. (CVE-2018-5391)  Update Instructions:  Run `sudo pro fix USN-3741-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.4.0-1027-aws - 4.4.0-1027.30 No subscription required  linux-image-4.4.0-133-powerpc-e500mc - 4.4.0-133.159~14.04.1 linux-image-4.4.0-133-powerpc64-emb - 4.4.0-133.159~14.04.1 linux-image-4.4.0-133-generic - 4.4.0-133.159~14.04.1 linux-image-4.4.0-133-powerpc64-smp - 4.4.0-133.159~14.04.1 linux-image-4.4.0-133-lowlatency - 4.4.0-133.159~14.04.1 linux-image-extra-4.4.0-133-generic - 4.4.0-133.159~14.04.1 linux-image-4.4.0-133-powerpc-smp - 4.4.0-133.159~14.04.1 linux-image-4.4.0-133-generic-lpae - 4.4.0-133.159~14.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3741-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-3741-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2018-08-14"
			},
			"ref": [
				"https://wiki.ubuntu.com/SecurityTeam/KnowledgeBase/L1TF"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:374120000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:374120000010",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
