{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:26301000000",
	"version": "1",
	"metadata": {
		"title": "USN-2630-1 -- QEMU vulnerabilities",
		"description": "Matt Tait discovered that QEMU incorrectly handled the virtual PCNET driver. A malicious guest could use this issue to cause a denial of service, or possibly execute arbitrary code on the host as the user running the QEMU process. In the default installation, when QEMU is used with libvirt, attackers would be isolated by the libvirt AppArmor profile. (CVE-2015-3209)  Kurt Seifried discovered that QEMU incorrectly handled certain temporary files. A local attacker could use this issue to cause a denial of service. (CVE-2015-4037)  Jan Beulich discovered that the QEMU Xen code incorrectly restricted write access to the host MSI message data field. A malicious guest could use this issue to cause a denial of service. This issue only applied to Ubuntu 14.04 LTS, Ubuntu 14.10 and Ubuntu 15.04. (CVE-2015-4103)  Jan Beulich discovered that the QEMU Xen code incorrectly restricted access to the PCI MSI mask bits. A malicious guest could use this issue to cause a denial of service. This issue only applied to Ubuntu 14.04 LTS, Ubuntu 14.10 and Ubuntu 15.04. (CVE-2015-4104)  Jan Beulich discovered that the QEMU Xen code incorrectly handled MSI-X error messages. A malicious guest could use this issue to cause a denial of service. This issue only applied to Ubuntu 14.04 LTS, Ubuntu 14.10 and Ubuntu 15.04. (CVE-2015-4105)  Jan Beulich discovered that the QEMU Xen code incorrectly restricted write access to the PCI config space. A malicious guest could use this issue to cause a denial of service, obtain sensitive information, or possibly execute arbitrary code. This issue only applied to Ubuntu 14.04 LTS, Ubuntu 14.10 and Ubuntu 15.04. (CVE-2015-4106)  Update Instructions:  Run `sudo pro fix USN-2630-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  qemu-system-common - 2.0.0+dfsg-2ubuntu1.13 qemu-user-static - 2.0.0+dfsg-2ubuntu1.13 qemu-system-misc - 2.0.0+dfsg-2ubuntu1.13 qemu - 2.0.0+dfsg-2ubuntu1.13 qemu-kvm - 2.0.0+dfsg-2ubuntu1.13 qemu-user - 2.0.0+dfsg-2ubuntu1.13 qemu-keymaps - 2.0.0+dfsg-2ubuntu1.13 qemu-guest-agent - 2.0.0+dfsg-2ubuntu1.13 qemu-system - 2.0.0+dfsg-2ubuntu1.13 qemu-utils - 2.0.0+dfsg-2ubuntu1.13 qemu-system-aarch64 - 2.0.0+dfsg-2ubuntu1.13 qemu-system-x86 - 2.0.0+dfsg-2ubuntu1.13 qemu-common - 2.0.0+dfsg-2ubuntu1.13 qemu-system-sparc - 2.0.0+dfsg-2ubuntu1.13 qemu-system-arm - 2.0.0+dfsg-2ubuntu1.13 qemu-system-ppc - 2.0.0+dfsg-2ubuntu1.13 qemu-system-mips - 2.0.0+dfsg-2ubuntu1.13 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2630-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2630-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2015-06-10"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:263010000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
