{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:27351000000",
	"version": "1",
	"metadata": {
		"title": "USN-2735-1 -- Oxide vulnerabilities",
		"description": "It was discovered that the DOM tree could be corrupted during parsing in some circumstances. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to bypass same-origin restrictions or cause a denial of service. (CVE-2015-1291)  An issue was discovered in NavigatorServiceWorker::serviceWorker in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to bypass same-origin restrictions. (CVE-2015-1292)  An issue was discovered in the DOM implementation in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to bypass same-origin restrictions. (CVE-2015-1293)  A use-after-free was discovered in Skia. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash, or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2015-1294)  A use-after-free was discovered in the shared-timer implementation in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash, or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2015-1299)  It was discovered that the availability of iframe Resource Timing API times was not properly restricted in some circumstances. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to obtain sensitive information. (CVE-2015-1300)  Multiple security issues were discovered in Chromium. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to read uninitialized memory, cause a denial of service via application crash or execute arbitrary code with the privileges of the user invoking the program. (CVE-2015-1301)  A heap corruption issue was discovered in oxide::JavaScriptDialogManager. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via application crash, or execute arbitrary code with the privileges of the user invoking the program. (CVE-2015-1332)  Update Instructions:  Run `sudo pro fix USN-2735-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  liboxideqtcore0 - 1.9.1-0ubuntu0.14.04.2 liboxideqt-qmlplugin - 1.9.1-0ubuntu0.14.04.2 oxideqt-chromedriver - 1.9.1-0ubuntu0.14.04.2 oxideqt-codecs-extra - 1.9.1-0ubuntu0.14.04.2 oxideqmlscene - 1.9.1-0ubuntu0.14.04.2 oxideqt-codecs - 1.9.1-0ubuntu0.14.04.2 liboxideqtquick0 - 1.9.1-0ubuntu0.14.04.2 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2735-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2735-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2015-09-08"
			},
			"bug": [
				"https://launchpad.net/bugs/1470905"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:273510000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
