{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:32722000000",
	"version": "1",
	"metadata": {
		"title": "USN-3272-2 -- Ghostscript regression",
		"description": "USN-3272-1 fixed vulnerabilities in Ghostscript. This change introduced a regression when the DELAYBIND feature is used with the eqproc command. This update fixes the problem.  We apologize for the inconvenience.  Original advisory details:   It was discovered that Ghostscript improperly handled parameters to  the rsdparams and eqproc commands. An attacker could use these to  craft a malicious document that could disable -dSAFER protections,  thereby allowing the execution of arbitrary code, or cause a denial  of service (application crash). (CVE-2017-8291)   Kamil Frankowicz discovered a use-after-free vulnerability in the  color management module of Ghostscript. An attacker could use this  to cause a denial of service (application crash). (CVE-2016-10217)   Kamil Frankowicz discovered a divide-by-zero error in the scan  conversion code in Ghostscript. An attacker could use this to cause  a denial of service (application crash). (CVE-2016-10219)   Kamil Frankowicz discovered multiple NULL pointer dereference errors in  Ghostscript. An attacker could use these to cause a denial of service  (application crash). (CVE-2016-10220, CVE-2017-5951, CVE-2017-7207)  Update Instructions:  Run `sudo pro fix USN-3272-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  ghostscript - 9.10~dfsg-0ubuntu10.9 ghostscript-x - 9.10~dfsg-0ubuntu10.9 libgs-dev - 9.10~dfsg-0ubuntu10.9 ghostscript-doc - 9.10~dfsg-0ubuntu10.9 libgs9 - 9.10~dfsg-0ubuntu10.9 libgs9-common - 9.10~dfsg-0ubuntu10.9 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3272-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-3272-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2017-05-16"
			},
			"bug": [
				"https://launchpad.net/bugs/1687614"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:327220000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
