{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:36981000000",
	"version": "1",
	"metadata": {
		"title": "USN-3698-1 -- Linux kernel vulnerabilities",
		"description": "It was discovered that the nested KVM implementation in the Linux kernel in some situations did not properly prevent second level guests from reading and writing the hardware CR8 register. A local attacker in a guest could use this to cause a denial of service (system crash). (CVE-2017-12154)  Fan Wu, Haoran Qiu, and Shixiong Zhao discovered that the associative array implementation in the Linux kernel sometimes did not properly handle adding a new entry. A local attacker could use this to cause a denial of service (system crash). (CVE-2017-12193)  It was discovered that a race condition existed in the ALSA subsystem of the Linux kernel when creating and deleting a port via ioctl(). A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-15265)  It was discovered that a null pointer dereference vulnerability existed in the DCCP protocol implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash). (CVE-2018-1130)  Julian Stecklina and Thomas Prescher discovered that FPU register states (such as MMX, SSE, and AVX registers) which are lazily restored are potentially vulnerable to a side channel attack. A local attacker could use this to expose sensitive information. (CVE-2018-3665)  Wang Qize discovered that an information disclosure vulnerability existed in the SMBus driver for ACPI Embedded Controllers in the Linux kernel. A local attacker could use this to expose sensitive information (kernel pointer addresses). (CVE-2018-5750)  It was discovered that the SCTP Protocol implementation in the Linux kernel did not properly validate userspace provided payload lengths in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2018-5803)  It was discovered that an integer overflow error existed in the futex implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash). (CVE-2018-6927)  It was discovered that an information leak vulnerability existed in the floppy driver in the Linux kernel. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2018-7755)  It was discovered that a memory leak existed in the SAS driver subsystem of the Linux kernel. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2018-7757)  Update Instructions:  Run `sudo pro fix USN-3698-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-3.13.0-153-lowlatency - 3.13.0-153.203 linux-image-3.13.0-153-powerpc-e500 - 3.13.0-153.203 linux-image-3.13.0-153-generic - 3.13.0-153.203 linux-image-extra-3.13.0-153-generic - 3.13.0-153.203 linux-image-3.13.0-153-powerpc-smp - 3.13.0-153.203 linux-image-3.13.0-153-powerpc-e500mc - 3.13.0-153.203 linux-image-3.13.0-153-generic-lpae - 3.13.0-153.203 linux-image-3.13.0-153-powerpc64-emb - 3.13.0-153.203 linux-image-3.13.0-153-powerpc64-smp - 3.13.0-153.203 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3698-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3698-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2018-07-02"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:369810000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
