{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:33431000000",
	"version": "1",
	"metadata": {
		"title": "USN-3343-1 -- Linux kernel vulnerabilities",
		"description": "USN 3335-1 fixed a vulnerability in the Linux kernel. However, that fix introduced regressions for some Java applications. This update addresses the issue. We apologize for the inconvenience.  It was discovered that a use-after-free vulnerability in the core voltage regulator driver of the Linux kernel. A local attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2014-9940)  It was discovered that a buffer overflow existed in the trace subsystem in the Linux kernel. A privileged local attacker could use this to execute arbitrary code. (CVE-2017-0605)  Roee Hay discovered that the parallel port printer driver in the Linux kernel did not properly bounds check passed arguments. A local attacker with write access to the kernel command line arguments could use this to execute arbitrary code. (CVE-2017-1000363)  Li Qiang discovered that an integer overflow vulnerability existed in the Direct Rendering Manager (DRM) driver for VMWare devices in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-7294)  It was discovered that a double-free vulnerability existed in the IPv4 stack of the Linux kernel. An attacker could use this to cause a denial of service (system crash). (CVE-2017-8890)  Andrey Konovalov discovered an IPv6 out-of-bounds read error in the Linux kernel's IPv6 stack. A local attacker could cause a denial of service or potentially other unspecified problems. (CVE-2017-9074)  Andrey Konovalov discovered a flaw in the handling of inheritance in the Linux kernel's IPv6 stack. A local user could exploit this issue to cause a denial of service or possibly other unspecified problems. (CVE-2017-9075)  It was discovered that dccp v6 in the Linux kernel mishandled inheritance. A local attacker could exploit this issue to cause a denial of service or potentially other unspecified problems. (CVE-2017-9076)  It was discovered that the transmission control protocol (tcp) v6 in the Linux kernel mishandled inheritance. A local attacker could exploit this issue to cause a denial of service or potentially other unspecified problems. (CVE-2017-9077)  It was discovered that the IPv6 stack in the Linux kernel was performing its over write consistency check after the data was actually overwritten. A local attacker could exploit this flaw to cause a denial of service (system crash). (CVE-2017-9242)  Update Instructions:  Run `sudo pro fix USN-3343-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-3.13.0-123-powerpc-e500 - 3.13.0-123.172 linux-image-extra-3.13.0-123-generic - 3.13.0-123.172 linux-image-3.13.0-123-powerpc64-emb - 3.13.0-123.172 linux-image-3.13.0-123-powerpc-e500mc - 3.13.0-123.172 linux-image-3.13.0-123-generic - 3.13.0-123.172 linux-image-3.13.0-123-lowlatency - 3.13.0-123.172 linux-image-3.13.0-123-powerpc-smp - 3.13.0-123.172 linux-image-3.13.0-123-powerpc64-smp - 3.13.0-123.172 linux-image-3.13.0-123-generic-lpae - 3.13.0-123.172 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3343-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3343-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2017-06-29"
			},
			"bug": [
				"https://launchpad.net/bugs/1699772"
			],
			"ref": [
				"https://www.ubuntu.com/usn/usn-3335-1"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:334310000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
