{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:36852000000",
	"version": "1",
	"metadata": {
		"title": "USN-3685-2 -- Ruby regression",
		"description": "USN-3685-1 fixed a vulnerability in Ruby. The fix for CVE-2017-0903 introduced a regression in Ruby. This update fixes the problem.  Original advisory details:  Some of these CVE were already addressed in previous USN: 3439-1, 3553-1, 3528-1. Here we address for the remain releases.  It was discovered that Ruby incorrectly handled certain inputs. An attacker could use this to cause a buffer overrun. (CVE-2017-0898)  It was discovered that Ruby incorrectly handled certain files. An attacker could use this to overwrite any file on the filesystem. (CVE-2017-0901)  It was discovered that Ruby was vulnerable to a DNS hijacking vulnerability. An attacker could use this to possibly force the RubyGems client to download and install gems from a server that the attacker controls. (CVE-2017-0902)  It was discovered that Ruby incorrectly handled certain YAML files. An attacker could use this to possibly execute arbitrary code. (CVE-2017-0903)  It was discovered that Ruby incorrectly handled certain files. An attacker could use this to expose sensitive information. (CVE-2017-14064)  It was discovered that Ruby incorrectly handled certain inputs. An attacker could use this to execute arbitrary code. (CVE-2017-10784)  It was discovered that Ruby incorrectly handled certain network requests. An attacker could possibly use this to inject a crafted key into a HTTP response. (CVE-2017-17742)  It was discovered that Ruby incorrectly handled certain files. An attacker could possibly use this to execute arbitrary code. This update is only addressed to ruby2.0. (CVE-2018-1000074)  It was discovered that Ruby incorrectly handled certain network requests. An attacker could possibly use this to cause a denial of service. (CVE-2018-8777)  Update Instructions:  Run `sudo pro fix USN-3685-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  ruby2.0-tcltk - 2.0.0.484-1ubuntu2.13+esm1 libruby2.0 - 2.0.0.484-1ubuntu2.13+esm1 ruby2.0-doc - 2.0.0.484-1ubuntu2.13+esm1 ruby2.0 - 2.0.0.484-1ubuntu2.13+esm1 ruby2.0-dev - 2.0.0.484-1ubuntu2.13+esm1 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3685-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-3685-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2021-03-25"
			},
			"bug": [
				"https://bugs.launchpad.net/ubuntu/+source/ruby2.0/+bug/1777174"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:368520000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
