{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:25221000000",
	"version": "1",
	"metadata": {
		"title": "USN-2522-1 -- ICU vulnerabilities",
		"description": "It was discovered that ICU incorrectly handled memory operations when processing fonts. If an application using ICU processed crafted data, an attacker could cause it to crash or potentially execute arbitrary code with the privileges of the user invoking the program. This issue only affected Ubuntu 12.04 LTS. (CVE-2013-1569, CVE-2013-2383, CVE-2013-2384, CVE-2013-2419)  It was discovered that ICU incorrectly handled memory operations when processing fonts. If an application using ICU processed crafted data, an attacker could cause it to crash or potentially execute arbitrary code with the privileges of the user invoking the program. (CVE-2014-6585, CVE-2014-6591)  It was discovered that ICU incorrectly handled memory operations when processing regular expressions. If an application using ICU processed crafted data, an attacker could cause it to crash or potentially execute arbitrary code with the privileges of the user invoking the program. (CVE-2014-7923, CVE-2014-7926, CVE-2014-9654)  It was discovered that ICU collator implementation incorrectly handled memory operations. If an application using ICU processed crafted data, an attacker could cause it to crash or potentially execute arbitrary code with the privileges of the user invoking the program. (CVE-2014-7940)  Update Instructions:  Run `sudo pro fix USN-2522-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  icu-devtools - 52.1-3ubuntu0.2 icu-doc - 52.1-3ubuntu0.2 libicu-dev - 52.1-3ubuntu0.2 libicu52 - 52.1-3ubuntu0.2 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2522-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2522-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2015-03-05"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:252210000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
