{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:37532000000",
	"version": "1",
	"metadata": {
		"title": "USN-3753-2 -- Linux kernel (Xenial HWE) vulnerabilities",
		"description": "USN-3753-1 fixed vulnerabilities in the Linux kernel for Ubuntu 16.04 LTS. This update provides the corresponding updates for the Linux Hardware Enablement (HWE) kernel from Ubuntu 16.04 LTS for Ubuntu 14.04 LTS.  It was discovered that the generic SCSI driver in the Linux kernel did not properly enforce permissions on kernel memory access. A local attacker could use this to expose sensitive information or possibly elevate privileges. (CVE-2017-13168)  Wen Xu discovered that a use-after-free vulnerability existed in the ext4 filesystem implementation in the Linux kernel. An attacker could use this to construct a malicious ext4 image that, when mounted, could cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-10876, CVE-2018-10879)  Wen Xu discovered that a buffer overflow existed in the ext4 filesystem implementation in the Linux kernel. An attacker could use this to construct a malicious ext4 image that, when mounted, could cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-10877)  Wen Xu discovered that an out-of-bounds write vulnerability existed in the ext4 filesystem implementation in the Linux kernel. An attacker could use this to construct a malicious ext4 image that, when mounted, could cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-10878, CVE-2018-10882)  Wen Xu discovered that the ext4 filesystem implementation in the Linux kernel did not properly keep meta-data information consistent in some situations. An attacker could use this to construct a malicious ext4 image that, when mounted, could cause a denial of service (system crash). (CVE-2018-10881)  Shankara Pailoor discovered that the JFS filesystem implementation in the Linux kernel contained a buffer overflow when handling extended attributes. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-12233)  Wen Xu discovered that the XFS filesystem implementation in the Linux kernel did not properly handle an error condition with a corrupted xfs image. An attacker could use this to construct a malicious xfs image that, when mounted, could cause a denial of service (system crash). (CVE-2018-13094)  It was discovered that the Linux kernel did not properly handle setgid file creation when performed by a non-member of the group. A local attacker could use this to gain elevated privileges. (CVE-2018-13405)  Silvio Cesare discovered that the generic VESA frame buffer driver in the Linux kernel contained an integer overflow. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-13406)  Update Instructions:  Run `sudo pro fix USN-3753-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.4.0-1028-aws - 4.4.0-1028.31 No subscription required  linux-image-4.4.0-134-generic-lpae - 4.4.0-134.160~14.04.1 linux-image-4.4.0-134-powerpc-smp - 4.4.0-134.160~14.04.1 linux-image-4.4.0-134-powerpc-e500mc - 4.4.0-134.160~14.04.1 linux-image-4.4.0-134-generic - 4.4.0-134.160~14.04.1 linux-image-extra-4.4.0-134-generic - 4.4.0-134.160~14.04.1 linux-image-4.4.0-134-powerpc64-emb - 4.4.0-134.160~14.04.1 linux-image-4.4.0-134-lowlatency - 4.4.0-134.160~14.04.1 linux-image-4.4.0-134-powerpc64-smp - 4.4.0-134.160~14.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3753-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-3753-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2018-08-24"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:375320000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:375320000010",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
