{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:27781000000",
	"version": "1",
	"metadata": {
		"title": "USN-2778-1 -- Linux kernel (Vivid HWE) vulnerabilities",
		"description": "It was discovered that the Linux kernel did not check if a new IPv6 MTU set by a user space application was valid. A remote attacker could forge a route advertisement with an invalid MTU that a user space daemon like NetworkManager would honor and apply to the kernel, causing a denial of service. (CVE-2015-0272)  It was discovered that virtio networking in the Linux kernel did not handle fragments correctly, leading to kernel memory corruption. A remote attacker could use this to cause a denial of service (system crash) or possibly execute code with administrative privileges. (CVE-2015-5156)  It was discovered that the Reliable Datagram Sockets (RDS) implementation in the Linux kernel did not verify sockets were properly bound before attempting to send a message, which could cause a NULL pointer dereference. An attacker could use this to cause a denial of service (system crash). (CVE-2015-6937)  Ben Hutchings discovered that the Advanced Union Filesystem (aufs) for the Linux kernel did not correctly handle references of memory mapped files from an aufs mount. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code with administrative privileges. (CVE-2015-7312)  Update Instructions:  Run `sudo pro fix USN-2778-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-3.19.0-31-generic - 3.19.0-31.36~14.04.1 linux-image-3.19.0-31-powerpc-e500mc - 3.19.0-31.36~14.04.1 linux-image-3.19.0-31-lowlatency - 3.19.0-31.36~14.04.1 linux-image-3.19.0-31-powerpc-smp - 3.19.0-31.36~14.04.1 linux-image-3.19.0-31-generic-lpae - 3.19.0-31.36~14.04.1 linux-image-extra-3.19.0-31-generic - 3.19.0-31.36~14.04.1 linux-image-3.19.0-31-powerpc64-emb - 3.19.0-31.36~14.04.1 linux-image-3.19.0-31-powerpc64-smp - 3.19.0-31.36~14.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2778-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2778-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2015-10-20"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:277810000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
