{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:38451000000",
	"version": "1",
	"metadata": {
		"title": "USN-3845-1 -- FreeRDP vulnerabilities",
		"description": "Eyal Itkin discovered FreeRDP incorrectly handled certain stream encodings.  A malicious server could use this issue to cause FreeRDP to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only applies to Ubuntu 18.04 LTS and Ubuntu 18.10. (CVE-2018-8784, CVE-2018-8785)  Eyal Itkin discovered FreeRDP incorrectly handled bitmaps.  A malicious server could use this issue to cause FreeRDP to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2018-8786, CVE-2018-8787)  Eyal Itkin discovered FreeRDP incorrectly handled certain stream encodings.  A malicious server could use this issue to cause FreeRDP to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only applies to Ubuntu 16.04 LTS, Ubuntu 18.04 LTS and Ubuntu 18.10. (CVE-2018-8788)  Eyal Itkin discovered FreeRDP incorrectly handled NTLM authentication.  A malicious server could use this issue to cause FreeRDP to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only applies to Ubuntu 16.04 LTS, Ubuntu 18.04 LTS and Ubuntu 18.10. (CVE-2018-8789)  Update Instructions:  Run `sudo pro fix USN-3845-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libfreerdp1 - 1.0.2-2ubuntu1.2 libfreerdp-plugins-standard - 1.0.2-2ubuntu1.2 freerdp-x11 - 1.0.2-2ubuntu1.2 libfreerdp-dev - 1.0.2-2ubuntu1.2 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3845-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3845-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2018-12-12"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:384510000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
