{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:46282000000",
	"version": "1",
	"metadata": {
		"title": "USN-4628-2 -- Intel Microcode regression",
		"description": "USN-4628-1 provided updated Intel Processor Microcode. Unfortunately, that update prevented certain processors in the Intel Tiger Lake family from booting successfully. This update reverts the microcode update for the Tiger Lake processor family.  Please note that the 'dis_ucode_ldr' kernel command line option can be added in the boot menu to disable microcode loading for system recovery.  We apologize for the inconvenience.  Original advisory details:   Moritz Lipp, Michael Schwarz, Andreas Kogler, David Oswald, Catherine  Easdon, Claudio Canella, and Daniel Gruss discovered that the Intel Running  Average Power Limit (RAPL) feature of some Intel processors allowed a side-  channel attack based on power consumption measurements. A local attacker  could possibly use this to expose sensitive information. (CVE-2020-8695)    Ezra Caltum, Joseph Nuzman, Nir Shildan and Ofir Joseff discovered that  some Intel(R) Processors did not properly remove sensitive information  before storage or transfer in some situations. A local attacker could  possibly use this to expose sensitive information. (CVE-2020-8696)    Ezra Caltum, Joseph Nuzman, Nir Shildan and Ofir Joseff discovered that  some Intel(R) Processors did not properly isolate shared resources in some  situations. A local attacker could possibly use this to expose sensitive  information. (CVE-2020-8698)  Update Instructions:  Run `sudo pro fix USN-4628-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  intel-microcode - 3.20201110.0ubuntu0.14.04.2 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4628-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-4628-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-11-12"
			},
			"bug": [
				"https://launchpad.net/bugs/1903883"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:462820000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
