{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:60131000000",
	"version": "1",
	"metadata": {
		"title": "USN-6013-1 -- Linux kernel (AWS) vulnerabilities",
		"description": "Xuewei Feng, Chuanpu Fu, Qi Li, Kun Sun, and Ke Xu discovered that the TCP implementation in the Linux kernel did not properly handle IPID assignment. A remote attacker could use this to cause a denial of service (connection termination) or inject forged data. (CVE-2020-36516)  Ke Sun, Alyssa Milburn, Henrique Kawakami, Emma Benoit, Igor Chervatyuk, Lisa Aichele, and Thais Moreira Hamasaki discovered that the Spectre Variant 2 mitigations for AMD processors on Linux were insufficient in some situations. A local attacker could possibly use this to expose sensitive information. (CVE-2021-26401)  Jürgen Groß discovered that the Xen subsystem within the Linux kernel did not adequately limit the number of events driver domains (unprivileged PV backends) could send to other guest VMs. An attacker in a driver domain could use this to cause a denial of service in other guest VMs. (CVE-2021-28712, CVE-2021-28713)  Wolfgang Frisch discovered that the ext4 file system implementation in the Linux kernel contained an integer overflow when handling metadata inode extents. An attacker could use this to construct a malicious ext4 file system image that, when mounted, could cause a denial of service (system crash). (CVE-2021-3428)  It was discovered that the IEEE 802.15.4 wireless network subsystem in the Linux kernel did not properly handle certain error conditions, leading to a null pointer dereference vulnerability. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2021-3659)  It was discovered that the System V IPC implementation in the Linux kernel did not properly handle large shared memory counts. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2021-3669)  Alois Wohlschlager discovered that the overlay file system in the Linux kernel did not restrict private clones in some situations. An attacker could use this to expose sensitive information. (CVE-2021-3732)  It was discovered that the SCTP protocol implementation in the Linux kernel did not properly verify VTAGs in some situations. A remote attacker could possibly use this to cause a denial of service (connection disassociation). (CVE-2021-3772)  It was discovered that the btrfs file system implementation in the Linux kernel did not properly handle locking in certain error conditions. A local attacker could use this to cause a denial of service (kernel deadlock). (CVE-2021-4149)  Jann Horn discovered that the socket subsystem in the Linux kernel contained a race condition when handling listen() and connect() operations, leading to a read-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2021-4203)  It was discovered that the file system quotas implementation in the Linux kernel did not properly validate the quota block number. An attacker could use this to construct a malicious file system image that, when mounted and operated on, could cause a denial of service (system crash). (CVE-2021-45868)  Zhihua Yao discovered that the MOXART SD/MMC driver in the Linux kernel did not properly handle device removal, leading to a use-after-free vulnerability. A physically proximate attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-0487)  It was discovered that the block layer subsystem in the Linux kernel did not properly initialize memory in some situations. A privileged local attacker could use this to expose sensitive information (kernel memory). (CVE-2022-0494)  It was discovered that the UDF file system implementation in the Linux kernel could attempt to dereference a null pointer in some situations. An attacker could use this to construct a malicious UDF image that, when mounted and operated on, could cause a denial of service (system crash). (CVE-2022-0617)  David Bouman discovered that the netfilter subsystem in the Linux kernel did not initialize memory in some situations. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2022-1016)  It was discovered that the implementation of the 6pack and mkiss protocols in the Linux kernel did not handle detach events properly in some situations, leading to a use-after-free vulnerability. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-1195)  Duoming Zhou discovered race conditions in the AX.25 amateur radio protocol implementation in the Linux kernel, leading to use-after-free vulnerabilities. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-1205)  It was discovered that the tty subsystem in the Linux kernel contained a race condition in certain situations, leading to an out-of-bounds read vulnerability. A local attacker could possibly use this to cause a denial of service (system crash) or expose sensitive information. (CVE-2022-1462)  It was discovered that the implementation of X.25 network protocols in the Linux kernel did not terminate link layer sessions properly. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-1516)  Duoming Zhou discovered a race condition in the NFC subsystem in the Linux kernel, leading to a use-after-free vulnerability. A privileged local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-1974)  Duoming Zhou discovered that the NFC subsystem in the Linux kernel did not properly prevent context switches from occurring during certain atomic context operations. A privileged local attacker could use this to cause a denial of service (system crash). (CVE-2022-1975)  It was discovered that the HID subsystem in the Linux kernel did not properly validate inputs in certain conditions. A local attacker with physical access could plug in a specially crafted USB device to expose sensitive information. (CVE-2022-20132)  It was discovered that the device-mapper verity (dm-verity) driver in the Linux kernel did not properly verify targets being loaded into the device- mapper table. A privileged attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-20572, CVE-2022-2503)  Duoming Zhou discovered that race conditions existed in the timer handling implementation of the Linux kernel's Rose X.25 protocol layer, resulting in use-after-free vulnerabilities. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-2318)  Zheyu Ma discovered that the Silicon Motion SM712 framebuffer driver in the Linux kernel did not properly handle very small reads. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-2380)  David Leadbeater discovered that the netfilter IRC protocol tracking implementation in the Linux Kernel incorrectly handled certain message payloads in some situations. A remote attacker could possibly use this to cause a denial of service or bypass firewall filtering. (CVE-2022-2663)  Lucas Leong discovered that the LightNVM subsystem in the Linux kernel did not properly handle data lengths in certain situations. A privileged attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-2991)  It was discovered that the Intel 740 frame buffer driver in the Linux kernel contained a divide by zero vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-3061)  Jiasheng Jiang discovered that the wm8350 charger driver in the Linux kernel did not properly deallocate memory, leading to a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-3111)  It was discovered that the sound subsystem in the Linux kernel contained a race condition in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-3303)  It was discovered that the Broadcom FullMAC USB WiFi driver in the Linux kernel did not properly perform bounds checking in some situations. A physically proximate attacker could use this to craft a malicious USB device that when inserted, could cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3628)  Ziming Zhang discovered that the VMware Virtual GPU DRM driver in the Linux kernel contained an out-of-bounds write vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-36280)  It was discovered that the NILFS2 file system implementation in the Linux kernel did not properly deallocate memory in certain error conditions. An attacker could use this to cause a denial of service (memory exhaustion). (CVE-2022-3646)  It was discovered that the Netlink Transformation (XFRM) subsystem in the Linux kernel contained a reference counting error. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-36879)  It was discovered that the infrared transceiver USB driver did not properly handle USB control messages. A local attacker with physical access could plug in a specially crafted USB device to cause a denial of service (memory exhaustion). (CVE-2022-3903)  Jann Horn discovered a race condition existed in the Linux kernel when unmapping VMAs in certain situations, resulting in possible use-after-free vulnerabilities. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-39188)  Hyunwoo Kim discovered that the DVB Core driver in the Linux kernel did not properly perform reference counting in some situations, leading to a use- after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-41218)  It was discovered that a race condition existed in the SMSC UFX USB driver implementation in the Linux kernel, leading to a use-after-free vulnerability. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-41849)  It was discovered that a race condition existed in the Roccat HID driver in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-41850)  It was discovered that the USB core subsystem in the Linux kernel did not properly handle nested reset events. A local attacker with physical access could plug in a specially crafted USB device to cause a denial of service (kernel deadlock). (CVE-2022-4662)  It was discovered that the network queuing discipline implementation in the Linux kernel contained a null pointer dereference in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-47929)  Kyle Zeng discovered that the IPv6 implementation in the Linux kernel contained a NULL pointer dereference vulnerability in certain situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-0394)  It was discovered that a memory leak existed in the SCTP protocol implementation in the Linux kernel. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2023-1074)  Mingi Cho discovered that the netfilter subsystem in the Linux kernel did not properly initialize a data structure, leading to a null pointer dereference vulnerability. An attacker could use this to cause a denial of service (system crash). (CVE-2023-1095)  Kyle Zeng discovered that the ATM VC queuing discipline implementation in the Linux kernel contained a type confusion vulnerability in some situations. An attacker could use this to cause a denial of service (system crash). (CVE-2023-23455)  Lianhui Tang discovered that the MPLS implementation in the Linux kernel did not properly handle certain sysctl allocation failure conditions, leading to a double-free vulnerability. An attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2023-26545)  It was discovered that the NTFS file system implementation in the Linux kernel did not properly validate attributes in certain situations, leading to an out-of-bounds read vulnerability. A local attacker could possibly use this to expose sensitive information (kernel memory). (CVE-2023-26607)  Duoming Zhou discovered that a race condition existed in the infrared receiver/transceiver driver in the Linux kernel, leading to a use-after- free vulnerability. A privileged attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-1118)  Update Instructions:  Run `sudo pro fix USN-6013-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-tools-4.4.0-1117-aws - 4.4.0-1117.123 linux-buildinfo-4.4.0-1117-aws - 4.4.0-1117.123 linux-cloud-tools-4.4.0-1117-aws - 4.4.0-1117.123 linux-aws-tools-4.4.0-1117 - 4.4.0-1117.123 linux-aws-headers-4.4.0-1117 - 4.4.0-1117.123 linux-headers-4.4.0-1117-aws - 4.4.0-1117.123 linux-modules-4.4.0-1117-aws - 4.4.0-1117.123 linux-aws-cloud-tools-4.4.0-1117 - 4.4.0-1117.123 linux-image-4.4.0-1117-aws - 4.4.0-1117.123 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro  linux-tools-aws - 4.4.0.1117.114 linux-headers-aws - 4.4.0.1117.114 linux-image-aws - 4.4.0.1117.114 linux-aws - 4.4.0.1117.114 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6013-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6013-1"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2020-36516",
				"ref_url": "https://ubuntu.com/security/CVE-2020-36516"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2021-26401",
				"ref_url": "https://ubuntu.com/security/CVE-2021-26401"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2021-28712",
				"ref_url": "https://ubuntu.com/security/CVE-2021-28712"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2021-28713",
				"ref_url": "https://ubuntu.com/security/CVE-2021-28713"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2021-3428",
				"ref_url": "https://ubuntu.com/security/CVE-2021-3428"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2021-3659",
				"ref_url": "https://ubuntu.com/security/CVE-2021-3659"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2021-3669",
				"ref_url": "https://ubuntu.com/security/CVE-2021-3669"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2021-3732",
				"ref_url": "https://ubuntu.com/security/CVE-2021-3732"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2021-3772",
				"ref_url": "https://ubuntu.com/security/CVE-2021-3772"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2021-4149",
				"ref_url": "https://ubuntu.com/security/CVE-2021-4149"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2021-4203",
				"ref_url": "https://ubuntu.com/security/CVE-2021-4203"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2021-45868",
				"ref_url": "https://ubuntu.com/security/CVE-2021-45868"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-0487",
				"ref_url": "https://ubuntu.com/security/CVE-2022-0487"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-0494",
				"ref_url": "https://ubuntu.com/security/CVE-2022-0494"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-0617",
				"ref_url": "https://ubuntu.com/security/CVE-2022-0617"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-1016",
				"ref_url": "https://ubuntu.com/security/CVE-2022-1016"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-1195",
				"ref_url": "https://ubuntu.com/security/CVE-2022-1195"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-1205",
				"ref_url": "https://ubuntu.com/security/CVE-2022-1205"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-1462",
				"ref_url": "https://ubuntu.com/security/CVE-2022-1462"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-1516",
				"ref_url": "https://ubuntu.com/security/CVE-2022-1516"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-1974",
				"ref_url": "https://ubuntu.com/security/CVE-2022-1974"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-1975",
				"ref_url": "https://ubuntu.com/security/CVE-2022-1975"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-20132",
				"ref_url": "https://ubuntu.com/security/CVE-2022-20132"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-20572",
				"ref_url": "https://ubuntu.com/security/CVE-2022-20572"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-2318",
				"ref_url": "https://ubuntu.com/security/CVE-2022-2318"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-2380",
				"ref_url": "https://ubuntu.com/security/CVE-2022-2380"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-2503",
				"ref_url": "https://ubuntu.com/security/CVE-2022-2503"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-2663",
				"ref_url": "https://ubuntu.com/security/CVE-2022-2663"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-2991",
				"ref_url": "https://ubuntu.com/security/CVE-2022-2991"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-3061",
				"ref_url": "https://ubuntu.com/security/CVE-2022-3061"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-3111",
				"ref_url": "https://ubuntu.com/security/CVE-2022-3111"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-3303",
				"ref_url": "https://ubuntu.com/security/CVE-2022-3303"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-3628",
				"ref_url": "https://ubuntu.com/security/CVE-2022-3628"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-36280",
				"ref_url": "https://ubuntu.com/security/CVE-2022-36280"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-3646",
				"ref_url": "https://ubuntu.com/security/CVE-2022-3646"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-36879",
				"ref_url": "https://ubuntu.com/security/CVE-2022-36879"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-3903",
				"ref_url": "https://ubuntu.com/security/CVE-2022-3903"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-39188",
				"ref_url": "https://ubuntu.com/security/CVE-2022-39188"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-41218",
				"ref_url": "https://ubuntu.com/security/CVE-2022-41218"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-41849",
				"ref_url": "https://ubuntu.com/security/CVE-2022-41849"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-41850",
				"ref_url": "https://ubuntu.com/security/CVE-2022-41850"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-4662",
				"ref_url": "https://ubuntu.com/security/CVE-2022-4662"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2022-47929",
				"ref_url": "https://ubuntu.com/security/CVE-2022-47929"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2023-0394",
				"ref_url": "https://ubuntu.com/security/CVE-2023-0394"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2023-1074",
				"ref_url": "https://ubuntu.com/security/CVE-2023-1074"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2023-1095",
				"ref_url": "https://ubuntu.com/security/CVE-2023-1095"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2023-1118",
				"ref_url": "https://ubuntu.com/security/CVE-2023-1118"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2023-23455",
				"ref_url": "https://ubuntu.com/security/CVE-2023-23455"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2023-26545",
				"ref_url": "https://ubuntu.com/security/CVE-2023-26545"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2023-26607",
				"ref_url": "https://ubuntu.com/security/CVE-2023-26607"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "Medium",
			"issued": {
				"date": "2023-04-12"
			},
			"cve": [
				{
					"text": "CVE-2020-36516",
					"href": "https://ubuntu.com/security/CVE-2020-36516",
					"priority": "medium",
					"public": "20220226",
					"cvss_score": "5.9",
					"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:N/I:H/A:L",
					"cvss_severity": "medium",
					"usns": "6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2021-26401",
					"href": "https://ubuntu.com/security/CVE-2021-26401",
					"priority": "medium",
					"public": "20220311",
					"cvss_score": "5.6",
					"cvss_vector": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:C/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "5415-1,5417-1,5418-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2021-28712",
					"href": "https://ubuntu.com/security/CVE-2021-28712",
					"priority": "low",
					"public": "20220105",
					"cvss_score": "6.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5298-1,5337-1,5338-1,5368-1,5377-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2021-28713",
					"href": "https://ubuntu.com/security/CVE-2021-28713",
					"priority": "low",
					"public": "20220105",
					"cvss_score": "6.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5278-1,5298-1,5337-1,5338-1,5368-1,5377-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2021-3428",
					"href": "https://ubuntu.com/security/CVE-2021-3428",
					"priority": "low",
					"public": "20210315",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "4979-1,5137-1,5137-2,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2021-3659",
					"href": "https://ubuntu.com/security/CVE-2021-3659",
					"priority": "medium",
					"public": "20220822",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2021-3669",
					"href": "https://ubuntu.com/security/CVE-2021-3669",
					"priority": "low",
					"public": "20220826",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5924-1,5927-1,5975-1,5980-1,5981-1,5984-1,5985-1,5991-1,6001-1,6009-1,6013-1,6014-1,6020-1,6030-1,6151-1"
				},
				{
					"text": "CVE-2021-3732",
					"href": "https://ubuntu.com/security/CVE-2021-3732",
					"priority": "medium",
					"public": "20210827",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "5094-1,5096-1,5094-2,5113-1,5115-1,5116-1,5116-2,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2021-3772",
					"href": "https://ubuntu.com/security/CVE-2021-3772",
					"priority": "low",
					"public": "20210909",
					"cvss_score": "6.5",
					"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:L/A:H",
					"cvss_severity": "medium",
					"usns": "5165-1,5265-1,5466-1,5467-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2021-4149",
					"href": "https://ubuntu.com/security/CVE-2021-4149",
					"priority": "medium",
					"public": "20220323",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5466-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2021-4203",
					"href": "https://ubuntu.com/security/CVE-2021-4203",
					"priority": "medium",
					"public": "20220325",
					"cvss_score": "6.8",
					"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2021-45868",
					"href": "https://ubuntu.com/security/CVE-2021-45868",
					"priority": "medium",
					"public": "20220318",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-0487",
					"href": "https://ubuntu.com/security/CVE-2022-0487",
					"priority": "medium",
					"public": "20220204",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-0494",
					"href": "https://ubuntu.com/security/CVE-2022-0494",
					"priority": "low",
					"public": "20220325",
					"cvss_score": "4.4",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "5381-1,5560-1,5560-2,5562-1,5582-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-0617",
					"href": "https://ubuntu.com/security/CVE-2022-0617",
					"priority": "low",
					"public": "20220216",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5383-1,5384-1,5385-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-1016",
					"href": "https://ubuntu.com/security/CVE-2022-1016",
					"priority": "medium",
					"public": "20220328",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "5381-1,5383-1,5390-1,5390-2,5415-1,5466-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-1195",
					"href": "https://ubuntu.com/security/CVE-2022-1195",
					"priority": "low",
					"public": "20220429",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5469-1,5514-1,5539-1,5560-1,5560-2,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-1205",
					"href": "https://ubuntu.com/security/CVE-2022-1205",
					"priority": "medium",
					"public": "20220402",
					"cvss_score": "4.7",
					"cvss_vector": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5469-1,5471-1,5514-1,5515-1,5539-1,5541-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-1462",
					"href": "https://ubuntu.com/security/CVE-2022-1462",
					"priority": "medium",
					"public": "20220602",
					"cvss_score": "6.3",
					"cvss_vector": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-1516",
					"href": "https://ubuntu.com/security/CVE-2022-1516",
					"priority": "medium",
					"public": "20220505",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5416-1,5467-1,5469-1,5515-1,5541-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-1974",
					"href": "https://ubuntu.com/security/CVE-2022-1974",
					"priority": "low",
					"public": "20220606",
					"cvss_score": "4.1",
					"cvss_vector": "CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "5518-1,5560-1,5560-2,5562-1,5564-1,5582-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-1975",
					"href": "https://ubuntu.com/security/CVE-2022-1975",
					"priority": "low",
					"public": "20220606",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5518-1,5560-1,5560-2,5562-1,5564-1,5582-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-20132",
					"href": "https://ubuntu.com/security/CVE-2022-20132",
					"priority": "low",
					"public": "20220615",
					"cvss_score": "4.6",
					"cvss_vector": "CVSS:3.1/AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N",
					"cvss_severity": "medium",
					"usns": "6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-20572",
					"href": "https://ubuntu.com/security/CVE-2022-20572",
					"priority": "medium",
					"public": "20221216",
					"cvss_score": "6.7",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-2318",
					"href": "https://ubuntu.com/security/CVE-2022-2318",
					"priority": "medium",
					"public": "20220706",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5623-1,5624-1,5633-1,5635-1,5640-1,5644-1,5648-1,5655-1,5668-1,5669-1,5669-2,5677-1,5678-1,5679-1,5682-1,5683-1,5684-1,5687-1,5693-1,5695-1,5706-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-2380",
					"href": "https://ubuntu.com/security/CVE-2022-2380",
					"priority": "low",
					"public": "20220712",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5515-1,5541-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-2503",
					"href": "https://ubuntu.com/security/CVE-2022-2503",
					"priority": "medium",
					"public": "20220812",
					"cvss_score": "6.7",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "5594-1,5599-1,5602-1,5616-1,5622-1,5623-1,5630-1,5639-1,5647-1,5654-1,5660-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-2663",
					"href": "https://ubuntu.com/security/CVE-2022-2663",
					"priority": "medium",
					"public": "20220901",
					"cvss_score": "5.3",
					"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N",
					"cvss_severity": "medium",
					"usns": "5791-1,5792-1,5793-1,5791-2,5792-2,5793-2,5791-3,5793-3,5793-4,5815-1,5854-1,5861-1,5862-1,5865-1,5877-1,5883-1,5924-1,5975-1,6001-1,6007-1,6013-1,6014-1,6247-1"
				},
				{
					"text": "CVE-2022-2991",
					"href": "https://ubuntu.com/security/CVE-2022-2991",
					"priority": "medium",
					"public": "20220825",
					"cvss_score": "6.7",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-3061",
					"href": "https://ubuntu.com/security/CVE-2022-3061",
					"priority": "medium",
					"public": "20220901",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5790-1,5791-1,5792-1,5791-2,5792-2,5791-3,5815-1,5877-1,5976-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-3111",
					"href": "https://ubuntu.com/security/CVE-2022-3111",
					"priority": "medium",
					"public": "20221214",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-3303",
					"href": "https://ubuntu.com/security/CVE-2022-3303",
					"priority": "medium",
					"public": "20220927",
					"cvss_score": "4.7",
					"cvss_vector": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5791-1,5792-1,5793-1,5791-2,5792-2,5793-2,5791-3,5793-3,5793-4,5815-1,5877-1,6001-1,6013-1,6014-1,6071-1,6252-1"
				},
				{
					"text": "CVE-2022-3628",
					"href": "https://ubuntu.com/security/CVE-2022-3628",
					"priority": "medium",
					"public": "20221031",
					"cvss_score": "6.6",
					"cvss_vector": "CVSS:3.1/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "medium",
					"usns": "5780-1,5850-1,5851-1,5853-1,5860-1,5874-1,5875-1,5876-1,5877-1,5878-1,5879-1,5883-1,5909-1,5918-1,5919-1,5920-1,5924-1,5925-1,5927-1,5975-1,5976-1,6001-1,6007-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-36280",
					"href": "https://ubuntu.com/security/CVE-2022-36280",
					"priority": "medium",
					"public": "20220909",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5915-1,5917-1,5924-1,5927-1,5934-1,5939-1,5940-1,5951-1,5975-1,5976-1,5981-1,5982-1,5984-1,5987-1,5991-1,6000-1,6001-1,6004-1,6009-1,6013-1,6014-1,6030-1,6032-1,6079-1,6091-1,6096-1"
				},
				{
					"text": "CVE-2022-3646",
					"href": "https://ubuntu.com/security/CVE-2022-3646",
					"priority": "medium",
					"public": "20221021",
					"cvss_score": "4.3",
					"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:L",
					"cvss_severity": "medium",
					"usns": "5791-1,5792-1,5793-1,5791-2,5792-2,5793-2,5791-3,5793-3,5793-4,5815-1,5854-1,5861-1,5862-1,5865-1,5877-1,5883-1,5919-1,5924-1,5975-1,5976-1,6001-1,6007-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-36879",
					"href": "https://ubuntu.com/security/CVE-2022-36879",
					"priority": "medium",
					"public": "20220727",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5667-1,5668-1,5677-1,5682-1,5683-1,5703-1,5706-1,5727-1,5727-2,5774-1,5913-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-3903",
					"href": "https://ubuntu.com/security/CVE-2022-3903",
					"priority": "low",
					"public": "20221114",
					"cvss_score": "4.6",
					"cvss_vector": "CVSS:3.1/AV:P/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "6001-1,6013-1,6014-1,6027-1,6029-1,6030-1,6031-1,6093-1,6222-1,6256-1"
				},
				{
					"text": "CVE-2022-39188",
					"href": "https://ubuntu.com/security/CVE-2022-39188",
					"priority": "medium",
					"public": "20220902",
					"cvss_score": "4.7",
					"cvss_vector": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5790-1,5792-1,5792-2,5877-1,5791-1,5791-2,5791-3,5815-1,6001-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-41218",
					"href": "https://ubuntu.com/security/CVE-2022-41218",
					"priority": "low",
					"public": "20220921",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5915-1,5917-1,5924-1,5927-1,5934-1,5939-1,5940-1,5951-1,5975-1,5981-1,5982-1,5984-1,5987-1,5991-1,6000-1,6001-1,6004-1,6009-1,6013-1,6014-1,6024-1,6030-1"
				},
				{
					"text": "CVE-2022-41849",
					"href": "https://ubuntu.com/security/CVE-2022-41849",
					"priority": "low",
					"public": "20220930",
					"cvss_score": "4.2",
					"cvss_vector": "CVSS:3.1/AV:P/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5793-1,5793-2,5793-3,5793-4,5851-1,5853-1,5854-1,5860-1,5861-1,5862-1,5865-1,5874-1,5875-1,5876-1,5877-1,5883-1,5909-1,5918-1,5924-1,5975-1,6001-1,6007-1,6013-1,6014-1,6031-1"
				},
				{
					"text": "CVE-2022-41850",
					"href": "https://ubuntu.com/security/CVE-2022-41850",
					"priority": "low",
					"public": "20220930",
					"cvss_score": "4.7",
					"cvss_vector": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5793-1,5793-2,5793-3,5793-4,5851-1,5853-1,5854-1,5860-1,5861-1,5862-1,5865-1,5874-1,5875-1,5876-1,5877-1,5883-1,5909-1,5918-1,5924-1,5975-1,5976-1,6001-1,6007-1,6013-1,6014-1"
				},
				{
					"text": "CVE-2022-4662",
					"href": "https://ubuntu.com/security/CVE-2022-4662",
					"priority": "low",
					"public": "20221222",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5877-1,6001-1,6013-1,6014-1,6071-1"
				},
				{
					"text": "CVE-2022-47929",
					"href": "https://ubuntu.com/security/CVE-2022-47929",
					"priority": "medium",
					"public": "20230117",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5915-1,5917-1,5924-1,5927-1,5934-1,5939-1,5940-1,5951-1,5975-1,5981-1,5984-1,5991-1,6000-1,6001-1,6009-1,6013-1,6014-1,6024-1,6025-1,6030-1,6040-1,6057-1,6134-1,6247-1,6248-1"
				},
				{
					"text": "CVE-2023-0394",
					"href": "https://ubuntu.com/security/CVE-2023-0394",
					"priority": "medium",
					"public": "20230126",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5917-1,5924-1,5927-1,5934-1,5939-1,5940-1,5951-1,5975-1,5976-1,5978-1,5981-1,5984-1,5991-1,6000-1,6001-1,6009-1,6013-1,6014-1,6025-1,6030-1,6040-1,6057-1,6079-1,6091-1,6096-1,6134-1"
				},
				{
					"text": "CVE-2023-1074",
					"href": "https://ubuntu.com/security/CVE-2023-1074",
					"priority": "medium",
					"public": "20230228",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5978-1,6001-1,6013-1,6014-1,6025-1,6027-1,6029-1,6030-1,6031-1,6032-1,6040-1,6057-1,6079-1,6091-1,6093-1,6096-1,6134-1,6222-1,6256-1"
				},
				{
					"text": "CVE-2023-1095",
					"href": "https://ubuntu.com/security/CVE-2023-1095",
					"priority": "medium",
					"public": "20230228",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "6001-1,6013-1,6014-1,6031-1"
				},
				{
					"text": "CVE-2023-1118",
					"href": "https://ubuntu.com/security/CVE-2023-1118",
					"priority": "negligible",
					"public": "20230302",
					"cvss_score": "7.8",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cvss_severity": "high",
					"usns": "6001-1,6013-1,6014-1,6031-1,6032-1,6033-1,6079-1,6080-1,6081-1,6084-1,6085-1,6090-1,6091-1,6092-1,6094-1,6095-1,6096-1,6109-1,6118-1,6132-1,6133-1,6134-1,6222-1,6256-1"
				},
				{
					"text": "CVE-2023-23455",
					"href": "https://ubuntu.com/security/CVE-2023-23455",
					"priority": "medium",
					"public": "20230112",
					"cvss_score": "5.5",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5915-1,5917-1,5924-1,5927-1,5934-1,5939-1,5940-1,5951-1,5975-1,5981-1,5982-1,5984-1,5987-1,5991-1,6000-1,6001-1,6004-1,6009-1,6013-1,6014-1,6030-1,6071-1,6072-1,6079-1,6091-1,6096-1"
				},
				{
					"text": "CVE-2023-26545",
					"href": "https://ubuntu.com/security/CVE-2023-26545",
					"priority": "medium",
					"public": "20230225",
					"cvss_score": "4.7",
					"cvss_vector": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H",
					"cvss_severity": "medium",
					"usns": "5978-1,6001-1,6013-1,6014-1,6024-1,6025-1,6027-1,6029-1,6030-1,6040-1,6057-1,6071-1,6072-1,6093-1,6134-1,6222-1,6256-1"
				},
				{
					"text": "CVE-2023-26607",
					"href": "https://ubuntu.com/security/CVE-2023-26607",
					"priority": "low",
					"public": "20230226",
					"cvss_score": "7.1",
					"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:H",
					"cvss_severity": "high",
					"usns": "5975-1,6000-1,6001-1,6007-1,6013-1,6014-1,6031-1,6032-1"
				}
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:601310000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
