{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:28432000000",
	"version": "1",
	"metadata": {
		"title": "USN-2843-2 -- Linux kernel (Wily HWE) vulnerabilities",
		"description": "Jan Beulich discovered that the KVM svm hypervisor implementation in the Linux kernel did not properly catch Debug exceptions on AMD processors. An attacker in a guest virtual machine could use this to cause a denial of service (system crash) in the host OS. (CVE-2015-8104)  郭永刚 discovered that the ppp implementation in the Linux kernel did not ensure that certain slot numbers are valid. A local attacker with the privilege to call ioctl() on /dev/ppp could cause a denial of service (system crash). (CVE-2015-7799)  Dmitry Vyukov discovered that the Linux kernel's keyring handler attempted to garbage collect incompletely instantiated keys. A local unprivileged attacker could use this to cause a denial of service (system crash). (CVE-2015-7872)  It was discovered that the virtual video osd test driver in the Linux kernel did not properly initialize data structures. A local attacker could use this to obtain sensitive information from the kernel. (CVE-2015-7884)  It was discovered that the driver for Digi Neo and ClassicBoard devices did not properly initialize data structures. A local attacker could use this to obtain sensitive information from the kernel. (CVE-2015-7885)  Update Instructions:  Run `sudo pro fix USN-2843-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.2.0-21-powerpc64-emb - 4.2.0-21.25~14.04.1 linux-image-4.2.0-21-powerpc-smp - 4.2.0-21.25~14.04.1 linux-image-4.2.0-21-lowlatency - 4.2.0-21.25~14.04.1 linux-image-4.2.0-21-generic-lpae - 4.2.0-21.25~14.04.1 linux-image-4.2.0-21-generic - 4.2.0-21.25~14.04.1 linux-image-4.2.0-21-powerpc-e500mc - 4.2.0-21.25~14.04.1 linux-image-extra-4.2.0-21-generic - 4.2.0-21.25~14.04.1 linux-image-4.2.0-21-powerpc64-smp - 4.2.0-21.25~14.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2843-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-2843-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2015-12-17"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:284320000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
