{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:28341000000",
	"version": "1",
	"metadata": {
		"title": "USN-2834-1 -- libxml2 vulnerabilities",
		"description": "Kostya Serebryany discovered that libxml2 incorrectly handled certain malformed documents. If a user or automated system were tricked into opening a specially crafted document, an attacker could possibly cause libxml2 to crash, resulting in a denial of service. (CVE-2015-5312, CVE-2015-7497, CVE-2015-7498, CVE-2015-7499,CVE-2015-7500)  Hugh Davenport discovered that libxml2 incorrectly handled certain malformed documents. If a user or automated system were tricked into opening a specially crafted document, an attacker could possibly cause libxml2 to crash, resulting in a denial of service. (CVE-2015-8241, CVE-2015-8242)  Hanno Boeck discovered that libxml2 incorrectly handled certain malformed documents. If a user or automated system were tricked into opening a specially crafted document, an attacker could possibly cause libxml2 to crash, resulting in a denial of service. This issue only applied to Ubuntu 12.04 LTS, Ubuntu 14.04 LTS and Ubuntu 15.04. (CVE-2015-8317)  Update Instructions:  Run `sudo pro fix USN-2834-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  python-libxml2 - 2.9.1+dfsg1-3ubuntu4.6 libxml2-utils - 2.9.1+dfsg1-3ubuntu4.6 libxml2 - 2.9.1+dfsg1-3ubuntu4.6 libxml2-udeb - 2.9.1+dfsg1-3ubuntu4.6 libxml2-doc - 2.9.1+dfsg1-3ubuntu4.6 libxml2-dev - 2.9.1+dfsg1-3ubuntu4.6 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2834-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2834-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2015-12-14"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:283410000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
