{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:28552000000",
	"version": "1",
	"metadata": {
		"title": "USN-2855-2 -- Samba regression",
		"description": "USN-2855-1 fixed vulnerabilities in Samba. The upstream fix for CVE-2015-5252 introduced a regression in certain specific environments. This update fixes the problem.  Original advisory details:   Thilo Uttendorfer discovered that the Samba LDAP server incorrectly handled  certain packets. A remote attacker could use this issue to cause the LDAP  server to stop responding, resulting in a denial of service. This issue  only affected Ubuntu 14.04 LTS, Ubuntu 15.04 and Ubuntu 15.10.  (CVE-2015-3223)    Jan Kasprzak discovered that Samba incorrectly handled certain symlinks. A  remote attacker could use this issue to access files outside the exported  share path. (CVE-2015-5252)    Stefan Metzmacher discovered that Samba did not enforce signing when  creating encrypted connections. If a remote attacker were able to perform a  machine-in-the-middle attack, this flaw could be exploited to view sensitive  information. (CVE-2015-5296)    It was discovered that Samba incorrectly performed access control when  using the VFS shadow_copy2 module. A remote attacker could use this issue  to access snapshots, contrary to intended permissions. (CVE-2015-5299)    Douglas Bagnall discovered that Samba incorrectly handled certain string  lengths. A remote attacker could use this issue to possibly access  sensitive information. (CVE-2015-5330)    It was discovered that the Samba LDAP server incorrectly handled certain  packets. A remote attacker could use this issue to cause the LDAP server to  stop responding, resulting in a denial of service. This issue only affected  Ubuntu 14.04 LTS, Ubuntu 15.04 and Ubuntu 15.10. (CVE-2015-7540)    Andrew Bartlett discovered that Samba incorrectly checked administrative  privileges during creation of machine accounts. A remote attacker could  possibly use this issue to bypass intended access restrictions in certain  environments. This issue only affected Ubuntu 14.04 LTS, Ubuntu 15.04 and  Ubuntu 15.10. (CVE-2015-8467)  Update Instructions:  Run `sudo pro fix USN-2855-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libnss-winbind - 2:4.1.6+dfsg-1ubuntu2.14.04.12 libpam-winbind - 2:4.1.6+dfsg-1ubuntu2.14.04.12 libwbclient0 - 2:4.1.6+dfsg-1ubuntu2.14.04.12 samba-common - 2:4.1.6+dfsg-1ubuntu2.14.04.12 samba-libs - 2:4.1.6+dfsg-1ubuntu2.14.04.12 libsmbsharemodes0 - 2:4.1.6+dfsg-1ubuntu2.14.04.12 samba-testsuite - 2:4.1.6+dfsg-1ubuntu2.14.04.12 samba - 2:4.1.6+dfsg-1ubuntu2.14.04.12 libsmbclient - 2:4.1.6+dfsg-1ubuntu2.14.04.12 samba-common-bin - 2:4.1.6+dfsg-1ubuntu2.14.04.12 libsmbsharemodes-dev - 2:4.1.6+dfsg-1ubuntu2.14.04.12 python-samba - 2:4.1.6+dfsg-1ubuntu2.14.04.12 winbind - 2:4.1.6+dfsg-1ubuntu2.14.04.12 smbclient - 2:4.1.6+dfsg-1ubuntu2.14.04.12 samba-vfs-modules - 2:4.1.6+dfsg-1ubuntu2.14.04.12 libwbclient-dev - 2:4.1.6+dfsg-1ubuntu2.14.04.12 samba-dsdb-modules - 2:4.1.6+dfsg-1ubuntu2.14.04.12 samba-dev - 2:4.1.6+dfsg-1ubuntu2.14.04.12 libsmbclient-dev - 2:4.1.6+dfsg-1ubuntu2.14.04.12 libparse-pidl-perl - 2:4.1.6+dfsg-1ubuntu2.14.04.12 registry-tools - 2:4.1.6+dfsg-1ubuntu2.14.04.12 samba-doc - 2:4.1.6+dfsg-1ubuntu2.14.04.12 libpam-smbpass - 2:4.1.6+dfsg-1ubuntu2.14.04.12 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2855-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-2855-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-02-16"
			},
			"bug": [
				"https://launchpad.net/bugs/1545750"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:285520000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
