{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:30301000000",
	"version": "1",
	"metadata": {
		"title": "USN-3030-1 -- GD library vulnerabilities",
		"description": "It was discovered that the GD library incorrectly handled memory when using gdImageScaleTwoPass(). A remote attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 14.04 LTS. (CVE-2013-7456)  It was discovered that the GD library incorrectly handled certain malformed XBM images. If a user or automated system were tricked into processing a specially crafted XBM image, an attacker could cause a denial of service. This issue only affected Ubuntu 14.04 LTS, Ubuntu 15.10 and Ubuntu 16.04 LTS. (CVE-2016-5116)  It was discovered that the GD library incorrectly handled memory when using _gd2GetHeader(). A remote attacker could possibly use this issue to cause a denial of service or possibly execute arbitrary code. (CVE-2016-5766)  It was discovered that the GD library incorrectly handled certain color indexes. A remote attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 14.04 LTS, Ubuntu 15.10 and Ubuntu 16.04 LTS. (CVE-2016-6128)  It was discovered that the GD library incorrectly handled memory when encoding a GIF image. A remote attacker could possibly use this issue to cause a denial of service. (CVE-2016-6161)  Update Instructions:  Run `sudo pro fix USN-3030-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libgd3 - 2.1.0-3ubuntu0.2 libgd-dev - 2.1.0-3ubuntu0.2 libgd2-xpm-dev - 2.1.0-3ubuntu0.2 libgd-tools - 2.1.0-3ubuntu0.2 libgd2-noxpm-dev - 2.1.0-3ubuntu0.2 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3030-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3030-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-07-11"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:303010000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
