{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:62521000000",
	"version": "1",
	"metadata": {
		"title": "USN-6252-1 -- Linux kernel vulnerabilities",
		"description": "It was discovered that the ext4 file system implementation in the Linux kernel contained a use-after-free vulnerability. An attacker could use this to construct a malicious ext4 file system image that, when mounted, could cause a denial of service (system crash). (CVE-2022-1184)  It was discovered that the sound subsystem in the Linux kernel contained a race condition in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-3303)  It was discovered that a race condition existed in the btrfs file system implementation in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-1611)  It was discovered that the Xircom PCMCIA network device driver in the Linux kernel did not properly handle device removal events. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2023-1670)  It was discovered that a race condition existed in the Xen transport layer implementation for the 9P file system protocol in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (guest crash) or expose sensitive information (guest kernel memory). (CVE-2023-1859)  It was discovered that the ST NCI NFC driver did not properly handle device removal events. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2023-1990)  It was discovered that the XFS file system implementation in the Linux kernel did not properly perform metadata validation when mounting certain images. An attacker could use this to specially craft a file system image that, when mounted, could cause a denial of service (system crash). (CVE-2023-2124)  It was discovered that the IP-VLAN network driver for the Linux kernel did not properly initialize memory in some situations, leading to an out-of- bounds write vulnerability. An attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3090)  It was discovered that the btrfs file system implementation in the Linux kernel did not properly handle error conditions in some situations, leading to a use-after-free vulnerability. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2023-3111)  It was discovered that the Ricoh R5C592 MemoryStick card reader driver in the Linux kernel contained a race condition during module unload, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3141)  It was discovered that the kernel->user space relay implementation in the Linux kernel did not properly perform certain buffer calculations, leading to an out-of-bounds read vulnerability. A local attacker could use this to cause a denial of service (system crash) or expose sensitive information (kernel memory). (CVE-2023-3268)  It was discovered that the netfilter subsystem in the Linux kernel did not properly handle some error conditions, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3390)  Tanguy Dubroca discovered that the netfilter subsystem in the Linux kernel did not properly handle certain pointer data type, leading to an out-of- bounds write vulnerability. A privileged attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-35001)  Update Instructions:  Run `sudo pro fix USN-6252-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-modules-extra-4.15.0-1168-azure - 4.15.0-1168.183~14.04.1 linux-headers-4.15.0-1168-azure - 4.15.0-1168.183~14.04.1 linux-azure-cloud-tools-4.15.0-1168 - 4.15.0-1168.183~14.04.1 linux-buildinfo-4.15.0-1168-azure - 4.15.0-1168.183~14.04.1 linux-cloud-tools-4.15.0-1168-azure - 4.15.0-1168.183~14.04.1 linux-azure-tools-4.15.0-1168 - 4.15.0-1168.183~14.04.1 linux-tools-4.15.0-1168-azure - 4.15.0-1168.183~14.04.1 linux-image-unsigned-4.15.0-1168-azure - 4.15.0-1168.183~14.04.1 linux-modules-4.15.0-1168-azure - 4.15.0-1168.183~14.04.1 linux-azure-headers-4.15.0-1168 - 4.15.0-1168.183~14.04.1 linux-image-4.15.0-1168-azure - 4.15.0-1168.183~14.04.1 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro  linux-tools-azure - 4.15.0.1168.134 linux-signed-azure - 4.15.0.1168.134 linux-signed-image-azure - 4.15.0.1168.134 linux-cloud-tools-azure - 4.15.0.1168.134 linux-modules-extra-azure - 4.15.0.1168.134 linux-image-azure - 4.15.0.1168.134 linux-headers-azure - 4.15.0.1168.134 linux-azure - 4.15.0.1168.134 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6252-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6252-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-07-26"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:625210000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
