{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:32351000000",
	"version": "1",
	"metadata": {
		"title": "USN-3235-1 -- libxml2 vulnerabilities",
		"description": "It was discovered that libxml2 incorrectly handled format strings. If a user or automated system were tricked into opening a specially crafted document, an attacker could possibly cause libxml2 to crash, resulting in a denial of service. This issue only affected Ubuntu 12.04 LTS, Ubuntu 14.04 LTS, and Ubuntu 16.04 LTS. (CVE-2016-4448)  It was discovered that libxml2 incorrectly handled certain malformed documents. If a user or automated system were tricked into opening a specially crafted document, an attacker could cause libxml2 to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2016-4658)  Nick Wellnhofer discovered that libxml2 incorrectly handled certain malformed documents. If a user or automated system were tricked into opening a specially crafted document, an attacker could cause libxml2 to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2016-5131)  Update Instructions:  Run `sudo pro fix USN-3235-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  python-libxml2 - 2.9.1+dfsg1-3ubuntu4.9 libxml2-utils - 2.9.1+dfsg1-3ubuntu4.9 libxml2 - 2.9.1+dfsg1-3ubuntu4.9 libxml2-udeb - 2.9.1+dfsg1-3ubuntu4.9 libxml2-doc - 2.9.1+dfsg1-3ubuntu4.9 libxml2-dev - 2.9.1+dfsg1-3ubuntu4.9 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3235-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3235-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2017-03-16"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:323510000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
