{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:26981000000",
	"version": "1",
	"metadata": {
		"title": "USN-2698-1 -- SQLite vulnerabilities",
		"description": "It was discovered that SQLite incorrectly handled skip-scan optimization. An attacker could use this issue to cause applications using SQLite to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 14.04 LTS. (CVE-2013-7443)  Michal Zalewski discovered that SQLite incorrectly handled dequoting of collation-sequence names. An attacker could use this issue to cause applications using SQLite to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 14.04 LTS and Ubuntu 15.04. (CVE-2015-3414)  Michal Zalewski discovered that SQLite incorrectly implemented comparison operators. An attacker could use this issue to cause applications using SQLite to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 15.04. (CVE-2015-3415)  Michal Zalewski discovered that SQLite incorrectly handle printf precision and width values during floating-point conversions. An attacker could use this issue to cause applications using SQLite to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2015-3416)  Update Instructions:  Run `sudo pro fix USN-2698-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  lemon - 3.8.2-1ubuntu2.1 sqlite3-doc - 3.8.2-1ubuntu2.1 libsqlite3-0 - 3.8.2-1ubuntu2.1 libsqlite3-tcl - 3.8.2-1ubuntu2.1 sqlite3 - 3.8.2-1ubuntu2.1 libsqlite3-dev - 3.8.2-1ubuntu2.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2698-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2698-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2015-07-30"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:269810000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
