{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:34202000000",
	"version": "1",
	"metadata": {
		"title": "USN-3420-2 -- Linux kernel (Xenial HWE) vulnerabilities",
		"description": "USN-3420-1 fixed vulnerabilities in the Linux kernel for Ubuntu 16.04 LTS. This update provides the corresponding updates for the Linux Hardware Enablement (HWE) kernel from Ubuntu 16.04 LTS for Ubuntu 14.04 LTS.  It was discovered that a buffer overflow existed in the Bluetooth stack of the Linux kernel when handling L2CAP configuration responses. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2017-1000251)  It was discovered that the Flash-Friendly File System (f2fs) implementation in the Linux kernel did not properly validate superblock metadata. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-10663)  It was discovered that a buffer overflow existed in the ioctl handling code in the ISDN subsystem of the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-12762)  Pengfei Wang discovered that a race condition existed in the NXP SAA7164 TV Decoder driver for the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-8831)  Update Instructions:  Run `sudo pro fix USN-3420-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-extra-4.4.0-96-generic - 4.4.0-96.119~14.04.1 linux-image-4.4.0-96-powerpc64-emb - 4.4.0-96.119~14.04.1 linux-image-4.4.0-96-powerpc-smp - 4.4.0-96.119~14.04.1 linux-image-4.4.0-96-lowlatency - 4.4.0-96.119~14.04.1 linux-image-4.4.0-96-generic-lpae - 4.4.0-96.119~14.04.1 linux-image-4.4.0-96-generic - 4.4.0-96.119~14.04.1 linux-image-4.4.0-96-powerpc-e500mc - 4.4.0-96.119~14.04.1 linux-image-4.4.0-96-powerpc64-smp - 4.4.0-96.119~14.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3420-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-3420-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2017-09-18"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:342020000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
