{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:37981000000",
	"version": "1",
	"metadata": {
		"title": "USN-3798-1 -- Linux kernel vulnerabilities",
		"description": "Dmitry Vyukov discovered that the key management subsystem in the Linux kernel did not properly restrict adding a key that already exists but is negatively instantiated. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2015-8539)  It was discovered that a use-after-free vulnerability existed in the device driver for XCeive xc2028/xc3028 tuners in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2016-7913)  Pengfei Ding (丁鹏飞), Chenfu Bao (包沉浮), and Lenx Wei (韦韬) discovered a race condition in the generic SCSI driver (sg) of the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-0794)  Eric Biggers discovered that the key management subsystem in the Linux kernel did not properly restrict adding a key that already exists but is uninstantiated. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-15299)  It was discovered that a NULL pointer dereference could be triggered in the OCFS2 file system implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash). (CVE-2017-18216)  Luo Quan and Wei Yang discovered that a race condition existed in the Advanced Linux Sound Architecture (ALSA) subsystem of the Linux kernel when handling ioctl()s. A local attacker could use this to cause a denial of service (system deadlock). (CVE-2018-1000004)  范龙飞 discovered that a race condition existed in the Advanced Linux Sound Architecture (ALSA) subsystem of the Linux kernel that could lead to a use- after-free or an out-of-bounds buffer access. A local attacker with access to /dev/snd/seq could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-7566)  It was discovered that a buffer overflow existed in the NFC Logical Link Control Protocol (llcp) implementation in the Linux kernel. An attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-9518)  Update Instructions:  Run `sudo pro fix USN-3798-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-3.13.0-161-generic-lpae - 3.13.0-161.211 linux-image-3.13.0-161-powerpc-smp - 3.13.0-161.211 linux-image-3.13.0-161-powerpc-e500 - 3.13.0-161.211 linux-image-3.13.0-161-generic - 3.13.0-161.211 linux-image-3.13.0-161-powerpc64-emb - 3.13.0-161.211 linux-image-extra-3.13.0-161-generic - 3.13.0-161.211 linux-image-3.13.0-161-lowlatency - 3.13.0-161.211 linux-image-3.13.0-161-powerpc-e500mc - 3.13.0-161.211 linux-image-3.13.0-161-powerpc64-smp - 3.13.0-161.211 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3798-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3798-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2018-10-23"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:379810000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
