{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:24831000000",
	"version": "1",
	"metadata": {
		"title": "USN-2483-1 -- JasPer vulnerabilities",
		"description": "Jose Duart discovered that JasPer incorrectly handled ICC color profiles in JPEG-2000 image files. If a user were tricked into opening a specially crafted JPEG-2000 image file, a remote attacker could cause JasPer to crash or possibly execute arbitrary code with user privileges. (CVE-2014-8137)  Jose Duart discovered that JasPer incorrectly decoded certain malformed JPEG-2000 image files. If a user were tricked into opening a specially crafted JPEG-2000 image file, a remote attacker could cause JasPer to crash or possibly execute arbitrary code with user privileges. (CVE-2014-8138)  It was discovered that JasPer incorrectly handled certain malformed JPEG-2000 image files. If a user were tricked into opening a specially crafted JPEG-2000 image file, a remote attacker could cause JasPer to crash or possibly execute arbitrary code with user privileges. (CVE-2014-8157)  It was discovered that JasPer incorrectly handled memory when processing JPEG-2000 image files. If a user were tricked into opening a specially crafted JPEG-2000 image file, a remote attacker could cause JasPer to crash or possibly execute arbitrary code with user privileges. (CVE-2014-8158)  Update Instructions:  Run `sudo pro fix USN-2483-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libjasper-runtime - 1.900.1-14ubuntu3.2 libjasper-dev - 1.900.1-14ubuntu3.2 libjasper1 - 1.900.1-14ubuntu3.2 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-2483-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-2483-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2015-01-26"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:248310000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
