{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:44672000000",
	"version": "1",
	"metadata": {
		"title": "USN-4467-2 -- QEMU vulnerabilities",
		"description": "USN-4467-1 fixed several vulnerabilities in QEMU. This update provides the corresponding update for Ubuntu 14.04 ESM.  Original advisory details:   It was discovered that the QEMU SD memory card implementation incorrectly  handled certain memory operations. An attacker inside a guest could  possibly use this issue to cause QEMU to crash, resulting in a denial of  service. (CVE-2020-13253)   Ren Ding and Hanqing Zhao discovered that the QEMU ES1370 audio driver  incorrectly handled certain invalid frame counts. An attacker inside a  guest could possibly use this issue to cause QEMU to crash, resulting in a  denial of service. (CVE-2020-13361)   Ren Ding and Hanqing Zhao discovered that the QEMU MegaRAID SAS SCSI driver  incorrectly handled certain memory operations. An attacker inside a guest  could possibly use this issue to cause QEMU to crash, resulting in a denial  of service. (CVE-2020-13362)   Alexander Bulekov discovered that QEMU MegaRAID SAS SCSI driver incorrectly  handled certain memory space operations. An attacker inside a guest could  possibly use this issue to cause QEMU to crash, resulting in a denial of  service. (CVE-2020-13659)   Ren Ding, Hanqing Zhao, Alexander Bulekov, and Anatoly Trosinenko  discovered that the QEMU incorrectly handled certain msi-x mmio operations.  An attacker inside a guest could possibly use this issue to cause QEMU to  crash, resulting in a denial of service. (CVE-2020-13754)   Ziming Zhang, Xiao Wei, Gonglei Arei and Yanyu Zhang discovered that  QEMU incorrectly handled certain USB packets. An attacker could possibly  use this to expose sensitive information or execute arbitrary code.  (CVE-2020-14364)  Update Instructions:  Run `sudo pro fix USN-4467-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  qemu-system-common - 2.0.0+dfsg-2ubuntu1.47+esm1 qemu-user-static - 2.0.0+dfsg-2ubuntu1.47+esm1 qemu-system-misc - 2.0.0+dfsg-2ubuntu1.47+esm1 qemu - 2.0.0+dfsg-2ubuntu1.47+esm1 qemu-kvm - 2.0.0+dfsg-2ubuntu1.47+esm1 qemu-user - 2.0.0+dfsg-2ubuntu1.47+esm1 qemu-keymaps - 2.0.0+dfsg-2ubuntu1.47+esm1 qemu-guest-agent - 2.0.0+dfsg-2ubuntu1.47+esm1 qemu-system - 2.0.0+dfsg-2ubuntu1.47+esm1 qemu-utils - 2.0.0+dfsg-2ubuntu1.47+esm1 qemu-system-aarch64 - 2.0.0+dfsg-2ubuntu1.47+esm1 qemu-system-x86 - 2.0.0+dfsg-2ubuntu1.47+esm1 qemu-common - 2.0.0+dfsg-2ubuntu1.47+esm1 qemu-system-sparc - 2.0.0+dfsg-2ubuntu1.47+esm1 qemu-system-arm - 2.0.0+dfsg-2ubuntu1.47+esm1 qemu-system-ppc - 2.0.0+dfsg-2ubuntu1.47+esm1 qemu-system-mips - 2.0.0+dfsg-2ubuntu1.47+esm1 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4467-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-4467-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2021-02-02"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:446720000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
