{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:30181000000",
	"version": "1",
	"metadata": {
		"title": "USN-3018-1 -- Linux kernel vulnerabilities",
		"description": "Jesse Hertz and Tim Newsham discovered that the Linux netfilter implementation did not correctly perform validation when handling 32 bit compatibility IPT_SO_SET_REPLACE events on 64 bit platforms. A local unprivileged attacker could use this to cause a denial of service (system crash) or execute arbitrary code with administrative privileges. (CVE-2016-4997)  Kangjie Lu discovered an information leak in the core USB implementation in the Linux kernel. A local attacker could use this to obtain potentially sensitive information from kernel memory. (CVE-2016-4482)  Jann Horn discovered that the InfiniBand interfaces within the Linux kernel could be coerced into overwriting kernel memory. A local unprivileged attacker could use this to possibly gain administrative privileges on systems where InifiniBand related kernel modules are loaded. (CVE-2016-4565)  Kangjie Lu discovered an information leak in the timer handling implementation in the Advanced Linux Sound Architecture (ALSA) subsystem of the Linux kernel. A local attacker could use this to obtain potentially sensitive information from kernel memory. (CVE-2016-4569, CVE-2016-4578)  Kangjie Lu discovered an information leak in the X.25 Call Request handling in the Linux kernel. A local attacker could use this to obtain potentially sensitive information from kernel memory. (CVE-2016-4580)  It was discovered that an information leak exists in the Rock Ridge implementation in the Linux kernel. A local attacker who is able to mount a malicious iso9660 file system image could exploit this flaw to obtain potentially sensitive information from kernel memory. (CVE-2016-4913)  Jesse Hertz and Tim Newsham discovered that the Linux netfilter implementation did not correctly perform validation when handling IPT_SO_SET_REPLACE events. A local unprivileged attacker could use this to cause a denial of service (system crash) or obtain potentially sensitive information from kernel memory. (CVE-2016-4998)  Update Instructions:  Run `sudo pro fix USN-3018-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-3.13.0-91-generic - 3.13.0-91.138 linux-image-3.13.0-91-powerpc-e500mc - 3.13.0-91.138 linux-image-3.13.0-91-powerpc-smp - 3.13.0-91.138 linux-image-3.13.0-91-powerpc-e500 - 3.13.0-91.138 linux-image-3.13.0-91-powerpc64-smp - 3.13.0-91.138 linux-image-3.13.0-91-lowlatency - 3.13.0-91.138 linux-image-3.13.0-91-powerpc64-emb - 3.13.0-91.138 linux-image-3.13.0-91-generic-lpae - 3.13.0-91.138 linux-image-extra-3.13.0-91-generic - 3.13.0-91.138 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3018-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3018-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2016-06-27"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:301810000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
