{
	"class": "patch",
	"id": "oval:com.ubuntu.trusty:def:51581000000",
	"version": "1",
	"metadata": {
		"title": "USN-5158-1 -- ImageMagick vulnerabilities",
		"description": "It was discovered that ImageMagick incorrectly handled certain values when processing visual effects based image files. By tricking a user into opening a specially crafted image file, an attacker could crash the application causing a denial of service. (CVE-2021-20244)  It was discovered that ImageMagick incorrectly handled certain values when performing resampling operations. By tricking a user into opening a specially crafted image file, an attacker could crash the application  causing a denial of service. (CVE-2021-20246)  It was discovered that ImageMagick incorrectly handled certain values when processing visual effects based image files. By tricking a user into opening a specially crafted image file, an attacker could crash the application causing a denial of service (CVE-2021-20309)  It was discovered that ImageMagick incorrectly handled certain values when processing thumbnail image data. By tricking a user into opening a specially crafted image file, an attacker could crash the application  causing a denial of service. (CVE-2021-20312)  It was discovered that ImageMagick incorrectly handled memory cleanup when performing certain cryptographic operations. Under certain conditions sensitive cryptographic information could be disclosed. (CVE-2021-20313)  Update Instructions:  Run `sudo pro fix USN-5158-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  imagemagick-common - 8:6.7.7.10-6ubuntu3.13+esm1 libmagickcore5 - 8:6.7.7.10-6ubuntu3.13+esm1 imagemagick - 8:6.7.7.10-6ubuntu3.13+esm1 imagemagick-doc - 8:6.7.7.10-6ubuntu3.13+esm1 libmagickwand5 - 8:6.7.7.10-6ubuntu3.13+esm1 libmagickcore5-extra - 8:6.7.7.10-6ubuntu3.13+esm1 libmagickwand-dev - 8:6.7.7.10-6ubuntu3.13+esm1 libmagick++-dev - 8:6.7.7.10-6ubuntu3.13+esm1 libmagick++5 - 8:6.7.7.10-6ubuntu3.13+esm1 perlmagick - 8:6.7.7.10-6ubuntu3.13+esm1 libmagickcore-dev - 8:6.7.7.10-6ubuntu3.13+esm1 Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5158-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5158-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2021-11-29"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:515810000000",
						"comment": "Available with Ubuntu Pro (Infra-only): https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
