{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2024210120000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-21012 on Ubuntu 20.04 FIPS Certified (focal) - medium",
		"description": "Vulnerability in the Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVMEnterprise Edition product of Oracle Java SE (component: Networking).Supported versions that are affected are Oracle Java SE: 11.0.22, 17.0.10,21.0.2, 22; Oracle GraalVM for JDK: 17.0.10, 21.0.2, 22; Oracle GraalVMEnterprise Edition: 20.3.13 and 21.3.9. Difficult to exploit vulnerabilityallows unauthenticated attacker with network access via multiple protocolsto compromise Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVMEnterprise Edition. Successful attacks of this vulnerability can result inunauthorized update, insert or delete access to some of Oracle Java SE,Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition accessible data.Note: This vulnerability applies to Java deployments, typically in clientsrunning sandboxed Java Web Start applications or sandboxed Java applets,that load and run untrusted code (e.g., code that comes from the internet)and rely on the Java sandbox for security. This vulnerability does notapply to Java deployments, typically in servers, that load and run onlytrusted code (e.g., code installed by an administrator). CVSS 3.1 BaseScore 3.7 (Integrity impacts). CVSS Vector:(CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:L/A:N).",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-21012",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-21012"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-04-16 22:15:00 UTC",
			"cve": {
				"text": "CVE-2024-21012",
				"href": "https://ubuntu.com/security/CVE-2024-21012",
				"public": "20240416",
				"cvss_score": "3.7",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:L/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:201548520000020",
						"comment": "openjdk-8 package in focal is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2024210020000000",
						"comment": "openjdk-lts package in focal is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:201928940000020",
						"comment": "openjdk-13: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'superseded by openjdk-17')."
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2022212480000020",
						"comment": "openjdk-16: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'superseded by openjdk-17')."
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2024210020000010",
						"comment": "openjdk-17 package in focal is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2023218300000010",
						"comment": "openjdk-21 package in focal is affected and may need fixing."
					}
				]
			}
		]
	}
}
