{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2023248160000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-24816 on Ubuntu 20.04 FIPS Certified (focal) - low",
		"description": "IPython (Interactive Python) is a command shell for interactive computingin multiple programming languages, originally developed for the Pythonprogramming language. Versions prior to 8.1.0 are subject to a commandinjection vulnerability with very specific prerequisites. Thisvulnerability requires that the function`IPython.utils.terminal.set_term_title` be called on Windows in a Pythonenvironment where ctypes is not available. The dependency on `ctypes` in`IPython.utils._process_win32` prevents the vulnerable code from ever beingreached in the ipython binary. However, as a library that could be used byanother tool `set_term_title` could be called and hence introduce avulnerability. Should an attacker get untrusted input to an instance ofthis function they would be able to inject shell commands as currentprocess and limited to the scope of the current process. Users of ipythonas a library are advised to upgrade. Users unable to upgrade should ensurethat any calls to the `IPython.utils.terminal.set_term_title` function aredone with trusted or filtered input.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-24816",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-24816"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-02-10 20:15:00 UTC",
			"cve": {
				"text": "CVE-2023-24816",
				"href": "https://ubuntu.com/security/CVE-2023-24816",
				"public": "20230210",
				"cvss_score": "7.0",
				"cvss_vector": "CVSS:3.1/AV:L/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2022216990000000",
						"comment": "ipython package in focal is affected and may need fixing."
					}
				]
			}
		]
	}
}
