{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2021412810000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-41281 on Ubuntu 20.04 FIPS Certified (focal) - medium.",
		"Description": "Synapse is a package for Matrix homeservers written in Python 3/Twisted. Prior to version 1.47.1, Synapse instances with the media repository enabled can be tricked into downloading a file from a remote server into an arbitrary directory. No authentication is required for the affected endpoint. The last 2 directories and file name of the path are chosen randomly by Synapse and cannot be controlled by an attacker, which limits the impact. Homeservers with the media repository disabled are unaffected. Homeservers with a federation whitelist are also unaffected, since Synapse will check the remote hostname, including the trailing `../`s, against the whitelist. Server administrators should upgrade to 1.47.1 or later. Server administrators using a reverse proxy could, at the expense of losing media functionality, may block the certain endpoints as a workaround. Alternatively, non-containerized deployments can be adapted to use the hardened systemd config.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 20.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-41281",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-41281"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2021 Canonical Ltd.",
			"PublicDate": "2021-11-23 20:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2021-41281",
				"href": "https://ubuntu.com/security/CVE-2021-41281",
				"public": "20211123",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.focal:tst:2020262570000000",
				"comment": "matrix-synapse package in focal is affected and needs fixing."
			}
		]
	}
}
