{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2021411360000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-41136 on Ubuntu 20.04 FIPS Certified (focal) - medium",
		"Description": "Puma is a HTTP 1.1 server for Ruby/Rack applications. Prior to versions5.5.1 and 4.3.9, using `puma` with a proxy which forwards HTTP headervalues which contain the LF character could allow HTTP request smugggling.A client could smuggle a request through a proxy, causing the proxy to senda response back to another unknown client. The only proxy which has thisbehavior, as far as the Puma team is aware of, is Apache Traffic Server. Ifthe proxy uses persistent connections and the client adds another requestin via HTTP pipelining, the proxy may mistake it as the first request'sbody. Puma, however, would see it as two requests, and when processing thesecond request, send back a response that the proxy does not expect. If theproxy has reused the persistent connection to Puma to send another requestfor a different client, the second response from the first client will besent to the second client. This vulnerability was patched in Puma 5.5.1 and4.3.9. As a workaround, do not use Apache Traffic Server with `puma`.\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2021-41136` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\npuma - 3.12.4-1ubuntu2\nNo subscription required",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 20.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-41136",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-41136"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2021 Canonical Ltd.",
			"PublicDate": "2021-10-12 16:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2021-41136",
				"href": "https://ubuntu.com/security/CVE-2021-41136",
				"public": "20211012",
				"cvss_score": "3.7",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:R/S:U/C:L/I:L/A:N"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:202052470000000",
						"comment": "puma package in focal, is related to the CVE in some way and has been fixed (note: '3.12.4-1ubuntu2')."
					}
				]
			}
		]
	}
}
