{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2023476410000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-47641 on Ubuntu 20.04 FIPS Certified (focal) - medium",
		"description": "aiohttp is an asynchronous HTTP client/server framework for asyncio andPython. Affected versions of aiohttp have a security vulnerabilityregarding the inconsistent interpretation of the http protocol. HTTP/1.1 isa persistent protocol, if both Content-Length(CL) and Transfer-Encoding(TE)header values are present it can lead to incorrect interpretation of twoentities that parse the HTTP and we can poison other sockets with thisincorrect interpretation. A possible Proof-of-Concept (POC) would be aconfiguration with a reverse proxy(frontend) that accepts both CL and TEheaders and aiohttp as backend. As aiohttp parses anything with chunked, wecan pass a chunked123 as TE, the frontend entity will ignore this headerand will parse Content-Length. The impact of this vulnerability is that itis possible to bypass any proxy rule, poisoning sockets to other users likepassing Authentication Headers, also if it is present an Open Redirect anattacker could combine it to redirect random users to another website andlog the request. This vulnerability has been addressed in release 3.8.0 ofaiohttp. Users are advised to upgrade. There are no known workarounds forthis vulnerability.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-47641",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-47641"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-11-14 21:15:00 UTC",
			"cve": {
				"text": "CVE-2023-47641",
				"href": "https://ubuntu.com/security/CVE-2023-47641",
				"public": "20231114",
				"cvss_score": "6.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2021213300000000",
						"comment": "python-aiohttp package in focal is affected and may need fixing."
					}
				]
			}
		]
	}
}
