{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2023284390000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2023-28439 on Ubuntu 20.04 FIPS Certified (focal) - medium.",
		"Description": "CKEditor4 is an open source what-you-see-is-what-you-get HTML editor. A cross-site scripting vulnerability has been discovered affecting Iframe Dialog and Media Embed packages. The vulnerability may trigger a JavaScript code after fulfilling special conditions: using one of the affected packages on a web page with missing proper Content Security Policy configuration; initializing the editor on an element and using an element other than `<textarea>` as a base; and destroying the editor instance. This vulnerability might affect a small percentage of integrators that depend on dynamic editor initialization/destroy mechanism. A fix is available in CKEditor4 version 4.21.0. In some rare cases, a security fix may be considered a breaking change. Starting from version 4.21.0, the Iframe Dialog plugin applies the `sandbox` attribute by default, which restricts JavaScript code execution in the iframe element. To change this behavior, configure the `config.iframe_attributes` option. Also starting from version 4.21.0, the Media Embed plugin regenerates the entire content of the embed widget by default. To change this behavior, configure the `config.embed_keepOriginalContent` option. Those who choose to enable either of the more permissive options or who cannot upgrade to a patched version should properly configure Content Security Policy to avoid any potential security issues that may arise from embedding iframe elements on their web page.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 20.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-28439",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-28439"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2023 Canonical Ltd.",
			"PublicDate": "2023-03-22 21:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2023-28439",
				"href": "https://ubuntu.com/security/CVE-2023-28439",
				"public": "20230322",
				"cvss_score": "6.1",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": "sbeattie> embedded copies of ckeditor are in ldap-account-manager, rt4, and rt5"
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2021262710000000",
						"comment": "ckeditor package in focal is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2021213910000000",
						"comment": "ckeditor3 package in focal is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2021376950000020",
						"comment": "ldap-account-manager package in focal is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2021376950000030",
						"comment": "request-tracker4 package in focal is affected and may need fixing."
					}
				]
			}
		]
	}
}
