{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2023384970000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2023-38497 on Ubuntu 20.04 FIPS Certified (focal) - medium.",
		"Description": "Cargo downloads the Rust project’s dependencies and compiles the project. Cargo prior to version 0.72.2, bundled with Rust prior to version 1.71.1, did not respect the umask when extracting crate archives on UNIX-like systems. If the user downloaded a crate containing files writeable by any local user, another local user could exploit this to change the source code compiled and executed by the current user. To prevent existing cached extractions from being exploitable, the Cargo binary version 0.72.2 included in Rust 1.71.1 or later will purge caches generated by older Cargo versions automatically. As a workaround, configure one's system to prevent other local users from accessing the Cargo directory, usually located in `~/.cargo`.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 20.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-38497",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-38497"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2023 Canonical Ltd.",
			"PublicDate": "2023-08-03 12:00:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2023-38497",
				"href": "https://ubuntu.com/security/CVE-2023-38497",
				"public": "20230803",
				"cvss_score": "7.3",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H",
				"usns": "6275-1"
			},
			"PublicDateAtUsn": "2023-08-03 12:00:00 UTC",
			"AssignedTo": "litios",
			"DiscoveredBy": "Addison Crump",
			"Crd": "2023-08-03 12:00:00 UTC",
			"Ref": null
		}
	},
	"notes": {
		"Note": "sbeattie> cargo in mantic was merged into rustc alexmurray> requires an update to the tar rust dependency (tar 0.4.39) - this is packaged as rust-tar in Ubuntu but only the rust-cargo package appears to use this - rustc and cargo both vendor a copy of this package litios> a workaround for this issue is to prevent access to the ~/.cargo directory to other users."
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.focal:tst:2023384970000000",
				"comment": "cargo package in focal is affected and needs fixing."
			}
		]
	}
}
