{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2022247910000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2022-24791 on Ubuntu 20.04 FIPS Certified (focal) - medium",
		"Description": "Wasmtime is a standalone JIT-style runtime for WebAssembly, usingCranelift. There is a use after free vulnerability in Wasmtime when bothrunning Wasm that uses externrefs and enabling epoch interruption inWasmtime. If you are not explicitly enabling epoch interruption (it isdisabled by default) then you are not affected. If you are explicitlydisabling the Wasm reference types proposal (it is enabled by default) thenyou are also not affected. The use after free is caused by Craneliftfailing to emit stack maps when there are safepoints inside cold blocks.Cold blocks occur when epoch interruption is enabled. Cold blocks areemitted at the end of compiled functions, and change the order blocks areemitted versus defined. This reordering accidentally caused Cranelift toskip emitting some stack maps because it expected to emit the stack maps inblock definition order, rather than block emission order. When Wasmtimewould eventually collect garbage, it would fail to find live references onthe stack because of the missing stack maps, think that they wereunreferenced garbage, and therefore reclaim them. Then after the collectionended, the Wasm code could use the reclaimed-too-early references, which isa use after free. Patches have been released in versions 0.34.2 and 0.35.2,which fix the vulnerability. All Wasmtime users are recommended to upgradeto these patched versions. If upgrading is not an option for you at thistime, you can avoid the vulnerability by either: disabling the Wasmreference types proposal, config.wasm_reference_types(false); or bydisabling epoch interruption if you were previously enabling it.config.epoch_interruption(false).",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 20.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-24791",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-24791"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2022 Canonical Ltd.",
			"PublicDate": "2022-03-31 23:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2022-24791",
				"href": "https://ubuntu.com/security/CVE-2022-24791",
				"public": "20220331",
				"cvss_score": "9.8",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "chrisccoulson",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2022236390000000",
						"comment": "firefox: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'bundled deps handled by upstream in new versions')."
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2022236390000010",
						"comment": "thunderbird: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'bundled deps handled by upstream in new versions')."
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:201699690000000",
						"comment": "mozjs52 package in focal is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2020123870000020",
						"comment": "mozjs68 package in focal is affected and may need fixing."
					}
				]
			}
		]
	}
}
