{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.impish:def:201929770000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2019-2977 on Ubuntu 21.10 (impish) - medium.",
		"description": "Vulnerability in the Java SE product of Oracle Java SE (component: Hotspot). Supported versions that are affected are Java SE: 11.0.4 and 13. Difficult to exploit vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Java SE. Successful attacks of this vulnerability can result in unauthorized read access to a subset of Java SE accessible data and unauthorized ability to cause a partial denial of service (partial DOS) of Java SE. Note: This vulnerability applies to Java deployments, typically in clients running sandboxed Java Web Start applications or sandboxed Java applets (in Java SE 8), that load and run untrusted code (e.g., code that comes from the internet) and rely on the Java sandbox for security. This vulnerability does not apply to Java deployments, typically in servers, that load and run only trusted code (e.g., code installed by an administrator). CVSS 3.0 Base Score 4.8 (Confidentiality and Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:L). It was discovered that the String class in OpenJDK contained an out-of-bounds access vulnerability. An attacker could use this to cause a denial of service (application crash) or possibly expose sensitive information.\n\nUpdate Instructions:\n\nRun `sudo ua fix CVE-2019-2977` to fix the vulnerability. The problem can be corrected\nby updating your system to the following package versions:\n\nopenjdk-11-demo - 11.0.5+10-2ubuntu1\nopenjdk-11-jdk - 11.0.5+10-2ubuntu1\nopenjdk-11-jdk-headless - 11.0.5+10-2ubuntu1\nopenjdk-11-jre - 11.0.5+10-2ubuntu1\nopenjdk-11-jre-headless - 11.0.5+10-2ubuntu1\nopenjdk-11-jre-zero - 11.0.5+10-2ubuntu1\nopenjdk-11-source - 11.0.5+10-2ubuntu1\nNo subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 21.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2019-2977",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-2977"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2019 Canonical Ltd.",
			"public_date": "2019-10-16 18:15:00 UTC",
			"cve": {},
			"public_date_at_usn": "2019-10-16 18:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/CVE-2019-2977",
				"http://www.oracle.com/technetwork/security-advisory/cpuoct2019-5072832.html",
				"https://ubuntu.com/security/notices/USN-4223-1"
			]
		}
	},
	"notes": {
		"note": "sbeattie> does not affect openjdk-8"
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.impish:tst:201928940000010",
				"comment": "openjdk-lts package in impish, is related to the CVE in some way and has been fixed (note: '11.0.5+10-2ubuntu1')."
			}
		]
	}
}
