{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.impish:def:2021410910000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2021-41091 on Ubuntu 21.10 (impish) - medium.",
    "Description": "Moby is an open-source project created by Docker to enable software containerization. A bug was found in Moby (Docker Engine) where the data directory (typically `/var/lib/docker`) contained subdirectories with insufficiently restricted permissions, allowing otherwise unprivileged Linux users to traverse directory contents and execute programs. When containers included executable programs with extended permission bits (such as `setuid`), unprivileged Linux users could discover and execute those programs. When the UID of an unprivileged Linux user on the host collided with the file owner or group inside a container, the unprivileged Linux user on the host could discover, read, and modify those files. This bug has been fixed in Moby (Docker Engine) 20.10.9. Users should update to this version as soon as possible. Running containers should be stopped and restarted for the permissions to be fixed. For users unable to upgrade limit access to the host to trusted users. Limit access to host volumes to trusted containers.\n\nUpdate Instructions:\n\nRun `sudo ua fix CVE-2021-41091` to fix the vulnerability. The problem can be corrected\nby updating your system to the following package versions:\n\ndocker.io - 20.10.7-0ubuntu5\nNo subscription required",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 21.10"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2021-41091",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-41091"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2021 Canonical Ltd.",
      "PublicDate": "2021-10-04 21:15:00 UTC",
      "Bug": null,
      "cve": {},
      "PublicDateAtUsn": "",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": [
        "https://ubuntu.com/security/CVE-2021-41091",
        "https://github.com/moby/moby/security/advisories/GHSA-3fwx-pjgw-3558"
      ]
    }
  },
  "notes": {
    "Note": "sbeattie> looks to have possibly been introduced in e908cc39018c015084ffbffbc5703ccba5c2fbb7 (v20.10.3)"
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.impish:tst:2021410890000000",
        "comment": "docker.io package in impish was vulnerable but has been fixed (note: '20.10.7-0ubuntu5')."
      }
    ]
  }
}
