{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.impish:def:2022230420000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2022-23042 on Ubuntu 21.10 (impish) - medium.",
    "Description": "Linux PV device frontends vulnerable to attacks by backends T[his CNA information record relates to multiple CVEs; the text explains which aspects/vulnerabilities correspond to which CVE.] Several Linux PV device frontends are using the grant table interfaces for removing access rights of the backends in ways being subject to race conditions, resulting in potential data leaks, data corruption by malicious backends, and denial of service triggered by malicious backends: blkfront, netfront, scsifront and the gntalloc driver are testing whether a grant reference is still in use. If this is not the case, they assume that a following removal of the granted access will always succeed, which is not true in case the backend has mapped the granted page between those two operations. As a result the backend can keep access to the memory page of the guest no matter how the page will be used after the frontend I/O has finished. The xenbus driver has a similar problem, as it doesn't check the success of removing the granted access of a shared ring buffer. blkfront: CVE-2022-23036 netfront: CVE-2022-23037 scsifront: CVE-2022-23038 gntalloc: CVE-2022-23039 xenbus: CVE-2022-23040 blkfront, netfront, scsifront, usbfront, dmabuf, xenbus, 9p, kbdfront, and pvcalls are using a functionality to delay freeing a grant reference until it is no longer in use, but the freeing of the related data page is not synchronized with dropping the granted access. As a result the backend can keep access to the memory page even after it has been freed and then re-used for a different purpose. CVE-2022-23041 netfront will fail a BUG_ON() assertion if it fails to revoke access in the rx path. This will result in a Denial of Service (DoS) situation of the guest which can be triggered by the backend. CVE-2022-23042 Demi Marie Obenour and Simon Gaiser discovered that several Xen para- virtualization device frontends did not properly restrict the access rights of device backends. An attacker could possibly use a malicious Xen backend to gain access to memory pages of a guest VM or cause a denial of service in the guest.",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 21.10"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2022-23042",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-23042"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2022 Canonical Ltd.",
      "PublicDate": "2022-03-10 20:15:00 UTC",
      "Bug": null,
      "cve": {},
      "PublicDateAtUsn": "2022-03-10 20:15:00 UTC",
      "AssignedTo": "",
      "DiscoveredBy": "Demi Marie Obenour and Simon Gaiser",
      "Crd": "",
      "Ref": [
        "https://ubuntu.com/security/CVE-2022-23042",
        "https://xenbits.xen.org/xsa/advisory-396.html",
        "https://ubuntu.com/security/notices/USN-5418-1",
        "https://ubuntu.com/security/notices/USN-5467-1"
      ]
    }
  },
  "notes": {
    "Note": ""
  },
  "criteria": {
    "criterias": [
      {
        "operator": "OR",
        "criterions": [
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000000",
            "comment": "linux package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000010",
            "comment": "linux-aws package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000020",
            "comment": "linux-azure package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000030",
            "comment": "linux-gcp package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000040",
            "comment": "linux-kvm package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000050",
            "comment": "linux-meta package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000060",
            "comment": "linux-meta-aws package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000070",
            "comment": "linux-meta-azure package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000080",
            "comment": "linux-meta-gcp package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000090",
            "comment": "linux-meta-kvm package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000100",
            "comment": "linux-meta-oracle package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000110",
            "comment": "linux-meta-raspi package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000120",
            "comment": "linux-meta-riscv package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000130",
            "comment": "linux-oracle package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000140",
            "comment": "linux-raspi package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000150",
            "comment": "linux-riscv package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000160",
            "comment": "linux-signed package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000170",
            "comment": "linux-signed-aws package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000180",
            "comment": "linux-signed-azure package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000190",
            "comment": "linux-signed-gcp package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000200",
            "comment": "linux-signed-kvm package in impish is affected and needs fixing."
          },
          {
            "test_ref": "oval:com.ubuntu.impish:tst:201245420000210",
            "comment": "linux-signed-oracle package in impish is affected and needs fixing."
          }
        ]
      }
    ]
  }
}
