{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.impish:def:2022216580000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-21658 on Ubuntu 21.10 (impish) - medium.",
		"description": "Rust is a multi-paradigm, general-purpose programming language designed for performance and safety, especially safe concurrency. The Rust Security Response WG was notified that the `std::fs::remove_dir_all` standard library function is vulnerable a race condition enabling symlink following (CWE-363). An attacker could use this security issue to trick a privileged program into deleting files and directories the attacker couldn't otherwise access or delete. Rust 1.0.0 through Rust 1.58.0 is affected by this vulnerability with 1.58.1 containing a patch. Note that the following build targets don't have usable APIs to properly mitigate the attack, and are thus still vulnerable even with a patched toolchain: macOS before version 10.10 (Yosemite) and REDOX. We recommend everyone to update to Rust 1.58.1 as soon as possible, especially people developing programs expected to run in privileged contexts (including system daemons and setuid binaries), as those have the highest risk of being affected by this. Note that adding checks in your codebase before calling remove_dir_all will not mitigate the vulnerability, as they would also be vulnerable to race conditions like remove_dir_all itself. The existing mitigation is working as intended outside of race conditions.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 21.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-21658",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-21658"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-01-20 11:00:00 UTC",
			"cve": {},
			"crd": "2022-01-20 11:00:00 UTC",
			"ref": [
				"https://ubuntu.com/security/CVE-2022-21658",
				"https://github.com/rust-lang/rust/security/advisories/GHSA-r9cc-f5pr-p3j2",
				"https://groups.google.com/g/rustlang-security-announcements/c/R1fZFDhnJVQ?pli=1",
				"https://rustsec.org/advisories/CVE-2022-21658.html",
				"https://blog.rust-lang.org/2022/01/20/cve-2022-21658.html",
				"https://github.com/rust-lang/wg-security-response/blob/master/patches/CVE-2022-21658/0002-Fix-CVE-2022-21658-for-UNIX-like.patch"
			]
		}
	},
	"notes": {
		"note": "amurray> Will require any package in the Ubuntu archive which calls remove_dir_all() to be recompiled with the patched rustc"
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.impish:tst:2020363170000000",
				"comment": "rustc package in impish is affected and needs fixing."
			}
		]
	}
}
