{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.impish:def:2021438600000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-43860 on Ubuntu 21.10 (impish) - medium.",
		"Description": "Flatpak is a Linux application sandboxing and distribution framework. Prior to versions 1.12.3 and 1.10.6, Flatpak doesn't properly validate that the permissions displayed to the user for an app at install time match the actual permissions granted to the app at runtime, in the case that there's a null byte in the metadata file of an app. Therefore apps can grant themselves permissions without the consent of the user. Flatpak shows permissions to the user during install by reading them from the \"xa.metadata\" key in the commit metadata. This cannot contain a null terminator, because it is an untrusted GVariant. Flatpak compares these permissions to the *actual* metadata, from the \"metadata\" file to ensure it wasn't lied to. However, the actual metadata contents are loaded in several places where they are read as simple C-style strings. That means that, if the metadata file includes a null terminator, only the content of the file from *before* the terminator gets compared to xa.metadata. Thus, any permissions that appear in the metadata file after a null terminator are applied at runtime but not shown to the user. So maliciously crafted apps can give themselves hidden permissions. Users who have Flatpaks installed from untrusted sources are at risk in case the Flatpak has a maliciously crafted metadata file, either initially or in an update. This issue is patched in versions 1.12.3 and 1.10.6. As a workaround, users can manually check the permissions of installed apps by checking the metadata file or the xa.metadata key on the commit metadata.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 21.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-43860",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-43860"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2022 Canonical Ltd.",
			"PublicDate": "2022-01-12 22:15:00 UTC",
			"Bug": [
				"https://bugs.launchpad.net/ubuntu/+source/flatpak/+bug/1957716"
			],
			"cve": {},
			"PublicDateAtUsn": "",
			"AssignedTo": "amurray",
			"DiscoveredBy": "Ryan Gonzalez",
			"Crd": "",
			"Ref": [
				"https://ubuntu.com/security/CVE-2021-43860",
				"https://github.com/flatpak/flatpak/security/advisories/GHSA-qpjc-vq3c-572j",
				"https://github.com/flatpak/flatpak/releases/tag/1.12.3",
				"https://github.com/flatpak/flatpak/releases/tag/1.10.6"
			]
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.impish:tst:2021438600000000",
				"comment": "flatpak package in impish is affected and may need fixing."
			}
		]
	}
}
