{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.impish:def:2020117390000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2020-11739 on Ubuntu 21.10 (impish) - medium.",
		"Description": "An issue was discovered in Xen through 4.13.x, allowing guest OS users to cause a denial of service or possibly gain privileges because of missing memory barriers in read-write unlock paths. The read-write unlock paths don't contain a memory barrier. On Arm, this means a processor is allowed to re-order the memory access with the preceding ones. In other words, the unlock may be seen by another processor before all the memory accesses within the \"critical\" section. As a consequence, it may be possible to have a writer executing a critical section at the same time as readers or another writer. In other words, many of the assumptions (e.g., a variable cannot be modified after a check) in the critical sections are not safe anymore. The read-write locks are used in hypercalls (such as grant-table ones), so a malicious guest could exploit the race. For instance, there is a small window where Xen can leak memory if XENMAPSPACE_grant_table is used concurrently. A malicious guest may be able to leak memory, or cause a hypervisor crash resulting in a Denial of Service (DoS). Information leak and privilege escalation cannot be excluded.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 21.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-11739",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-11739"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2020 Canonical Ltd.",
			"PublicDate": "2020-04-14 13:15:00 UTC",
			"Bug": null,
			"cve": {},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": [
				"https://ubuntu.com/security/CVE-2020-11739",
				"https://xenbits.xen.org/xsa/advisory-314.html",
				"http://www.openwall.com/lists/oss-security/2020/04/14/2",
				"http://xenbits.xen.org/xsa/advisory-314.html"
			]
		}
	},
	"notes": {
		"Note": "mdeslaur> hypervisor packages are in universe. For issues in the hypervisor, add appropriate tags to each section, ex: Tags_xen: universe-binary"
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.impish:tst:2018104710000000",
				"comment": "xen package in impish is affected and may need fixing."
			}
		]
	}
}
