{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2024434070000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-43407 on Ubuntu Pro FIPS-updates 22.04 LTS (jammy) - medium",
		"description": "CKEditor4 is an open source what-you-see-is-what-you-get HTML editor. Apotential vulnerability has been discovered in CKEditor 4 Code SnippetGeSHi plugin. The vulnerability allowed a reflected XSS attack byexploiting a flaw in the GeSHi syntax highlighter library hosted by thevictim. The GeSHi library was included as a vendor dependency in CKEditor 4source files. In a specific scenario, an attacker could craft a maliciousscript that could be executed by sending a request to the GeSHi libraryhosted on a PHP web server. The GeSHi library is no longer activelymaintained. Due to the lack of ongoing support and updates, potentialsecurity vulnerabilities have been identified with its continued use. Tomitigate these risks and enhance the overall security of the CKEditor 4, wehave decided to completely remove the GeSHi library as a dependency. Thischange aims to maintain a secure environment and reduce the risk of anysecurity incidents related to outdated or unsupported software. The fix isbe available in version 4.25.0-lts.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS-updates 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-43407",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-43407"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-08-21 15:15:00 UTC",
			"cve": {
				"text": "CVE-2024-43407",
				"href": "https://ubuntu.com/security/CVE-2024-43407",
				"public": "20240821",
				"cvss_score": "6.1",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2024434070000000",
						"comment": "geshi package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
