{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:202401310000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-0131 on Ubuntu Pro FIPS-updates 22.04 LTS (jammy) - medium",
		"description": "NVIDIA GPU kernel driver for Windows and Linux contains a vulnerabilitywhere a potential user-mode attacker could read  a buffer with an incorrectlength. A successful exploit of this vulnerability might lead to denial ofservice.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS-updates 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-0131",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-0131"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2025 Canonical Ltd.",
			"public_date": "2025-02-02 01:15:00 UTC",
			"cve": {
				"text": "CVE-2024-0131",
				"href": "https://ubuntu.com/security/CVE-2024-0131",
				"public": "20250202"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2022218130000000",
						"comment": "nvidia-graphics-drivers-390: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2022218130000010",
						"comment": "nvidia-graphics-drivers-418-server: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202110760000020",
						"comment": "nvidia-graphics-drivers-430: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202110760000030",
						"comment": "nvidia-graphics-drivers-440: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2022218130000020",
						"comment": "nvidia-graphics-drivers-450: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023310180000000",
						"comment": "nvidia-graphics-drivers-450-server: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202110760000060",
						"comment": "nvidia-graphics-drivers-455: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2022218130000040",
						"comment": "nvidia-graphics-drivers-460: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202401260000000",
						"comment": "nvidia-graphics-drivers-470: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202401260000010",
						"comment": "nvidia-graphics-drivers-470-server: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202301800000030",
						"comment": "nvidia-graphics-drivers-510: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023255160000030",
						"comment": "nvidia-graphics-drivers-515: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023255160000040",
						"comment": "nvidia-graphics-drivers-515-server: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202301800000060",
						"comment": "nvidia-graphics-drivers-520: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023255160000070",
						"comment": "nvidia-graphics-drivers-530: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202401260000020",
						"comment": "nvidia-graphics-drivers-535 package in jammy is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202401310000000",
						"comment": "nvidia-graphics-drivers-535-server package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
