{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2021412810000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-41281 on Ubuntu Pro FIPS-updates 22.04 LTS (jammy) - medium",
		"description": "Synapse is a package for Matrix homeservers written in Python 3/Twisted.Prior to version 1.47.1, Synapse instances with the media repositoryenabled can be tricked into downloading a file from a remote server into anarbitrary directory. No authentication is required for the affectedendpoint. The last 2 directories and file name of the path are chosenrandomly by Synapse and cannot be controlled by an attacker, which limitsthe impact. Homeservers with the media repository disabled are unaffected.Homeservers with a federation whitelist are also unaffected, since Synapsewill check the remote hostname, including the trailing `../`s, against thewhitelist. Server administrators should upgrade to 1.47.1 or later. Serveradministrators using a reverse proxy could, at the expense of losing mediafunctionality, may block the certain endpoints as a workaround.Alternatively, non-containerized deployments can be adapted to use thehardened systemd config.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS-updates 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-41281",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-41281"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-11-23 20:15:00 UTC",
			"cve": {
				"text": "CVE-2021-41281",
				"href": "https://ubuntu.com/security/CVE-2021-41281",
				"public": "20211123",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2020262570000000",
						"comment": "matrix-synapse package in jammy is affected and needs fixing."
					}
				]
			}
		]
	}
}
