{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2021412530000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-41253 on Ubuntu Pro FIPS-updates 22.04 LTS (jammy) - medium",
		"description": "Zydis is an x86/x86-64 disassembler library. Users of Zydis versions v3.2.0and older that use the string functions provided in `zycore` in order toappend untrusted user data to the formatter buffer within their customformatter hooks can run into heap buffer overflows. Older versions of Zydisfailed to properly initialize the string object within the formatterbuffer, forgetting to initialize a few fields, leaving their value tochance. This could then in turn cause zycore functions like`ZyanStringAppend` to make incorrect calculations for the new target size,resulting in heap memory corruption. This does not affect the regularuncustomized Zydis formatter, because Zydis internally doesn't use thestring functions in zycore that act upon these fields. However, because thezycore string functions are the intended way to work with the formatterbuffer for users of the library that wish to extend the formatter, we stillconsider this to be a vulnerability in Zydis. This bug is patched startingin version 3.2.1. As a workaround, users may refrain from using zycorestring functions in their formatter hooks until updating to a patchedversion.\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2021-41253` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nlibzydis3.2 - 3.2.1-1\nzydis-tools - 3.2.1-1\nNo subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS-updates 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-41253",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-41253"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-11-08 22:15:00 UTC",
			"bug": [
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=999431"
			],
			"cve": {
				"text": "CVE-2021-41253",
				"href": "https://ubuntu.com/security/CVE-2021-41253",
				"public": "20211108",
				"cvss_score": "8.1",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:201771770000000",
						"comment": "zydis package in jammy, is related to the CVE in some way and has been fixed (note: '3.2.1-1')."
					}
				]
			}
		]
	}
}
