{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2024109760000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-10976 on Ubuntu Pro FIPS-updates 22.04 LTS (jammy) - medium",
		"description": "Incomplete tracking in PostgreSQL of tables with row security allows areused query to view or change different rows from those intended.CVE-2023-2455 and CVE-2016-2193 fixed most interaction between row securityand user ID changes.  They missed cases where a subquery, WITH query,security invoker view, or SQL-language function references a table with arow-level security policy.  This has the same consequences as the twoearlier CVEs.  That is to say, it leads to potentially incorrect policiesbeing applied in cases where role-specific policies are used and a givenquery is planned under one role and then executed under other roles.  Thisscenario can happen under security definer functions or when a common userand query is planned initially and then re-used across multiple SET ROLEs.Applying an incorrect policy may permit a user to completeotherwise-forbidden reads and modifications.  This affects only databasesthat have used CREATE POLICY to define a row security policy.  An attackermust tailor an attack to a particular application's pattern of query planreuse, user ID changes, and role-specific row security policies.  Versionsbefore PostgreSQL 17.1, 16.5, 15.9, 14.14, 13.17, and 12.21 are affected.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS-updates 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-10976",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-10976"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-11-14 13:15:00 UTC",
			"cve": {
				"text": "CVE-2024-10976",
				"href": "https://ubuntu.com/security/CVE-2024-10976",
				"public": "20241114"
			},
			"assigned_to": "mdeslaur(main)"
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2024109760000000",
						"comment": "postgresql-14 package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
