{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2022418820000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-41882 on Ubuntu Pro FIPS-updates 22.04 LTS (jammy) - medium",
		"description": "The Nextcloud Desktop Client is a tool to synchronize files from NextcloudServer with your computer. In version 3.6.0, if a user received a maliciousfile share and has it synced locally or the virtual filesystem enabled andclicked a nc://open/ link it will open the default editor for the file typeof the shared file, which on Windows can also sometimes mean that a filedepending on the type, e.g. \"vbs\", is being executed. It is recommendedthat the Nextcloud Desktop client is upgraded to version 3.6.1. As aworkaround, users can block the Nextcloud Desktop client 3.6.0 by settingthe `minimum.supported.desktop.version` system config to `3.6.1` on theserver, so new files designed to use this attack vector are not downloadedanymore. Already existing files can still be used. Another workaround wouldbe to enforce shares to be accepted by setting the`sharing.force_share_accept` system config to `true` on the server, so newfiles designed to use this attack vector are not downloaded anymore.Already existing shares can still be abused.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS-updates 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-41882",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2022-41882"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-11-11 19:15:00 UTC",
			"cve": {
				"text": "CVE-2022-41882",
				"href": "https://ubuntu.com/security/CVE-2022-41882",
				"public": "20221111",
				"cvss_score": "7.8",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2021228790000000",
						"comment": "nextcloud-desktop package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
