{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2024517440000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-51744 on Ubuntu Pro FIPS-updates 22.04 LTS (jammy) - medium",
		"description": "golang-jwt is a Go implementation of JSON Web Tokens. Unclear documentationof the error behavior in `ParseWithClaims` can lead to situation whereusers are potentially not checking errors in the way they should be.Especially, if a token is both expired and invalid, the errors returned by`ParseWithClaims` return both error codes. If users only check for the`jwt.ErrTokenExpired ` using `error.Is`, they will ignore the embedded`jwt.ErrTokenSignatureInvalid` and thus potentially accept invalid tokens.A fix has been back-ported with the error handling logic from the `v5`branch to the `v4` branch. In this logic, the `ParseWithClaims` functionwill immediately return in \"dangerous\" situations (e.g., an invalidsignature), limiting the combined errors only to situations where thesignature is valid, but further validation failed (e.g., if the signatureis valid, but is expired AND has the wrong audience). This fix is part ofthe 4.5.1 release. We are aware that this changes the behaviour of anestablished function and is not 100 % backwards compatible, so updating to4.5.1 might break your code. In case you cannot update to 4.5.0, pleasemake sure that you are properly checking for all errors (\"dangerous\" onesfirst), so that you are not running in the case detailed above.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS-updates 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-51744",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-51744"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-11-04 22:15:00 UTC",
			"cve": {
				"text": "CVE-2024-51744",
				"href": "https://ubuntu.com/security/CVE-2024-51744",
				"public": "20241104"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2024517440000000",
						"comment": "golang-github-golang-jwt-jwt package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
