{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2023528790000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-52879 on Ubuntu 16.04 LTS (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:tracing: Have trace_event_file have ref counters The following can crashthe kernel: # cd /sys/kernel/tracing # echo 'p:sched schedule' >kprobe_events # exec 5>>events/kprobes/sched/enable # > kprobe_events #exec 5>&- The above commands: 1. Change directory to the tracefs directory2. Create a kprobe event (doesn't matter what one) 3. Open bash filedescriptor 5 on the enable file of the kprobe event 4. Delete the kprobeevent (removes the files too) 5. Close the bash file descriptor 5 The abovecauses a crash! BUG: kernel NULL pointer dereference, address:0000000000000028 #PF: supervisor read access in kernel mode #PF:error_code(0x0000) - not-present page PGD 0 P4D 0 Oops: 0000 [#1] PREEMPTSMP PTI CPU: 6 PID: 877 Comm: bash Not tainted6.5.0-rc4-test-00008-g2c6b6b1029d4-dirty #186 Hardware name: QEMU StandardPC (Q35 + ICH9, 2009), BIOS 1.16.2-debian-1.16.2-1 04/01/2014 RIP:0010:tracing_release_file_tr+0xc/0x50 What happens here is that the kprobeevent creates a trace_event_file \"file\" descriptor that represents the filein tracefs to the event. It maintains state of the event (is it enabled forthe given instance?). Opening the \"enable\" file gets a reference to theevent \"file\" descriptor via the open file descriptor. When the kprobe eventis deleted, the file is also deleted from the tracefs system which alsofrees the event \"file\" descriptor. But as the tracefs file is still openedby user space, it will not be totally removed until the final dput() iscalled on it. But this is not true with the event \"file\" descriptor that isalready freed. If the user does a write to or simply closes the filedescriptor it will reference the event \"file\" descriptor that was justfreed, causing a use-after-free bug. To solve this, add a ref count to theevent \"file\" descriptor as well as a new flag called \"FREED\". The \"file\"will not be freed until the last reference is released. But the FREE flagwill be set when the event is removed to prevent any more modifications tothat event from happening, even if there's still a reference to the event\"file\" descriptor.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-52879",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-52879"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-21 16:15:00 UTC",
			"cve": {
				"text": "CVE-2023-52879",
				"href": "https://ubuntu.com/security/CVE-2023-52879",
				"public": "20240521"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000000",
						"comment": "linux package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000040",
						"comment": "linux-hwe package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000070",
						"comment": "linux-kvm package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000030",
						"comment": "linux-aws package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000080",
						"comment": "linux-aws-hwe package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000050",
						"comment": "linux-azure package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000060",
						"comment": "linux-gcp package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000090",
						"comment": "linux-oracle package in xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
