{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2023525010000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-52501 on Ubuntu 16.04 LTS (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:ring-buffer: Do not attempt to read past \"commit\" When iterating over thering buffer while the ring buffer is active, the writer can corrupt thereader. There's barriers to help detect this and handle it, but that codemissed the case where the last event was at the very end of the page andhas only 4 bytes left. The checks to detect the corruption by the writer toreads needs to see the length of the event. If the length in the first 4bytes is zero then the length is stored in the second 4 bytes. But if thewriter is in the process of updating that code, there's a small windowwhere the length in the first 4 bytes could be zero even though the lengthis only 4 bytes. That will cause rb_event_length() to read the next 4 byteswhich could happen to be off the allocated page. To protect against this,fail immediately if the next event pointer is less than 8 bytes from theend of the commit (last byte of data), as all events must be a minimum of 8bytes anyway.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-52501",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-52501"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-03-02 22:15:00 UTC",
			"cve": {
				"text": "CVE-2023-52501",
				"href": "https://ubuntu.com/security/CVE-2023-52501",
				"public": "20240302"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000000",
						"comment": "linux package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000040",
						"comment": "linux-hwe package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000070",
						"comment": "linux-kvm package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000030",
						"comment": "linux-aws package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000080",
						"comment": "linux-aws-hwe package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000050",
						"comment": "linux-azure package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000060",
						"comment": "linux-gcp package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000090",
						"comment": "linux-oracle package in xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
