{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2021469900000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-46990 on Ubuntu 16.04 LTS (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:powerpc/64s: Fix crashes when toggling entry flush barrier The entry flushmitigation can be enabled/disabled at runtime via a debugfs file(entry_flush), which causes the kernel to patch itself to enable/disablethe relevant mitigations. However depending on which mitigation we'reusing, it may not be safe to do that patching while other CPUs are active.For example the following crash: sleeper[15639]: segfault (11) atc000000000004c20 nip c000000000004c20 lr c000000000004c20 Shows that wereturned to userspace with a corrupted LR that points into the kernel, dueto executing the partially patched call to the fallback entry flush (ie. wemissed the LR restore). Fix it by doing the patching under stop machine.The CPUs that aren't doing the patching will be spinning in the core of thestop machine logic. That is currently sufficient for our purposes, becausenone of the patching we do is to that code or anywhere in the vicinity.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-46990",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46990"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-02-28 09:15:00 UTC",
			"cve": {
				"text": "CVE-2021-46990",
				"href": "https://ubuntu.com/security/CVE-2021-46990",
				"public": "20240228"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000000",
						"comment": "linux: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000040",
						"comment": "linux-hwe package in xenial is affected. An update containing the fix has been completed and is pending publication (note: '4.15.0-151.157~16.04.1')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000070",
						"comment": "linux-kvm: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000030",
						"comment": "linux-aws: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000080",
						"comment": "linux-aws-hwe package in xenial is affected. An update containing the fix has been completed and is pending publication (note: '4.15.0-1109.116~16.04.1')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000050",
						"comment": "linux-azure package in xenial is affected. An update containing the fix has been completed and is pending publication (note: '4.15.0-1121.134~16.04.1')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000060",
						"comment": "linux-gcp package in xenial is affected. An update containing the fix has been completed and is pending publication (note: '4.15.0-1106.120~16.04.1')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:200767620000010",
						"comment": "linux-gke: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000090",
						"comment": "linux-oracle package in xenial is affected. An update containing the fix has been completed and is pending publication (note: '4.15.0-1078.86~16.04.1')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:200767620000030",
						"comment": "linux-oem: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000010",
						"comment": "linux-raspi2: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000020",
						"comment": "linux-snapdragon: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
