{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2023359460000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2023-35946 on Ubuntu 16.04 LTS (xenial) - medium",
		"Description": "Gradle is a build tool with a focus on build automation and support formulti-language development. When Gradle writes a dependency into itsdependency cache, it uses the dependency's coordinates to compute a filelocation. With specially crafted dependency coordinates, Gradle can be madeto write files into an unintended location. The file may be written outsidethe dependency cache or over another file in the dependency cache. Thisvulnerability could be used to poison the dependency cache or overwriteimportant files elsewhere on the filesystem where the Gradle process haswrite permissions. Exploiting this vulnerability requires an attacker tohave control over a dependency repository used by the Gradle build or havethe ability to modify the build's configuration. It is unlikely that thiswould go unnoticed. A fix has been released in Gradle 7.6.2 and 8.2 toprotect against this vulnerability. Gradle will refuse to cachedependencies that have path traversal elements in their dependencycoordinates. It is recommended that users upgrade to a patched version. Ifyou are unable to upgrade to Gradle 7.6.2 or 8.2, `dependency verification`will make this vulnerability more difficult to exploit.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-35946",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-35946"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2023 Canonical Ltd.",
			"PublicDate": "2023-06-30 21:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2023-35946",
				"href": "https://ubuntu.com/security/CVE-2023-35946",
				"public": "20230630",
				"cvss_score": "5.5",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:N"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201661990000000",
						"comment": "gradle: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
