{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2024266290000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26629 on Ubuntu 16.04 LTS (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: nfsd:fix RELEASE_LOCKOWNER The test on so_count in nfsd4_release_lockowner() isnonsense and harmful. Revert to using check_for_locks(), changing that tonot sleep. First: harmful. As is documented in the kdoc comment fornfsd4_release_lockowner(), the test on so_count can transiently return afalse positive resulting in a return of NFS4ERR_LOCKS_HELD when in fact nolocks are held. This is clearly a protocol violation and with the Linux NFSclient it can cause incorrect behaviour. If RELEASE_LOCKOWNER is sent whilesome other thread is still processing a LOCK request which failed because,at the time that request was received, the given owner held a conflictinglock, then the nfsd thread processing that LOCK request can hold areference (conflock) to the lock owner that causesnfsd4_release_lockowner() to return an incorrect error. The Linux NFSclient ignores that NFS4ERR_LOCKS_HELD error because it never sendsNFS4_RELEASE_LOCKOWNER without first releasing any locks, so it knows thatthe error is impossible. It assumes the lock owner was in fact released soit feels free to use the same lock owner identifier in some later lockingrequest. When it does reuse a lock owner identifier for which a previousRELEASE failed, it will naturally use a lock_seqid of zero. However theserver, which didn't release the lock owner, will expect a largerlock_seqid and so will respond with NFS4ERR_BAD_SEQID. So clearly it isharmful to allow a false positive, which testing so_count allows. The testis nonsense because ... well... it doesn't mean anything. so_count is thesum of three different counts. 1/ the set of states listed on so_stateids2/ the set of active vfs locks owned by any of those states 3/ varioustransient counts such as for conflicting locks. When it is tested against'2' it is clear that one of these is the transient reference obtained byfind_lockowner_str_locked(). It is not clear what the other one is expectedto be. In practice, the count is often 2 because there is precisely onestate on so_stateids. If there were more, this would fail. In my testing Isee two circumstances when RELEASE_LOCKOWNER is called. In one case, CLOSEis called before RELEASE_LOCKOWNER. That results in all the lock statesbeing removed, and so the lockowner being discarded (it is removed whenthere are no more references which usually happens when the lock state isdiscarded). When nfsd4_release_lockowner() finds that the lock ownerdoesn't exist, it returns success. The other case shows an so_count of '2'and precisely one state listed in so_stateid. It appears that the Linuxclient uses a separate lock owner for each file resulting in one lock stateper lock owner, so this test on '2' is safe. For another client it mightnot be safe. So this patch changes check_for_locks() to use the (newish)find_any_file_locked() so that it doesn't take a reference on the nfs4_fileand so never calls nfsd_file_put(), and so never sleeps. With this check isit safe to restore the use of check_for_locks() rather than testingso_count against the mysterious '2'.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26629",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-26629"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-03-13 14:15:00 UTC",
			"cve": {
				"text": "CVE-2024-26629",
				"href": "https://ubuntu.com/security/CVE-2024-26629",
				"public": "20240313"
			},
			"public_date_at_usn": "2024-03-13 14:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-6818-1",
				"https://ubuntu.com/security/notices/USN-6819-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000000",
						"comment": "linux package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000040",
						"comment": "linux-hwe package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000070",
						"comment": "linux-kvm package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000030",
						"comment": "linux-aws package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000080",
						"comment": "linux-aws-hwe package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000050",
						"comment": "linux-azure package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000060",
						"comment": "linux-gcp package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000090",
						"comment": "linux-oracle package in xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
