{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2021411740000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-41174 on Ubuntu 16.04 LTS (xenial) - medium",
		"description": "Grafana is an open-source platform for monitoring and observability. Inaffected versions if an attacker is able to convince a victim to visit aURL referencing a vulnerable page, arbitrary JavaScript content may beexecuted within the context of the victim's browser. The user visiting themalicious link must be unauthenticated and the link must be for a page thatcontains the login button in the menu bar. The url has to be crafted toexploit AngularJS rendering and contain the interpolation binding forAngularJS expressions. AngularJS uses double curly braces for interpolationbinding: {{ }} ex: {{constructor.constructor(‘alert(1)’)()}}. When the userfollows the link and the page renders, the login button will contain theoriginal link with a query parameter to force a redirect to the login page.The URL is not validated and the AngularJS rendering engine will executethe JavaScript expression contained in the URL. Users are advised toupgrade as soon as possible. If for some reason you cannot upgrade, you canuse a reverse proxy or similar to block access to block the literal string{{ in the path.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-41174",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-41174"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-11-03 18:15:00 UTC",
			"cve": {
				"text": "CVE-2021-41174",
				"href": "https://ubuntu.com/security/CVE-2021-41174",
				"public": "20211103",
				"cvss_score": "6.1",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201810008160000000",
						"comment": "grafana package in xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
