{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2024209180000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-20918 on Ubuntu 16.04 LTS (xenial) - medium",
		"description": "Vulnerability in the Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVMEnterprise Edition product of Oracle Java SE (component: Hotspot).Supported versions that are affected are Oracle Java SE: 8u391, 8u391-perf,11.0.21, 17.0.9, 21.0.1; Oracle GraalVM for JDK: 17.0.9, 21.0.1; OracleGraalVM Enterprise Edition: 20.3.12, 21.3.8 and 22.3.4. Difficult toexploit vulnerability allows unauthenticated attacker with network accessvia multiple protocols to compromise Oracle Java SE, Oracle GraalVM forJDK, Oracle GraalVM Enterprise Edition. Successful attacks of thisvulnerability can result in unauthorized creation, deletion or modificationaccess to critical data or all Oracle Java SE, Oracle GraalVM for JDK,Oracle GraalVM Enterprise Edition accessible data as well as unauthorizedaccess to critical data or complete access to all Oracle Java SE, OracleGraalVM for JDK, Oracle GraalVM Enterprise Edition accessible data. Note:This vulnerability can be exploited by using APIs in the specifiedComponent, e.g., through a web service which supplies data to the APIs.This vulnerability also applies to Java deployments, typically in clientsrunning sandboxed Java Web Start applications or sandboxed Java applets,that load and run untrusted code (e.g., code that comes from the internet)and rely on the Java sandbox for security. CVSS 3.1 Base Score 7.4(Confidentiality and Integrity impacts). CVSS Vector:(CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-20918",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-20918"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-01-16 22:15:00 UTC",
			"cve": {
				"text": "CVE-2024-20918",
				"href": "https://ubuntu.com/security/CVE-2024-20918",
				"public": "20240116",
				"cvss_score": "7.4",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201548520000010",
						"comment": "openjdk-8 package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2017102740000000",
						"comment": "openjdk-9: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'no longer supported by upstream')."
					}
				]
			}
		]
	}
}
