{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2021474650000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-47465 on Ubuntu 16.04 LTS (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:KVM: PPC: Book3S HV: Fix stack handling in idle_kvm_start_guest()In commit 10d91611f426 (\"powerpc/64s: Reimplement book3s idle code inC\") kvm_start_guest() became idle_kvm_start_guest(). The old codeallocated a stack frame on the emergency stack, but didn't use theframe to store anything, and also didn't store anything in its caller'sframe.idle_kvm_start_guest() on the other hand is written more like a normal Cfunction, it creates a frame on entry, and also stores CR/LR into itscallers frame (per the ABI). The problem is that there is no callerframe on the emergency stack.The emergency stack for a given CPU is allocated with:  paca_ptrs[i]->emergency_sp = alloc_stack(limit, i) + THREAD_SIZE;So emergency_sp actually points to the first address above the emergencystack allocation for a given CPU, we must not store above it withoutfirst decrementing it to create a frame. This is different to theregular kernel stack, paca->kstack, which is initialised to point at aninitial frame that is ready to use.idle_kvm_start_guest() stores the backchain, CR and LR all of whichwrite outside the allocation for the emergency stack. It then creates astack frame and saves the non-volatile registers. Unfortunately theframe it creates is not large enough to fit the non-volatiles, and sothe saving of the non-volatile registers also writes outside theemergency stack allocation.The end result is that we corrupt whatever is at 0-24 bytes, and 112-248bytes above the emergency stack allocation.In practice this has gone unnoticed because the memory immediately abovethe emergency stack happens to be used for other stack allocations,either another CPUs mc_emergency_sp or an IRQ stack. See the order ofcalls to irqstack_early_init() and emergency_stack_init().The low addresses of another stack are the top of that stack, and so areonly used if that stack is under extreme pressue, which essentiallynever happens in practice - and if it did there's a high likelyhood we'dcrash due to that stack overflowing.Still, we shouldn't be corrupting someone else's stack, and it is purelyluck that we aren't corrupting something else.To fix it we save CR/LR into the caller's frame using the existing r1 onentry, we then create a SWITCH_FRAME_SIZE frame (which has space forpt_regs) on the emergency stack with the backchain pointing to theexisting stack, and then finally we switch to the new frame on theemergency stack.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-47465",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-47465"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-23",
			"cve": {
				"text": "CVE-2021-47465",
				"href": "https://ubuntu.com/security/CVE-2021-47465",
				"public": "20240523"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000000",
						"comment": "linux package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000040",
						"comment": "linux-hwe package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000070",
						"comment": "linux-kvm package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000030",
						"comment": "linux-aws package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000080",
						"comment": "linux-aws-hwe package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000050",
						"comment": "linux-azure package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000060",
						"comment": "linux-gcp package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000090",
						"comment": "linux-oracle package in xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
