{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2017140990000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2017-14099 on Ubuntu 16.04 LTS (xenial) - low",
		"description": "In res/res_rtp_asterisk.c in Asterisk 11.x before 11.25.2, 13.x before13.17.1, and 14.x before 14.6.1 and Certified Asterisk 11.x before11.6-cert17 and 13.x before 13.13-cert5, unauthorized data disclosure(media takeover in the RTP stack) is possible with careful timing by anattacker. The \"strictrtp\" option in rtp.conf enables a feature of the RTPstack that learns the source address of media for a session and drops anypackets that do not originate from the expected address. This option isenabled by default in Asterisk 11 and above. The \"nat\" and \"rtp_symmetric\"options (for chan_sip and chan_pjsip, respectively) enable symmetric RTPsupport in the RTP stack. This uses the source address of incoming media asthe target address of any sent media. This option is not enabled bydefault, but is commonly enabled to handle devices behind NAT. A change wasmade to the strict RTP support in the RTP stack to better tolerate latemedia when a reinvite occurs. When combined with the symmetric RTP support,this introduced an avenue where media could be hijacked. Instead of onlylearning a new address when expected, the new code allowed a new sourceaddress to be learned at all times. If a flood of RTP traffic was received,the strict RTP support would allow the new address to provide media, and(with symmetric RTP enabled) outgoing traffic would be sent to this newaddress, allowing the media to be hijacked. Provided the attacker continuedto send traffic, they would continue to receive traffic as well.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2017-14099",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-14099"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2017 Canonical Ltd.",
			"public_date": "2017-09-02 16:29:00 UTC",
			"bug": [
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=873907"
			],
			"cve": {
				"text": "CVE-2017-14099",
				"href": "https://ubuntu.com/security/CVE-2017-14099",
				"public": "20170902",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201530080000000",
						"comment": "asterisk: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needed')."
					}
				]
			}
		]
	}
}
