{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2023395130000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-39513 on Ubuntu 16.04 LTS (xenial) - medium",
		"description": "Cacti is an open source operational monitoring and fault managementframework. Affected versions are subject to a Stored Cross-Site-Scripting(XSS) Vulnerability which allows an authenticated user to poison datastored in the _cacti_'s database. These data will be viewed byadministrative _cacti_ accounts and execute JavaScript code in the victim'sbrowser at view-time. The script under `host.php` is used to monitor andmanage hosts in the _cacti_ app, hence displays useful information such asdata queries and verbose logs. _CENSUS_ found that an adversary that isable to configure a data-query template with malicious code appended in thetemplate path, in order to deploy a stored XSS attack against any user withthe _General Administration>Sites/Devices/Data_ privileges. A user thatpossesses the _Template Editor>Data Queries_ permissions can configure thedata query template path in _cacti_. Please note that such a user may be alow privileged user. This configuration occurs through`http://<HOST>/cacti/data_queries.php` by editing an existing or adding anew data query template. If a template is linked to a device then theformatted template path will be rendered in the device's management page,when a _verbose data query_ is requested. This vulnerability has beenaddressed in version 1.2.25. Users are advised to upgrade. Users unable toupdate should manually filter HTML output.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-39513",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-39513"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-09-05 21:15:00 UTC",
			"cve": {
				"text": "CVE-2023-39513",
				"href": "https://ubuntu.com/security/CVE-2023-39513",
				"public": "20230905",
				"cvss_score": "5.4",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:L/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2017166410000000",
						"comment": "cacti package in xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
