{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2024358730000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-35873 on Ubuntu 16.04 LTS (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:riscv: Fix vector state restore in rt_sigreturn()The RISC-V Vector specification states in \"Appendix D: CallingConvention for Vector State\" [1] that \"Executing a system call causesall caller-saved vector registers (v0-v31, vl, vtype) and vstart tobecome unspecified.\". In the RISC-V kernel this is called \"discardingthe vstate\".Returning from a signal handler via the rt_sigreturn() syscall, vectordiscard is also performed. However, this is not an issue since thevector state should be restored from the sigcontext, and therefore notcare about the vector discard.The \"live state\" is the actual vector register in the running context,and the \"vstate\" is the vector state of the task. A dirty live state,means that the vstate and live state are not in synch.When vectorized user_from_copy() was introduced, an bug sneaked in atthe restoration code, related to the discard of the live state.An example when this go wrong:  1. A userland application is executing vector code  2. The application receives a signal, and the signal handler is     entered.  3. The application returns from the signal handler, using the     rt_sigreturn() syscall.  4. The live vector state is discarded upon entering the     rt_sigreturn(), and the live state is marked as \"dirty\", indicating     that the live state need to be synchronized with the current     vstate.  5. rt_sigreturn() restores the vstate, except the Vector registers,     from the sigcontext  6. rt_sigreturn() restores the Vector registers, from the sigcontext,     and now the vectorized user_from_copy() is used. The dirty live     state from the discard is saved to the vstate, making the vstate     corrupt.  7. rt_sigreturn() returns to the application, which crashes due to     corrupted vstate.Note that the vectorized user_from_copy() is invoked depending on thevalue of CONFIG_RISCV_ISA_V_UCOPY_THRESHOLD. Default is 768, whichmeans that vlen has to be larger than 128b for this bug to trigger.The fix is simply to mark the live state as non-dirty/clean priorperforming the vstate restore.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-35873",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-35873"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-19 09:15:00 UTC",
			"cve": {
				"text": "CVE-2024-35873",
				"href": "https://ubuntu.com/security/CVE-2024-35873",
				"public": "20240519"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000000",
						"comment": "linux package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000040",
						"comment": "linux-hwe package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000070",
						"comment": "linux-kvm package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000030",
						"comment": "linux-aws package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000080",
						"comment": "linux-aws-hwe package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000050",
						"comment": "linux-azure package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000060",
						"comment": "linux-gcp package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000090",
						"comment": "linux-oracle package in xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
