{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2021469890000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-46989 on Ubuntu 16.04 LTS (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:hfsplus: prevent corruption in shrinking truncateI believe there are some issues introduced by commit 31651c607151(\"hfsplus: avoid deadlock on file truncation\")HFS+ has extent records which always contains 8 extents.  In case thefirst extent record in catalog file gets full, new ones are allocated fromextents overflow file.In case shrinking truncate happens to middle of an extent record whichlocates in extents overflow file, the logic in hfsplus_file_truncate() waschanged so that call to hfs_brec_remove() is not guarded any more.Right action would be just freeing the extents that exceed the new sizeinside extent record by calling hfsplus_free_extents(), and then check ifthe whole extent record should be removed.  However since the guard(blk_cnt > start) is now after the call to hfs_brec_remove(), this hasunfortunate effect that the last matching extent record is removedunconditionally.To reproduce this issue, create a file which has at least 10 extents, andthen perform shrinking truncate into middle of the last extent record, sothat the number of remaining extents is not under or divisible by 8.  Thiscauses the last extent record (8 extents) to be removed totally instead oftruncating into middle of it.  Thus this causes corruption, and lost data.Fix for this is simply checking if the new truncated end is below thestart of this extent record, making it safe to remove the full extentrecord.  However call to hfs_brec_remove() can't be moved to it's previousplace since we're dropping ->tree_lock and it can cause a race conditionand the cached info being invalidated possibly corrupting the node data.Another issue is related to this one.  When entering into the block(blk_cnt > start) we are not holding the ->tree_lock.  We break out fromthe loop not holding the lock, but hfs_find_exit() does unlock it.  Notsure if it's possible for someone else to take the lock under our feet,but it can cause hard to debug errors and premature unlocking.  Even ifthere's no real risk of it, the locking should still always be kept inbalance.  Thus taking the lock now just before the check.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-46989",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46989"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-02-29",
			"cve": {
				"text": "CVE-2021-46989",
				"href": "https://ubuntu.com/security/CVE-2021-46989",
				"public": "20240229"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000000",
						"comment": "linux package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000040",
						"comment": "linux-hwe package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000070",
						"comment": "linux-kvm package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000030",
						"comment": "linux-aws package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000080",
						"comment": "linux-aws-hwe package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000050",
						"comment": "linux-azure package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000060",
						"comment": "linux-gcp package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:200767620000010",
						"comment": "linux-gke: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000090",
						"comment": "linux-oracle package in xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:200767620000030",
						"comment": "linux-oem: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000010",
						"comment": "linux-raspi2: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000020",
						"comment": "linux-snapdragon: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
