{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2022417250000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2022-41725 on Ubuntu 16.04 LTS (xenial) - medium",
		"Description": "A denial of service is possible from excessive resource consumption innet/http and mime/multipart. Multipart form parsing withmime/multipart.Reader.ReadForm can consume largely unlimited amounts ofmemory and disk files. This also affects form parsing in the net/httppackage with the Request methods FormFile, FormValue, ParseMultipartForm,and PostFormValue. ReadForm takes a maxMemory parameter, and is documentedas storing \"up to maxMemory bytes +10MB (reserved for non-file parts) inmemory\". File parts which cannot be stored in memory are stored on disk intemporary files. The unconfigurable 10MB reserved for non-file parts isexcessively large and can potentially open a denial of service vector onits own. However, ReadForm did not properly account for all memory consumedby a parsed form, such as map entry overhead, part names, and MIME headers,permitting a maliciously crafted form to consume well over 10MB. Inaddition, ReadForm contained no limit on the number of disk files created,permitting a relatively small request body to create a large number of disktemporary files. With fix, ReadForm now properly accounts for various formsof memory overhead, and should now stay within its documented limit of 10MB+ maxMemory bytes of memory consumption. Users should still be aware thatthis limit is high and may still be hazardous. In addition, ReadForm nowcreates at most one on-disk temporary file, combining multiple form partsinto a single temporary file. The mime/multipart.File interface type'sdocumentation states, \"If stored on disk, the File's underlying concretetype will be an *os.File.\". This is no longer the case when a form containsmore than one file part, due to this coalescing of parts into a singlefile. The previous behavior of using distinct files for each form part maybe reenabled with the environment variable GODEBUG=multipartfiles=distinct.Users should be aware that multipart.ReadForm and the http.Request methodsthat call it do not limit the amount of disk consumed by temporary files.Callers can limit the size of form data with http.MaxBytesReader.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-41725",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-41725"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2023 Canonical Ltd.",
			"PublicDate": "2023-02-28 18:15:00 UTC",
			"Bug": [
				"https://go.dev/issue/58006"
			],
			"cve": {
				"text": "CVE-2022-41725",
				"href": "https://ubuntu.com/security/CVE-2022-41725",
				"public": "20230228",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
				"usns": "6140-1"
			},
			"PublicDateAtUsn": "2023-02-28 18:15:00 UTC",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": [
				"https://ubuntu.com/security/notices/USN-6140-1"
			]
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2021213340000000",
						"comment": "containerd: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
