{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2022311070000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-31107 on Ubuntu 16.04 LTS (xenial) - medium",
		"description": "Grafana is an open-source platform for monitoring and observability. Inversions 5.3 until 9.0.3, 8.5.9, 8.4.10, and 8.3.10, it is possible for amalicious user who has authorization to log into a Grafana instance via aconfigured OAuth IdP which provides a login name to take over the accountof another user in that Grafana instance. This can occur when the malicioususer is authorized to log in to Grafana via OAuth, the malicious user'sexternal user id is not already associated with an account in Grafana, themalicious user's email address is not already associated with an account inGrafana, and the malicious user knows the Grafana username of the targetuser. If these conditions are met, the malicious user can set theirusername in the OAuth provider to that of the target user, then go throughthe OAuth flow to log in to Grafana. Due to the way that external andinternal user accounts are linked together during login, if the conditionsabove are all met then the malicious user will be able to log in to thetarget user's Grafana account. Versions 9.0.3, 8.5.9, 8.4.10, and 8.3.10contain a patch for this issue. As a workaround, concerned users candisable OAuth login to their Grafana instance, or ensure that all usersauthorized to log in via OAuth have a corresponding user account in Grafanalinked to their email address.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-31107",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2022-31107"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-07-15 13:15:00 UTC",
			"cve": {
				"text": "CVE-2022-31107",
				"href": "https://ubuntu.com/security/CVE-2022-31107",
				"public": "20220715",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201810008160000000",
						"comment": "grafana package in xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
