{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2024477280000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-47728 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:bpf: Zero former ARG_PTR_TO_{LONG,INT} args in case of errorFor all non-tracing helpers which formerly had ARG_PTR_TO_{LONG,INT} asinputarguments, zero the value for the case of an error as otherwise it couldleakmemory. For tracing, it is not needed given CAP_PERFMON can already readallkernel memory anyway hence bpf_get_func_arg() and bpf_get_func_ret() isskippedin here.Also, the MTU helpers mtu_len pointer value is being written but also read.Technically, the MEM_UNINIT should not be there in order to always forceinit.Removing MEM_UNINIT needs more verifier rework though: MEM_UNINIT right nowimplies two things actually: i) write into memory, ii) memory does not haveto be initialized. If we lift MEM_UNINIT, it then becomes: i) read intomemory,ii) memory must be initialized. This means that for bpf_*_check_mtu() we'rereadding the issue we're trying to fix, that is, it would then be able towrite back into things like .rodata BPF maps. Follow-up work will reworktheMEM_UNINIT semantics such that the intent can be better expressed. For nowjust clear the *mtu_len on error path which can be lifted later again.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-47728",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-47728"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-10-22",
			"cve": {
				"text": "CVE-2024-47728",
				"href": "https://ubuntu.com/security/CVE-2024-47728",
				"public": "20241022"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000000",
						"comment": "linux package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000010",
						"comment": "linux-lts-xenial package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000020",
						"comment": "linux-aws package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000030",
						"comment": "linux-azure package in trusty is affected and may need fixing."
					}
				]
			}
		]
	}
}
