{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:202232040000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-3204 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "A vulnerability named 'Non-Responsive Delegation Attack' (NRDelegationAttack) has been discovered in various DNS resolving software. TheNRDelegation Attack works by having a malicious delegation with aconsiderable number of non responsive nameservers. The attack starts byquerying a resolver for a record that relies on those unresponsivenameservers. The attack can cause a resolver to spend a lot oftime/resources resolving records under a malicious delegation point where aconsiderable number of unresponsive NS records reside. It can trigger highCPU usage in some resolver implementations that continually look in thecache for resolved NS records in that delegation. This can lead to degradedperformance and eventually denial of service in orchestrated attacks.Unbound does not suffer from high CPU usage, but resources are still neededfor resolving the malicious delegation. Unbound will keep trying to resolvethe record until hard limits are reached. Based on the nature of the attackand the replies, different limits could be reached. From version 1.16.3 on,Unbound introduces fixes for better performance when under load, by cuttingopportunistic queries for nameserver discovery and DNSKEY prefetching andlimiting the number of times a delegation point can issue a cache lookupfor missing records.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-3204",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2022-3204"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-09-26 14:15:00 UTC",
			"cve": {
				"text": "CVE-2022-3204",
				"href": "https://ubuntu.com/security/CVE-2022-3204",
				"public": "20220926",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
				"usns": "5732-1"
			},
			"public_date_at_usn": "2022-09-26 14:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-5732-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:2020126620000000",
						"comment": "unbound package in trusty is affected and needs fixing."
					}
				]
			}
		]
	}
}
