{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:201926990000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2019-2699 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "Vulnerability in the Java SE component of Oracle Java SE (subcomponent:Windows DLL). The supported version that is affected is Java SE: 8u202.Difficult to exploit vulnerability allows unauthenticated attacker withnetwork access via multiple protocols to compromise Java SE. While thevulnerability is in Java SE, attacks may significantly impact additionalproducts. Successful attacks of this vulnerability can result in takeoverof Java SE. Note: This vulnerability applies to Java deployments, typicallyin clients running sandboxed Java Web Start applications or sandboxed Javaapplets (in Java SE 8), that load and run untrusted code (e.g., code thatcomes from the internet) and rely on the Java sandbox for security. Thisvulnerability can also be exploited by using APIs in the specifiedComponent, e.g., through a web service which supplies data to the APIs.CVSS 3.0 Base Score 9.0 (Confidentiality, Integrity and Availabilityimpacts). CVSS Vector: (CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H).",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2019-2699",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2019-2699"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2019 Canonical Ltd.",
			"public_date": "2019-04-23 19:32:00 UTC",
			"cve": {
				"text": "CVE-2019-2699",
				"href": "https://ubuntu.com/security/CVE-2019-2699",
				"public": "20190423",
				"cvss_score": "9.0",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201253730000000",
						"comment": "openjdk-6: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201366290000000",
						"comment": "openjdk-7: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201552360000000",
						"comment": "icedtea-web: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
