{
	"class": "patch",
	"id": "oval:com.ubuntu.jammy:def:60311000000",
	"version": "1",
	"metadata": {
		"title": "USN-6031-1 -- Linux kernel (OEM) vulnerabilities",
		"description": "It was discovered that the Traffic-Control Index (TCINDEX) implementation in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-1281)  It was discovered that the Integrity Measurement Architecture (IMA) implementation in the Linux kernel did not properly enforce policy in certain conditions. A privileged attacker could use this to bypass Kernel lockdown restrictions. (CVE-2022-21505)  It was discovered that the infrared transceiver USB driver did not properly handle USB control messages. A local attacker with physical access could plug in a specially crafted USB device to cause a denial of service (memory exhaustion). (CVE-2022-3903)  It was discovered that a race condition existed in the SMSC UFX USB driver implementation in the Linux kernel, leading to a use-after-free vulnerability. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-41849)  Gerald Lee discovered that the USB Gadget file system implementation in the Linux kernel contained a race condition, leading to a use-after-free vulnerability in some situations. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-4382)  It was discovered that a memory leak existed in the SCTP protocol implementation in the Linux kernel. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2023-1074)  Mingi Cho discovered that the netfilter subsystem in the Linux kernel did not properly initialize a data structure, leading to a null pointer dereference vulnerability. An attacker could use this to cause a denial of service (system crash). (CVE-2023-1095)  It was discovered that the RNDIS USB driver in the Linux kernel contained an integer overflow vulnerability. A local attacker with physical access could plug in a malicious USB device to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-23559)  It was discovered that the NTFS file system implementation in the Linux kernel did not properly validate attributes in certain situations, leading to an out-of-bounds read vulnerability. A local attacker could possibly use this to expose sensitive information (kernel memory). (CVE-2023-26607)  Duoming Zhou discovered that a race condition existed in the infrared receiver/transceiver driver in the Linux kernel, leading to a use-after- free vulnerability. A privileged attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-1118)  Update Instructions:  Run `sudo pro fix USN-6031-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-modules-iwlwifi-5.17.0-1030-oem - 5.17.0-1030.31 linux-image-unsigned-5.17.0-1030-oem - 5.17.0-1030.31 linux-oem-5.17-tools-host - 5.17.0-1030.31 linux-buildinfo-5.17.0-1030-oem - 5.17.0-1030.31 linux-oem-5.17-tools-5.17.0-1030 - 5.17.0-1030.31 linux-image-5.17.0-1030-oem - 5.17.0-1030.31 linux-tools-5.17.0-1030-oem - 5.17.0-1030.31 linux-headers-5.17.0-1030-oem - 5.17.0-1030.31 linux-modules-ipu6-5.17.0-1030-oem - 5.17.0-1030.31 linux-modules-ivsc-5.17.0-1030-oem - 5.17.0-1030.31 linux-modules-5.17.0-1030-oem - 5.17.0-1030.31 linux-oem-5.17-headers-5.17.0-1030 - 5.17.0-1030.31 No subscription required  linux-modules-ipu6-oem-22.04 - 5.17.0.1030.28 linux-headers-oem-22.04a - 5.17.0.1030.28 linux-modules-iwlwifi-oem-22.04 - 5.17.0.1030.28 linux-modules-ivsc-oem-22.04a - 5.17.0.1030.28 linux-modules-iwlwifi-oem-22.04a - 5.17.0.1030.28 linux-image-oem-22.04 - 5.17.0.1030.28 linux-modules-ivsc-oem-22.04 - 5.17.0.1030.28 linux-image-oem-22.04a - 5.17.0.1030.28 linux-oem-22.04 - 5.17.0.1030.28 linux-tools-oem-22.04a - 5.17.0.1030.28 linux-tools-oem-22.04 - 5.17.0.1030.28 linux-headers-oem-22.04 - 5.17.0.1030.28 linux-modules-ipu6-oem-22.04a - 5.17.0.1030.28 linux-oem-22.04a - 5.17.0.1030.28 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6031-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6031-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-04-19"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:603110000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
