{
	"class": "patch",
	"id": "oval:com.ubuntu.jammy:def:70153000000",
	"version": "1",
	"metadata": {
		"title": "USN-7015-3 -- Python vulnerability",
		"description": "USN-7015-1 fixed several vulnerabilities in Python. This update provides the corresponding updates for CVE-2023-27043 for python2.7 in Ubuntu 16.04 LTS, Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, and Ubuntu 22.04 LTS, and for python3.5 in Ubuntu 16.04 LTS.  Original advisory details:   It was discovered that the Python email module incorrectly parsed email  addresses that contain special characters. A remote attacker could  possibly use this issue to bypass certain protection mechanisms.  (CVE-2023-27043)    It was discovered that Python allowed excessive backtracking while parsing  certain tarfile headers. A remote attacker could possibly use this issue  to cause Python to consume resources, leading to a denial of service.  (CVE-2024-6232)    It was discovered that the Python email module incorrectly quoted newlines  for email headers. A remote attacker could possibly use this issue to  perform header injection. (CVE-2024-6923)    It was discovered that the Python http.cookies module incorrectly handled  parsing cookies that contained backslashes for quoted characters. A remote  attacker could possibly use this issue to cause Python to consume  resources, leading to a denial of service. (CVE-2024-7592)    It was discovered that the Python zipfile module incorrectly handled  certain malformed zip files. A remote attacker could possibly use this  issue to cause Python to stop responding, resulting in a denial of  service. (CVE-2024-8088)  Update Instructions:  Run `sudo pro fix USN-7015-3` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  idle-python2.7 - 2.7.18-13ubuntu1.2+esm3 libpython2.7 - 2.7.18-13ubuntu1.2+esm3 libpython2.7-dev - 2.7.18-13ubuntu1.2+esm3 libpython2.7-minimal - 2.7.18-13ubuntu1.2+esm3 libpython2.7-stdlib - 2.7.18-13ubuntu1.2+esm3 libpython2.7-testsuite - 2.7.18-13ubuntu1.2+esm3 python2.7 - 2.7.18-13ubuntu1.2+esm3 python2.7-dev - 2.7.18-13ubuntu1.2+esm3 python2.7-doc - 2.7.18-13ubuntu1.2+esm3 python2.7-examples - 2.7.18-13ubuntu1.2+esm3 python2.7-minimal - 2.7.18-13ubuntu1.2+esm3 Available with Ubuntu Pro: https://ubuntu.com/pro",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-7015-3",
				"ref_url": "https://ubuntu.com/security/notices/USN-7015-3"
			},
			{
				"source": "CVE",
				"ref_id": "CVE-2023-27043",
				"ref_url": "https://ubuntu.com/security/CVE-2023-27043"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "Medium",
			"issued": {
				"date": "2024-10-01"
			},
			"cve": [
				{
					"text": "CVE-2023-27043",
					"href": "https://ubuntu.com/security/CVE-2023-27043",
					"priority": "medium",
					"public": "20230419",
					"cvss_score": "5.3",
					"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N",
					"cvss_severity": "medium",
					"usns": "7015-1,7015-3,7015-4"
				}
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:701530000000",
						"comment": "Available with Ubuntu Pro: https://ubuntu.com/pro"
					}
				]
			}
		]
	}
}
