{
	"class": "patch",
	"id": "oval:com.ubuntu.jammy:def:66771000000",
	"version": "1",
	"metadata": {
		"title": "USN-6677-1 -- libde265 vulnerabilities",
		"description": "It was discovered that libde265 could be made to dereference invalid memory. If a user or automated system were tricked into opening a specially crafted file, an attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 20.04 LTS and Ubuntu 22.04 LTS. (CVE-2023-27102)  It was discovered that libde265 could be made to write out of bounds. If a user or automated system were tricked into opening a specially crafted file, an attacker could possibly use this issue to cause a denial of service or execute arbitrary code. This issue only affected Ubuntu 16.04 LTS, Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, and Ubuntu 22.04 LTS. (CVE-2023-27103)  It was discovered that libde265 could be made to write out of bounds. If a user or automated system were tricked into opening a specially crafted file, an attacker could possibly use this issue to cause a denial of service or execute arbitrary code. (CVE-2023-43887, CVE-2023-47471, CVE-2023-49465, CVE-2023-49467, CVE-2023-49468)  Update Instructions:  Run `sudo pro fix USN-6677-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libde265-0 - 1.0.8-1ubuntu0.3 libde265-examples - 1.0.8-1ubuntu0.3 libde265-dev - 1.0.8-1ubuntu0.3 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6677-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6677-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2024-03-05"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:667710000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
