{
	"class": "patch",
	"id": "oval:com.ubuntu.jammy:def:57552000000",
	"version": "1",
	"metadata": {
		"title": "USN-5755-2 -- Linux kernel vulnerabilities",
		"description": "It was discovered that the NFSD implementation in the Linux kernel did not properly handle some RPC messages, leading to a buffer overflow. A remote attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-43945)  Jann Horn discovered that the Linux kernel did not properly track memory allocations for anonymous VMA mappings in some situations, leading to potential data structure reuse. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-42703)  It was discovered that a memory leak existed in the IPv6 implementation of the Linux kernel. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2022-3524)  It was discovered that a race condition existed in the Bluetooth subsystem in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3564)  It was discovered that the ISDN implementation of the Linux kernel contained a use-after-free vulnerability. A privileged user could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3565)  It was discovered that the TCP implementation in the Linux kernel contained a data race condition. An attacker could possibly use this to cause undesired behaviors. (CVE-2022-3566)  It was discovered that the IPv6 implementation in the Linux kernel contained a data race condition. An attacker could possibly use this to cause undesired behaviors. (CVE-2022-3567)  It was discovered that the Realtek RTL8152 USB Ethernet adapter driver in the Linux kernel did not properly handle certain error conditions. A local attacker with physical access could plug in a specially crafted USB device to cause a denial of service (memory exhaustion). (CVE-2022-3594)  It was discovered that a null pointer dereference existed in the NILFS2 file system implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-3621)  Update Instructions:  Run `sudo pro fix USN-5755-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-modules-5.15.0-1023-gke - 5.15.0-1023.28 linux-gke-tools-5.15.0-1023 - 5.15.0-1023.28 linux-headers-5.15.0-1023-gke - 5.15.0-1023.28 linux-modules-iwlwifi-5.15.0-1023-gke - 5.15.0-1023.28 linux-modules-extra-5.15.0-1023-gke - 5.15.0-1023.28 linux-image-5.15.0-1023-gke - 5.15.0-1023.28 linux-buildinfo-5.15.0-1023-gke - 5.15.0-1023.28 linux-tools-5.15.0-1023-gke - 5.15.0-1023.28 linux-image-unsigned-5.15.0-1023-gke - 5.15.0-1023.28 linux-gke-headers-5.15.0-1023 - 5.15.0-1023.28 No subscription required  linux-image-gke - 5.15.0.1023.22 linux-headers-gke-5.15 - 5.15.0.1023.22 linux-image-gke-5.15 - 5.15.0.1023.22 linux-headers-gke - 5.15.0.1023.22 linux-gke - 5.15.0.1023.22 linux-gke-5.15 - 5.15.0.1023.22 linux-tools-gke - 5.15.0.1023.22 linux-tools-gke-5.15 - 5.15.0.1023.22 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5755-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-5755-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-12-02"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:575520000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
