{
	"class": "patch",
	"id": "oval:com.ubuntu.jammy:def:60721000000",
	"version": "1",
	"metadata": {
		"title": "USN-6072-1 -- Linux kernel (OEM) vulnerabilities",
		"description": "It was discovered that the Traffic-Control Index (TCINDEX) implementation in the Linux kernel did not properly perform filter deactivation in some situations. A local attacker could possibly use this to gain elevated privileges. Please note that with the fix for this CVE, kernel support for the TCINDEX classifier has been removed. (CVE-2023-1829)  Lin Ma discovered a race condition in the io_uring subsystem in the Linux kernel, leading to a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-0468)  It was discovered that the OverlayFS implementation in the Linux kernel did not properly handle copy up operation in some conditions. A local attacker could possibly use this to gain elevated privileges. (CVE-2023-0386)  It was discovered that a race condition existed in the Xen transport layer implementation for the 9P file system protocol in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (guest crash) or expose sensitive information (guest kernel memory). (CVE-2023-1859)  Kyle Zeng discovered that the ATM VC queuing discipline implementation in the Linux kernel contained a type confusion vulnerability in some situations. An attacker could use this to cause a denial of service (system crash). (CVE-2023-23455)  Lianhui Tang discovered that the MPLS implementation in the Linux kernel did not properly handle certain sysctl allocation failure conditions, leading to a double-free vulnerability. An attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2023-26545)  Update Instructions:  Run `sudo pro fix USN-6072-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-unsigned-6.0.0-1015-oem - 6.0.0-1015.15 linux-tools-6.0.0-1015-oem - 6.0.0-1015.15 linux-headers-6.0.0-1015-oem - 6.0.0-1015.15 linux-modules-ivsc-6.0.0-1015-oem - 6.0.0-1015.15 linux-image-6.0.0-1015-oem - 6.0.0-1015.15 linux-modules-6.0.0-1015-oem - 6.0.0-1015.15 linux-oem-6.0-tools-host - 6.0.0-1015.15 linux-modules-ipu6-6.0.0-1015-oem - 6.0.0-1015.15 linux-buildinfo-6.0.0-1015-oem - 6.0.0-1015.15 linux-oem-6.0-headers-6.0.0-1015 - 6.0.0-1015.15 linux-oem-6.0-tools-6.0.0-1015 - 6.0.0-1015.15 linux-modules-iwlwifi-6.0.0-1015-oem - 6.0.0-1015.15 No subscription required  linux-modules-ipu6-oem-22.04b - 6.0.0.1015.15 linux-headers-oem-22.04b - 6.0.0.1015.15 linux-image-oem-22.04b - 6.0.0.1015.15 linux-modules-ivsc-oem-22.04b - 6.0.0.1015.15 linux-modules-iwlwifi-oem-22.04b - 6.0.0.1015.15 linux-oem-22.04b - 6.0.0.1015.15 linux-tools-oem-22.04b - 6.0.0.1015.15 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6072-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6072-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-05-10"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:607210000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
