{
	"class": "patch",
	"id": "oval:com.ubuntu.jammy:def:58401000000",
	"version": "1",
	"metadata": {
		"title": "USN-5840-1 -- Long Range ZIP vulnerabilities",
		"description": "It was discovered that Long Range ZIP incorrectly handled pointers. If  a user or an automated system were tricked into opening a certain  specially crafted ZIP file, an attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 14.04 ESM, Ubuntu 16.04 ESM, Ubuntu 18.04 LTS, and Ubuntu 20.04 LTS. (CVE-2020-25467)  It was discovered that Long Range ZIP incorrectly handled pointers. If  a user or an automated system were tricked into opening a certain  specially crafted ZIP file, an attacker could possibly use this issue  to cause a denial of service. This issue only affected Ubuntu 18.04 LTS and Ubuntu 20.04 LTS. (CVE-2021-27345, CVE-2021-27347)  It was discovered that Long Range ZIP incorrectly handled pointers. If  a user or an automated system were tricked into opening a certain  specially crafted ZIP file, an attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 16.04 ESM, Ubuntu 18.04 LTS, and Ubuntu 20.04 LTS. (CVE-2022-26291)  It was discovered that Long Range ZIP incorrectly handled memory allocation,  which could lead to a heap memory corruption. An attacker could possibly use this issue to cause denial of service. This issue affected Ubuntu 14.04 ESM, Ubuntu 16.04 ESM, Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, Ubuntu 22.04 LTS, and  Ubuntu 22.10. (CVE-2022-28044)  Update Instructions:  Run `sudo pro fix USN-5840-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  lrzip - 0.651-2ubuntu0.22.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5840-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5840-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-02-02"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:584010000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
