{
	"class": "patch",
	"id": "oval:com.ubuntu.jammy:def:54271000000",
	"version": "1",
	"metadata": {
		"title": "USN-5427-1 -- Apport vulnerabilities",
		"description": "Muqing Liu and neoni discovered that Apport incorrectly handled detecting if an executable was replaced after a crash. A local attacker could possibly use this issue to execute arbitrary code as the root user. (CVE-2021-3899)  Gerrit Venema discovered that Apport incorrectly handled connections to Apport sockets inside containers. A local attacker could possibly use this issue to connect to arbitrary sockets as the root user. (CVE-2022-1242)  Gerrit Venema discovered that Apport incorrectly handled user settings files. A local attacker could possibly use this issue to cause Apport to consume resources, leading to a denial of service. (CVE-2022-28652)  Gerrit Venema discovered that Apport did not limit the amount of logging from D-Bus connections. A local attacker could possibly use this issue to fill up the Apport log file, leading to denial of service. (CVE-2022-28654)  Gerrit Venema discovered that Apport did not filter D-Bus connection strings. A local attacker could possibly use this issue to cause Apport to make arbitrary network connections. (CVE-2022-28655)  Gerrit Venema discovered that Apport did not limit the amount of memory being consumed during D-Bus connections. A local attacker could possibly use this issue to cause Apport to consume memory, leading to a denial of service. (CVE-2022-28656)  Gerrit Venema discovered that Apport did not disable the python crash handler before chrooting into a container. A local attacker could possibly use this issue to execute arbitrary code. (CVE-2022-28657)  Gerrit Venema discovered that Apport incorrectly handled filename argument whitespace. A local attacker could possibly use this issue to spoof arguments to the Apport daemon. (CVE-2022-28658)  Update Instructions:  Run `sudo pro fix USN-5427-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  python3-problem-report - 2.20.11-0ubuntu82.1 apport-kde - 2.20.11-0ubuntu82.1 apport-retrace - 2.20.11-0ubuntu82.1 apport-valgrind - 2.20.11-0ubuntu82.1 python3-apport - 2.20.11-0ubuntu82.1 dh-apport - 2.20.11-0ubuntu82.1 apport-gtk - 2.20.11-0ubuntu82.1 apport - 2.20.11-0ubuntu82.1 apport-noui - 2.20.11-0ubuntu82.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5427-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5427-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-05-17"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:542710000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
