{
	"class": "patch",
	"id": "oval:com.ubuntu.jammy:def:60041000000",
	"version": "1",
	"metadata": {
		"title": "USN-6004-1 -- Linux kernel (Intel IoTG) vulnerabilities",
		"description": "It was discovered that the KVM VMX implementation in the Linux kernel did not properly handle indirect branch prediction isolation between L1 and L2 VMs. An attacker in a guest VM could use this to expose sensitive information from the host OS or other guest VMs. (CVE-2022-2196)  It was discovered that a use-after-free vulnerability existed in the SGI GRU driver in the Linux kernel. A local attacker could possibly use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3424)  Ziming Zhang discovered that the VMware Virtual GPU DRM driver in the Linux kernel contained an out-of-bounds write vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-36280)  Hyunwoo Kim discovered that the DVB Core driver in the Linux kernel did not properly perform reference counting in some situations, leading to a use- after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-41218)  Gerald Lee discovered that the USB Gadget file system implementation in the Linux kernel contained a race condition, leading to a use-after-free vulnerability in some situations. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-4382)  It was discovered that the NTFS file system implementation in the Linux kernel did not properly validate attributes in certain situations, leading to an out-of-bounds write vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-48423)  It was discovered that the NTFS file system implementation in the Linux kernel did not properly validate attributes in certain situations, leading to an out-of-bounds read vulnerability. A local attacker could possibly use this to expose sensitive information (kernel memory). (CVE-2022-48424)  José Oliveira and Rodrigo Branco discovered that the prctl syscall implementation in the Linux kernel did not properly protect against indirect branch prediction attacks in some situations. A local attacker could possibly use this to expose sensitive information. (CVE-2023-0045)  It was discovered that the KSMBD implementation in the Linux kernel did not properly validate buffer lengths, leading to a heap-based buffer overflow. A remote attacker could possibly use this to cause a denial of service (system crash). (CVE-2023-0210)  It was discovered that a use-after-free vulnerability existed in the Advanced Linux Sound Architecture (ALSA) subsystem. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-0266)  Kyle Zeng discovered that the class-based queuing discipline implementation in the Linux kernel contained a type confusion vulnerability in some situations. An attacker could use this to cause a denial of service (system crash). (CVE-2023-23454)  Kyle Zeng discovered that the ATM VC queuing discipline implementation in the Linux kernel contained a type confusion vulnerability in some situations. An attacker could use this to cause a denial of service (system crash). (CVE-2023-23455)  It was discovered that the RNDIS USB driver in the Linux kernel contained an integer overflow vulnerability. A local attacker with physical access could plug in a malicious USB device to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-23559)  It was discovered that the NTFS file system implementation in the Linux kernel did not properly handle a loop termination condition, leading to an out-of-bounds read vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-26606)  Wei Chen discovered that the DVB USB AZ6027 driver in the Linux kernel contained a null pointer dereference when handling certain messages from user space. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-28328)  Update Instructions:  Run `sudo pro fix USN-6004-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-intel-iotg-cloud-tools-common - 5.15.0-1027.32 linux-modules-iwlwifi-5.15.0-1027-intel-iotg - 5.15.0-1027.32 linux-image-unsigned-5.15.0-1027-intel-iotg - 5.15.0-1027.32 linux-buildinfo-5.15.0-1027-intel-iotg - 5.15.0-1027.32 linux-headers-5.15.0-1027-intel-iotg - 5.15.0-1027.32 linux-cloud-tools-5.15.0-1027-intel-iotg - 5.15.0-1027.32 linux-modules-extra-5.15.0-1027-intel-iotg - 5.15.0-1027.32 linux-image-5.15.0-1027-intel-iotg - 5.15.0-1027.32 linux-tools-5.15.0-1027-intel-iotg - 5.15.0-1027.32 linux-intel-iotg-headers-5.15.0-1027 - 5.15.0-1027.32 linux-intel-iotg-cloud-tools-5.15.0-1027 - 5.15.0-1027.32 linux-intel-iotg-tools-host - 5.15.0-1027.32 linux-intel-iotg-tools-common - 5.15.0-1027.32 linux-modules-5.15.0-1027-intel-iotg - 5.15.0-1027.32 linux-intel-iotg-tools-5.15.0-1027 - 5.15.0-1027.32 No subscription required  linux-tools-intel-iotg - 5.15.0.1027.26 linux-headers-intel-iotg - 5.15.0.1027.26 linux-intel-iotg - 5.15.0.1027.26 linux-image-intel-iotg - 5.15.0.1027.26 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6004-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6004-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-04-11"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:600410000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
