{
	"class": "patch",
	"id": "oval:com.ubuntu.jammy:def:54711000000",
	"version": "1",
	"metadata": {
		"title": "USN-5471-1 -- Linux kernel (OEM) vulnerabilities",
		"description": "It was discovered that the Linux kernel did not properly restrict access to the kernel debugger when booted in secure boot environments. A privileged attacker could use this to bypass UEFI Secure Boot restrictions. (CVE-2022-21499)  Aaron Adams discovered that the netfilter subsystem in the Linux kernel did not properly handle the removal of stateful expressions in some situations, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-1966)  Moshe Kol, Amit Klein and Yossi Gilad discovered that the IP implementation in the Linux kernel did not provide sufficient randomization when calculating port offsets. An attacker could possibly use this to expose sensitive information. (CVE-2022-1012)  Duoming Zhou discovered race conditions in the AX.25 amateur radio protocol implementation in the Linux kernel, leading to use-after-free vulnerabilities. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-1205)  It was discovered that the Marvell NFC device driver implementation in the Linux kernel did not properly perform memory cleanup operations in some situations, leading to a use-after-free vulnerability. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-1734)  Minh Yuan discovered that the floppy driver in the Linux kernel contained a race condition in some situations, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-1836)  Ziming Zhang discovered that the netfilter subsystem in the Linux kernel did not properly validate sets with multiple ranged fields. A local attacker could use this to cause a denial of service or execute arbitrary code. (CVE-2022-1972)  Joseph Ravichandran and Michael Wang discovered that the io_uring subsystem in the Linux kernel did not properly initialize data in some situations. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2022-29968)  Update Instructions:  Run `sudo pro fix USN-5471-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-oem-5.17-tools-5.17.0-1011 - 5.17.0-1011.12 linux-modules-5.17.0-1011-oem - 5.17.0-1011.12 linux-headers-5.17.0-1011-oem - 5.17.0-1011.12 linux-modules-iwlwifi-5.17.0-1011-oem - 5.17.0-1011.12 linux-image-unsigned-5.17.0-1011-oem - 5.17.0-1011.12 linux-buildinfo-5.17.0-1011-oem - 5.17.0-1011.12 linux-oem-5.17-tools-host - 5.17.0-1011.12 linux-oem-5.17-headers-5.17.0-1011 - 5.17.0-1011.12 linux-tools-5.17.0-1011-oem - 5.17.0-1011.12 linux-image-5.17.0-1011-oem - 5.17.0-1011.12 No subscription required  linux-image-oem-22.04 - 5.17.0.1011.10 linux-modules-iwlwifi-oem-22.04 - 5.17.0.1011.10 linux-modules-iwlwifi-oem-22.04a - 5.17.0.1011.10 linux-headers-oem-22.04a - 5.17.0.1011.10 linux-image-oem-22.04a - 5.17.0.1011.10 linux-oem-22.04a - 5.17.0.1011.10 linux-oem-22.04 - 5.17.0.1011.10 linux-tools-oem-22.04a - 5.17.0.1011.10 linux-tools-oem-22.04 - 5.17.0.1011.10 linux-headers-oem-22.04 - 5.17.0.1011.10 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5471-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5471-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-06-08"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:547110000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
