{
	"class": "patch",
	"id": "oval:com.ubuntu.jammy:def:60571000000",
	"version": "1",
	"metadata": {
		"title": "USN-6057-1 -- Linux kernel (Intel IoTG) vulnerabilities",
		"description": "It was discovered that the Traffic-Control Index (TCINDEX) implementation in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-1281)  It was discovered that the OverlayFS implementation in the Linux kernel did not properly handle copy up operation in some conditions. A local attacker could possibly use this to gain elevated privileges. (CVE-2023-0386)  Haowei Yan discovered that a race condition existed in the Layer 2 Tunneling Protocol (L2TP) implementation in the Linux kernel. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-4129)  It was discovered that the network queuing discipline implementation in the Linux kernel contained a null pointer dereference in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-47929)  It was discovered that the NTFS file system implementation in the Linux kernel contained a null pointer dereference in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-4842)  Kyle Zeng discovered that the IPv6 implementation in the Linux kernel contained a NULL pointer dereference vulnerability in certain situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-0394)  It was discovered that the Human Interface Device (HID) support driver in the Linux kernel contained a type confusion vulnerability in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-1073)  It was discovered that a memory leak existed in the SCTP protocol implementation in the Linux kernel. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2023-1074)  It was discovered that the NFS implementation in the Linux kernel did not properly handle pending tasks in some situations. A local attacker could use this to cause a denial of service (system crash) or expose sensitive information (kernel memory). (CVE-2023-1652)  Lianhui Tang discovered that the MPLS implementation in the Linux kernel did not properly handle certain sysctl allocation failure conditions, leading to a double-free vulnerability. An attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2023-26545)  Update Instructions:  Run `sudo pro fix USN-6057-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-intel-iotg-cloud-tools-common - 5.15.0-1028.33 linux-tools-5.15.0-1028-intel-iotg - 5.15.0-1028.33 linux-image-5.15.0-1028-intel-iotg - 5.15.0-1028.33 linux-modules-iwlwifi-5.15.0-1028-intel-iotg - 5.15.0-1028.33 linux-cloud-tools-5.15.0-1028-intel-iotg - 5.15.0-1028.33 linux-intel-iotg-tools-5.15.0-1028 - 5.15.0-1028.33 linux-headers-5.15.0-1028-intel-iotg - 5.15.0-1028.33 linux-buildinfo-5.15.0-1028-intel-iotg - 5.15.0-1028.33 linux-modules-extra-5.15.0-1028-intel-iotg - 5.15.0-1028.33 linux-intel-iotg-cloud-tools-5.15.0-1028 - 5.15.0-1028.33 linux-intel-iotg-headers-5.15.0-1028 - 5.15.0-1028.33 linux-intel-iotg-tools-host - 5.15.0-1028.33 linux-intel-iotg-tools-common - 5.15.0-1028.33 linux-modules-5.15.0-1028-intel-iotg - 5.15.0-1028.33 linux-image-unsigned-5.15.0-1028-intel-iotg - 5.15.0-1028.33 No subscription required  linux-headers-intel-iotg - 5.15.0.1028.27 linux-intel-iotg - 5.15.0.1028.27 linux-image-intel-iotg - 5.15.0.1028.27 linux-tools-intel-iotg - 5.15.0.1028.27 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6057-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6057-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-05-05"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:605710000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
