{
	"class": "patch",
	"id": "oval:com.ubuntu.jammy:def:71172000000",
	"version": "1",
	"metadata": {
		"title": "USN-7117-2 -- needrestart regression",
		"description": "USN-7117-1 fixed vulnerabilities in needrestart. The update introduced a regression in needrestart. This update fixes the problem.  We apologize for the inconvenience.  Original advisory details:   Qualys discovered that needrestart passed unsanitized data to a library   (libmodule-scandeps-perl) which expects safe input. A local attacker could  possibly use this issue to execute arbitrary code as root.  (CVE-2024-11003)    Qualys discovered that the library libmodule-scandeps-perl incorrectly   parsed perl code. This could allow a local attacker to execute arbitrary  shell commands. (CVE-2024-10224)    Qualys discovered that needrestart incorrectly used the PYTHONPATH   environment variable to spawn a new Python interpreter. A local attacker   could possibly use this issue to execute arbitrary code as root.   (CVE-2024-48990)    Qualys discovered that needrestart incorrectly checked the path to the  Python interpreter. A local attacker could possibly use this issue to win  a race condition and execute arbitrary code as root. (CVE-2024-48991)    Qualys discovered that needrestart incorrectly used the RUBYLIB  environment variable to spawn a new Ruby interpreter. A local attacker  could possibly use this issue to execute arbitrary code as root.  (CVE-2024-48992)  Update Instructions:  Run `sudo pro fix USN-7117-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  needrestart - 3.5-5ubuntu2.3 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-7117-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-7117-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2024-11-26"
			},
			"bug": [
				"https://launchpad.net/bugs/2089193"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:711720000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
