{
	"class": "patch",
	"id": "oval:com.ubuntu.jammy:def:66263000000",
	"version": "1",
	"metadata": {
		"title": "USN-6626-3 -- Linux kernel (Azure) vulnerabilities",
		"description": "Quentin Minster discovered that a race condition existed in the KSMBD implementation in the Linux kernel when handling sessions operations. A remote attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-32250, CVE-2023-32252, CVE-2023-32257)  Marek Marczykowski-Górecki discovered that the Xen event channel infrastructure implementation in the Linux kernel contained a race condition. An attacker in a guest VM could possibly use this to cause a denial of service (paravirtualized device unavailability). (CVE-2023-34324)  Zheng Wang discovered a use-after-free in the Renesas Ethernet AVB driver in the Linux kernel during device removal. A privileged attacker could use this to cause a denial of service (system crash). (CVE-2023-35827)  Tom Dohrmann discovered that the Secure Encrypted Virtualization (SEV) implementation for AMD processors in the Linux kernel contained a race condition when accessing MMIO registers. A local attacker in a SEV guest VM could possibly use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-46813)  It was discovered that the Microchip USB Ethernet driver in the Linux kernel contained a race condition during device removal, leading to a use- after-free vulnerability. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2023-6039)  It was discovered that the TLS subsystem in the Linux kernel did not properly perform cryptographic operations in some situations, leading to a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-6176)  Xingyuan Mo discovered that the netfilter subsystem in the Linux kernel did not properly handle dynset expressions passed from userspace, leading to a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-6622)  It was discovered that the TIPC protocol implementation in the Linux kernel did not properly handle locking during tipc_crypto_key_revoke() operations. A local attacker could use this to cause a denial of service (kernel deadlock). (CVE-2024-0641)  Update Instructions:  Run `sudo pro fix USN-6626-3` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-headers-5.15.0-1056-azure - 5.15.0-1056.64 linux-tools-5.15.0-1056-azure - 5.15.0-1056.64 linux-azure-cloud-tools-5.15.0-1056 - 5.15.0-1056.64 linux-modules-5.15.0-1056-azure - 5.15.0-1056.64 linux-buildinfo-5.15.0-1056-azure - 5.15.0-1056.64 linux-modules-iwlwifi-5.15.0-1056-azure - 5.15.0-1056.64 linux-image-unsigned-5.15.0-1056-azure - 5.15.0-1056.64 linux-cloud-tools-5.15.0-1056-azure - 5.15.0-1056.64 linux-azure-tools-5.15.0-1056 - 5.15.0-1056.64 linux-azure-headers-5.15.0-1056 - 5.15.0-1056.64 linux-image-5.15.0-1056-azure - 5.15.0-1056.64 linux-modules-extra-5.15.0-1056-azure - 5.15.0-1056.64 No subscription required  linux-image-5.15.0-1056-azure-fde - 5.15.0-1056.64.1 linux-image-unsigned-5.15.0-1056-azure-fde - 5.15.0-1056.64.1 No subscription required  linux-image-azure-lts-22.04 - 5.15.0.1056.52 linux-tools-azure-lts-22.04 - 5.15.0.1056.52 linux-headers-azure-lts-22.04 - 5.15.0.1056.52 linux-modules-extra-azure-lts-22.04 - 5.15.0.1056.52 linux-cloud-tools-azure-lts-22.04 - 5.15.0.1056.52 linux-azure-lts-22.04 - 5.15.0.1056.52 No subscription required  linux-tools-azure-fde-lts-22.04 - 5.15.0.1056.64.34 linux-headers-azure-fde-lts-22.04 - 5.15.0.1056.64.34 linux-cloud-tools-azure-fde-lts-22.04 - 5.15.0.1056.64.34 linux-azure-fde-lts-22.04 - 5.15.0.1056.64.34 linux-image-azure-fde-lts-22.04 - 5.15.0.1056.64.34 linux-modules-extra-azure-fde-lts-22.04 - 5.15.0.1056.64.34 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6626-3",
				"ref_url": "https://ubuntu.com/security/notices/USN-6626-3"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2024-02-15"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:662630000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:662630000010",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
