{
	"class": "patch",
	"id": "oval:com.ubuntu.jammy:def:64921000000",
	"version": "1",
	"metadata": {
		"title": "USN-6492-1 -- Mosquitto vulnerabilities",
		"description": "Kathrin Kleinhammer discovered that Mosquitto incorrectly handled certain inputs. If a user or an automated system were provided with a specially crafted input, a remote attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 20.04 LTS. (CVE-2021-34431)  Zhanxiang Song discovered that Mosquitto incorrectly handled certain inputs. If a user or an automated system were provided with a specially crafted input, a remote attacker could possibly use this issue to cause an authorisation bypass. This issue only affected Ubuntu 22.04 LTS and Ubuntu 23.04. (CVE-2021-34434)  Zhanxiang Song, Bin Yuan, DeQing Zou, and Hai Jin discovered that Mosquitto incorrectly handled certain inputs. If a user or an automated system were provided with a specially crafted input, a remote attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 20.04 LTS and Ubuntu 22.04 LTS. (CVE-2021-41039)  Zhengjie Du discovered that Mosquitto incorrectly handled certain inputs. If a user or an automated system were provided with a specially crafted input file, a remote attacker could possibly use this issue to cause a denial of service. (CVE-2023-0809)  It was discovered that Mosquitto incorrectly handled certain inputs. If a user or an automated system were provided with a specially crafted input, a remote attacker could possibly use this issue to cause a denial of service. (CVE-2023-3592)  Mischa Bachmann discovered that Mosquitto incorrectly handled certain inputs. If a user or an automated system were provided with a specially crafted input, a remote attacker could possibly use this issue to cause a denial of service. This issue was only fixed in Ubuntu 22.04 LTS and Ubuntu 23.04. (CVE-2023-28366)  Update Instructions:  Run `sudo pro fix USN-6492-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  mosquitto-dev - 2.0.11-1ubuntu1.1 libmosquitto-dev - 2.0.11-1ubuntu1.1 libmosquitto1 - 2.0.11-1ubuntu1.1 mosquitto - 2.0.11-1ubuntu1.1 libmosquittopp1 - 2.0.11-1ubuntu1.1 libmosquittopp-dev - 2.0.11-1ubuntu1.1 mosquitto-clients - 2.0.11-1ubuntu1.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6492-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6492-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-11-21"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:649210000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
