{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:201699380000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2016-9938 on Ubuntu 16.04 ESM (xenial) - low",
		"description": "An issue was discovered in Asterisk Open Source 11.x before 11.25.1, 13.xbefore 13.13.1, and 14.x before 14.2.1 and Certified Asterisk 11.x before11.6-cert16 and 13.x before 13.8-cert4. The chan_sip channel driver has aliberal definition for whitespace when attempting to strip the contentbetween a SIP header name and a colon character. Rather than following RFC3261 and stripping only spaces and horizontal tabs, Asterisk treats anynon-printable ASCII character as if it were whitespace. This means thatheaders such as Contact\\x01: will be seen as a valid Contact header. Thismostly does not pose a problem until Asterisk is placed in tandem with anauthenticating SIP proxy. In such a case, a crafty combination of valid andinvalid To headers can cause a proxy to allow an INVITE request intoAsterisk without authentication since it believes the request is anin-dialog request. However, because of the bug described above, the requestwill look like an out-of-dialog request to Asterisk. Asterisk will thenprocess the request as a new call. The result is that Asterisk can processcalls from unvetted sources without any authentication. If you do not use aproxy for authentication, then this issue does not affect you. If yourproxy is dialog-aware (meaning that the proxy keeps track of what dialogsare currently valid), then this issue does not affect you. If you usechan_pjsip instead of chan_sip, then this issue does not affect you.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2016-9938",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-9938"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2016 Canonical Ltd.",
			"public_date": "2016-12-12 21:59:00 UTC",
			"bug": [
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=847668"
			],
			"cve": {
				"text": "CVE-2016-9938",
				"href": "https://ubuntu.com/security/CVE-2016-9938",
				"public": "20161212",
				"cvss_score": "5.3",
				"cvss_vector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201530080000000",
						"comment": "asterisk package in esm-apps/xenial is affected and needs fixing."
					}
				]
			}
		]
	}
}
