{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2023405480000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-40548 on Ubuntu 16.04 ESM (xenial) - medium",
		"description": "[Fix integer overflow on SBAT section size on 32-bit systemIn verify_sbat_section(), we do some math on data that comes from thebinary being verified - in this case, we add 1 to the size of the\".sbat\" section as reported in the section header, which is then used asthe input to the size of an allocation.  The original value is then usedfor a size in a memcpy(), which means there's an out-of-bounds write inthe overflow case.Due to the type of the variable being size_t, but the type in thesection header being uint32_t, this is only plausibly accomplished on32-bit systems.This patch makes the arithmetic use a checked add operation to avoidoverflow.  Additionally, it adds a check in verify_buffer_sbat() toguarantee that the data is within the binary.It's not currently known if this is actually exploitable on suchsystems; the memory layout on a particular machine may further mitigatethis scenario.]",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-40548",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40548"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-01-23",
			"cve": {
				"text": "CVE-2023-40548",
				"href": "https://ubuntu.com/security/CVE-2023-40548",
				"public": "20240123"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2023405460000000",
						"comment": "secureboot-db package in esm-infra/xenial is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2023405460000010",
						"comment": "shim-signed: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'install media keys will never be revoked')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2022287370000000",
						"comment": "shim: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'install media keys will never be revoked')."
					}
				]
			}
		]
	}
}
