{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.xenial:def:201915590000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2019-1559 on Ubuntu 16.04 ESM (xenial) - medium.",
    "Description": "If an application encounters a fatal protocol error and then calls SSL_shutdown() twice (once to send a close_notify, and once to receive one) then OpenSSL can respond differently to the calling application if a 0 byte record is received with invalid padding compared to if a 0 byte record is received with an invalid MAC. If the application then behaves differently based on that in a way that is detectable to the remote peer, then this amounts to a padding oracle that could be used to decrypt data. In order for this to be exploitable \"non-stitched\" ciphersuites must be in use. Stitched ciphersuites are optimised implementations of certain commonly used ciphersuites. Also the application must call SSL_shutdown() twice even if a protocol error has occurred (applications should not do this but some do anyway). Fixed in OpenSSL 1.0.2r (Affected 1.0.2-1.0.2q).\n\nUpdate Instructions:\n\nRun `sudo pro fix CVE-2019-1559` to fix the vulnerability. The problem can be corrected\nby updating your system to the following package versions:\n\nlibssl1.0.0 - 1.0.2g-1ubuntu4.15\nopenssl - 1.0.2g-1ubuntu4.15\nAvailable with Ubuntu Pro (Infra-only): https://ubuntu.com/pro",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 16.04 ESM"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2019-1559",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-1559"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2019 Canonical Ltd.",
      "PublicDate": "2019-02-26",
      "Bug": null,
      "cve": {
        "text": "CVE-2019-1559",
        "href": "https://ubuntu.com/security/CVE-2019-1559",
        "public": "20190226",
        "cvss_score": "5.9",
        "cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N",
        "usns": "3899-1,4376-2"
      },
      "PublicDateAtUsn": "2019-02-26",
      "AssignedTo": "",
      "DiscoveredBy": "Juraj Somorovsky, Robert Merget and Nimrod Aviram",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": "mdeslaur> doesn't affect 1.1.x  this fix is a workaround for applications that call SSL_shutdown() twice even if a protocol error has occurred  upstream fix uses error handling mechanism introduced in 1.0.2, which isn't available in 1.0.1f. While we are unlikely to fix this issue in Ubuntu 14.04 LTS, marking as deferred for now in case the vulnerable applications are identified."
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.xenial:tst:201915430000000",
        "comment": "openssl package in xenial was vulnerable but has been fixed (note: '1.0.2g-1ubuntu4.15')."
      }
    ]
  }
}
