{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2021286890000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-28689 on Ubuntu 16.04 ESM (xenial) - low",
		"Description": "x86: Speculative vulnerabilities with bare (non-shim) 32-bit PV guests32-bit x86 PV guest kernels run in ring 1. At the time when Xen wasdeveloped, this area of the i386 architecture was rarely used, which is whyXen was able to use it to implement paravirtualisation, Xen's novelapproach to virtualization. In AMD64, Xen had to use a differentimplementation approach, so Xen does not use ring 1 to support 64-bitguests. With the focus now being on 64-bit systems, and the availability ofexplicit hardware support for virtualization, fixing speculation issues inring 1 is not a priority for processor companies. Indirect BranchRestricted Speculation (IBRS) is an architectural x86 extension puttogether to combat speculative execution sidechannel attacks, includingSpectre v2. It was retrofitted in microcode to existing CPUs. For moredetails on Spectre v2, see: http://xenbits.xen.org/xsa/advisory-254.htmlHowever, IBRS does not architecturally protect ring 0 from predictionslearnt in ring 1. For more details, see:https://software.intel.com/security-software-guidance/deep-dives/deep-dive-indirect-branch-restricted-speculationSimilar situations may exist with other mitigations for other kinds ofspeculative execution attacks. The situation is quite likely to be similarfor speculative execution attacks which have yet to be discovered,disclosed, or mitigated.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 16.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-28689",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-28689"
		},
		"advisory": {
			"Severity": "Low",
			"Rights": "Copyright (C) 2021 Canonical Ltd.",
			"PublicDate": "2021-06-11 15:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2021-28689",
				"href": "https://ubuntu.com/security/CVE-2021-28689",
				"public": "20210611",
				"cvss_score": "5.5",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2017155970000000",
						"comment": "xen: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needs-triage')."
					}
				]
			}
		]
	}
}
