{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2022487330000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-48733 on Ubuntu 16.04 LTS (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: btrfs:fix use-after-free after failure to create a snapshot Atioctl.c:create_snapshot(), we allocate a pending snapshot structure andthen attach it to the transaction's list of pending snapshots. After thatwe call btrfs_commit_transaction(), and if that returns an error we jump to'fail' label, where we kfree() the pending snapshot structure. This canresult in a later use-after-free of the pending snapshot: 1) We allocatedthe pending snapshot and added it to the transaction's list of pendingsnapshots; 2) We call btrfs_commit_transaction(), and it fails either atthe first call to btrfs_run_delayed_refs() orbtrfs_start_dirty_block_groups(). In both cases, we don't abort thetransaction and we release our transaction handle. We jump to the 'fail'label and free the pending snapshot structure. We return with the pendingsnapshot still in the transaction's list; 3) Another task commits thetransaction. This time there's no error at all, and then during thetransaction commit it accesses a pointer to the pending snapshot structurethat the snapshot creation task has already freed, resulting in auser-after-free. This issue could actually be detected by smatch, whichproduced the following warning: fs/btrfs/ioctl.c:843 create_snapshot()warn: '&pending_snapshot->list' not removed from list So fix this by nothaving the snapshot creation ioctl directly add the pending snapshot to thetransaction's list. Instead add the pending snapshot to the transactionhandle, and then at btrfs_commit_transaction() we add the snapshot to thelist only when we can guarantee that any error returned after that pointwill result in a transaction abort, in which case the ioctl code can safelyfree the pending snapshot and no one can access it anymore.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-48733",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2022-48733"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-06-20 12:15:00 UTC",
			"cve": {
				"text": "CVE-2022-48733",
				"href": "https://ubuntu.com/security/CVE-2022-48733",
				"public": "20240620",
				"cvss_score": "7.8",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000000",
						"comment": "linux package in xenial is affected. An update containing the fix has been completed and is pending publication (note: '4.4.0-261.295')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000040",
						"comment": "linux-hwe package in xenial is affected. An update containing the fix has been completed and is pending publication (note: '4.15.0-231.243~16.04.1')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000070",
						"comment": "linux-kvm: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000030",
						"comment": "linux-aws package in xenial is affected. An update containing the fix has been completed and is pending publication (note: '4.4.0-1176.191')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000080",
						"comment": "linux-aws-hwe: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000050",
						"comment": "linux-azure package in xenial is affected. An update containing the fix has been completed and is pending publication (note: '4.15.0-1183.198~16.04.1')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000060",
						"comment": "linux-gcp: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:200767620000010",
						"comment": "linux-gke: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000090",
						"comment": "linux-oracle: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:200767620000030",
						"comment": "linux-oem: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201245420000010",
						"comment": "linux-raspi2: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
