{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:202353630000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-5363 on Ubuntu 16.04 LTS (xenial) - medium",
		"description": "Issue summary: A bug has been identified in the processing of key andinitialisation vector (IV) lengths. This can lead to potential truncationor overruns during the initialisation of some symmetric ciphers. Impactsummary: A truncation in the IV can result in non-uniqueness, which couldresult in loss of confidentiality for some cipher modes. When callingEVP_EncryptInit_ex2(), EVP_DecryptInit_ex2() or EVP_CipherInit_ex2() theprovided OSSL_PARAM array is processed after the key and IV have beenestablished. Any alterations to the key length, via the \"keylen\" parameteror the IV length, via the \"ivlen\" parameter, within the OSSL_PARAM arraywill not take effect as intended, potentially causing truncation oroverreading of these values. The following ciphers and cipher modes areimpacted: RC2, RC4, RC5, CCM, GCM and OCB. For the CCM, GCM and OCB ciphermodes, truncation of the IV can result in loss of confidentiality. Forexample, when following NIST's SP 800-38D section 8.2.1 guidance forconstructing a deterministic IV for AES in GCM mode, truncation of thecounter portion could lead to IV reuse. Both truncations and overruns ofthe key and overruns of the IV will produce incorrect results and could, insome cases, trigger a memory exception. However, these issues are notcurrently assessed as security critical. Changing the key and/or IV lengthsis not considered to be a common operation and the vulnerable API wasrecently introduced. Furthermore it is likely that application developerswill have spotted this problem during testing since decryption would failunless both peers in the communication were similarly vulnerable. For thesereasons we expect the probability of an application being vulnerable tothis to be quite low. However if an application is vulnerable then thisissue is considered very serious. For these reasons we have assessed thisissue as Moderate severity overall. The OpenSSL SSL/TLS implementation isnot affected by this issue. The OpenSSL 3.0 and 3.1 FIPS providers are notaffected by this because the issue lies outside of the FIPS providerboundary. OpenSSL 3.1 and 3.0 are vulnerable to this issue.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-5363",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-5363"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-10-24",
			"cve": {
				"text": "CVE-2023-5363",
				"href": "https://ubuntu.com/security/CVE-2023-5363",
				"public": "20231024",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N",
				"usns": "6450-1"
			},
			"public_date_at_usn": "2023-10-24",
			"ref": [
				"https://ubuntu.com/security/notices/USN-6450-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201620860000000",
						"comment": "nodejs package in xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
