{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2022419520000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-41952 on Ubuntu Pro FIPS-updates 20.04 LTS (focal) - medium",
		"description": "Synapse before 1.52.0 with URL preview functionality enabled will attemptto generate URL previews for media stream URLs without properly limitingconnection time. Connections will only be terminated after`max_spider_size` (default: 10M) bytes have been downloaded, which can insome cases lead to long-lived connections towards the streaming mediaserver (for instance, Icecast). This can cause excessive traffic andconnections toward such servers if their stream URL is, for example, postedto a large room with many Synapse instances with URL preview enabled.Version 1.52.0 implements a timeout mechanism which will terminate URLpreview connections after 30 seconds. Since generating URL previews formedia streams is not supported and always fails, 1.53.0 additionallyimplements an allow list for content types for which Synapse will evenattempt to generate a URL preview. Upgrade to 1.53.0 to fully resolve theissue. As a workaround, turn off URL preview functionality by setting`url_preview_enabled: false` in the Synapse configuration file.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS-updates 20.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-41952",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2022-41952"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-11-22 16:15:00 UTC",
			"cve": {
				"text": "CVE-2022-41952",
				"href": "https://ubuntu.com/security/CVE-2022-41952",
				"public": "20221122",
				"cvss_score": "5.3",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2020262570000000",
						"comment": "matrix-synapse package in focal is affected and may need fixing."
					}
				]
			}
		]
	}
}
