{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:202326500000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-2650 on Ubuntu Pro FIPS-updates 20.04 LTS (focal) - medium",
		"description": "Issue summary: Processing some specially crafted ASN.1 object identifiersor data containing them may be very slow. Impact summary: Applications thatuse OBJ_obj2txt() directly, or use any of the OpenSSL subsystems OCSP,PKCS7/SMIME, CMS, CMP/CRMF or TS with no message size limit may experiencenotable to very long delays when processing those messages, which may leadto a Denial of Service. An OBJECT IDENTIFIER is composed of a series ofnumbers - sub-identifiers - most of which have no size limit. OBJ_obj2txt()may be used to translate an ASN.1 OBJECT IDENTIFIER given in DER encodingform (using the OpenSSL type ASN1_OBJECT) to its canonical numeric textform, which are the sub-identifiers of the OBJECT IDENTIFIER in decimalform, separated by periods. When one of the sub-identifiers in the OBJECTIDENTIFIER is very large (these are sizes that are seen as absurdly large,taking up tens or hundreds of KiBs), the translation to a decimal number intext may take a very long time. The time complexity is O(n^2) with 'n'being the size of the sub-identifiers in bytes (*). With OpenSSL 3.0,support to fetch cryptographic algorithms using names / identifiers instring form was introduced. This includes using OBJECT IDENTIFIERs incanonical numeric text form as identifiers for fetching algorithms. SuchOBJECT IDENTIFIERs may be received through the ASN.1 structureAlgorithmIdentifier, which is commonly used in multiple protocols tospecify what cryptographic algorithm should be used to sign or verify,encrypt or decrypt, or digest passed data. Applications that callOBJ_obj2txt() directly with untrusted data are affected, with any versionof OpenSSL. If the use is for the mere purpose of display, the severity isconsidered low. In OpenSSL 3.0 and newer, this affects the subsystems OCSP,PKCS7/SMIME, CMS, CMP/CRMF or TS. It also impacts anything that processesX.509 certificates, including simple things like verifying its signature.The impact on TLS is relatively low, because all versions of OpenSSL have a100KiB limit on the peer's certificate chain. Additionally, this onlyimpacts clients, or servers that have explicitly enabled clientauthentication. In OpenSSL 1.1.1 and 1.0.2, this only affects displayingdiverse objects, such as X.509 certificates. This is assumed to not happenin such a way that it would cause a Denial of Service, so these versionsare considered not affected by this issue in such a way that it would because for concern, and the severity is therefore considered low.\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2023-2650` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nlibssl1.1 - 1.1.1f-1ubuntu2.19\nopenssl - 1.1.1f-1ubuntu2.19\nNo subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS-updates 20.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-2650",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-2650"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-05-30",
			"cve": {
				"text": "CVE-2023-2650",
				"href": "https://ubuntu.com/security/CVE-2023-2650",
				"public": "20230530",
				"cvss_score": "6.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H",
				"usns": "6119-1,6188-1,6672-1"
			},
			"public_date_at_usn": "2023-05-30",
			"ref": [
				"https://ubuntu.com/security/notices/USN-6119-1",
				"https://ubuntu.com/security/notices/USN-6188-1",
				"https://ubuntu.com/security/notices/USN-6672-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:202326500000000",
						"comment": "openssl package in focal was vulnerable but has been fixed (note: '1.1.1f-1ubuntu2.19')."
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2021282160000000",
						"comment": "edk2 package in focal is affected and needs fixing."
					}
				]
			}
		]
	}
}
