{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2021326180000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-32618 on Ubuntu Pro FIPS-updates 20.04 LTS (focal) - low",
		"description": "The Python \"Flask-Security-Too\" package is used for adding securityfeatures to your Flask application. It is an is an independently maintainedversion of Flask-Security based on the 3.0.0 version of Flask-Security. Allversions of Flask-Security-Too allow redirects after many successful views(e.g. /login) by honoring the ?next query param. There is code in FS tovalidate that the url specified in the next parameter is either relative ORhas the same netloc (network location) as the requesting URL. This checkutilizes Pythons urlsplit library. However many browsers are very lenienton the kind of URL they accept and 'fill in the blanks' when presented witha possibly incomplete URL. As a concrete example - settinghttp://login?next=\\\\\\github.com will pass FS's relative URL check howevermany browsers will gladly convert this to http://github.com. Thus anattacker could send such a link to an unwitting user, using a legitimatesite and have it redirect to whatever site they want. This is considered alow severity due to the fact that if Werkzeug is used (which is very commonwith Flask applications) as the WSGI layer, it by default ALWAYS ensuresthat the Location header is absolute - thus making this attack vector mute.It is possible for application writers to modify this default behavior bysetting the 'autocorrect_location_header=False`.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS-updates 20.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-32618",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-32618"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-05-17 18:15:00 UTC",
			"cve": {
				"text": "CVE-2021-32618",
				"href": "https://ubuntu.com/security/CVE-2021-32618",
				"public": "20210517",
				"cvss_score": "6.1",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2021326180000000",
						"comment": "flask-security: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'see notes')."
					}
				]
			}
		]
	}
}
