{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2024411100000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-41110 on Ubuntu 18.04 LTS (bionic) - medium",
		"description": "Moby is an open-source project created by Docker for softwarecontainerization. A security vulnerability has been detected in certainversions of Docker Engine, which could allow an attacker to bypassauthorization plugins (AuthZ) under specific circumstances. The baselikelihood of this being exploited is low.Using a specially-crafted API request, an Engine API client could make thedaemon forward the request or response to an authorization plugin withoutthe body. In certain circumstances, the authorization plugin may allow arequest which it would have otherwise denied if the body had been forwardedto it.A security issue was discovered In 2018, where an attacker could bypassAuthZ plugins using a specially crafted API request. This could lead tounauthorized actions, including privilege escalation. Although this issuewas fixed in Docker Engine v18.09.1 in January 2019, the fix was notcarried forward to later major versions, resulting in a regression. Anyonewho depends on authorization plugins that introspect the request and/orresponse body to make access control decisions is potentially impacted.Docker EE v19.03.x and all versions of Mirantis Container Runtime are notvulnerable.docker-ce v27.1.1 containes patches to fix the vulnerability. Patches havealso been merged into the master, 19.03, 20.0, 23.0, 24.0, 25.0, 26.0, and26.1 release branches. If one is unable to upgrade immediately, avoid usingAuthZ plugins and/or restrict access to the Docker API to trusted parties,following the principle of least privilege.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-41110",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-41110"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-07-24 17:15:00 UTC",
			"cve": {
				"text": "CVE-2024-41110",
				"href": "https://ubuntu.com/security/CVE-2024-41110",
				"public": "20240724"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2021411900000000",
						"comment": "docker.io package in bionic is affected and may need fixing."
					}
				]
			}
		]
	}
}
