{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2024424720000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-42472 on Ubuntu 18.04 LTS (bionic) - medium",
		"description": "Flatpak is a Linux application sandboxing and distribution framework. Priorto versions 1.14.0 and 1.15.10, a malicious or compromised Flatpak appusing persistent directories could access and write files outside of whatit would otherwise have access to, which is an attack on integrity andconfidentiality.When `persistent=subdir` is used in the application permissions(represented as `--persist=subdir` in the command-line interface), thatmeans that an application which otherwise doesn't have access to the realuser home directory will see an empty home directory with a writeablesubdirectory `subdir`. Behind the scenes, this directory is actually a bindmount and the data is stored in the per-application directory as`~/.var/app/$APPID/subdir`. This allows existing apps that are not aware ofthe per-application directory to still work as intended without generalhome directory access.However, the application does have write access to the applicationdirectory `~/.var/app/$APPID` where this directory is stored. If the sourcedirectory for the `persistent`/`--persist` option is replaced by a symlink,then the next time the application is started, the bind mount will followthe symlink and mount whatever it points to into the sandbox.Partial protection against this vulnerability can be provided by patchingFlatpak using the patches in commits ceec2ffc and 98f79773. However, thisleaves a race condition that could be exploited by two instances of amalicious app running in parallel. Closing the race condition requiresupdating or patching the version of bubblewrap that is used by Flatpak toadd the new `--bind-fd` option using the patch and then patching Flatpak touse it. If Flatpak has been configured at build-time with`-Dsystem_bubblewrap=bwrap` (1.15.x) or `--with-system-bubblewrap=bwrap`(1.14.x or older), or a similar option, then the version of bubblewrap thatneeds to be patched is a system copy that is distributed separately,typically `/usr/bin/bwrap`. This configuration is the one that is typicallyused in Linux distributions. If Flatpak has been configured at build-timewith `-Dsystem_bubblewrap=` (1.15.x) or with `--without-system-bubblewrap`(1.14.x or older), then it is the bundled version of bubblewrap that isincluded with Flatpak that must be patched. This is typically installed as`/usr/libexec/flatpak-bwrap`. This configuration is the default whenbuilding from source code.For the 1.14.x stable branch, these changes are included in Flatpak1.14.10. The bundled version of bubblewrap included in this release hasbeen updated to 0.6.3. For the 1.15.x development branch, these changes areincluded in Flatpak 1.15.10. The bundled version of bubblewrap in thisrelease is a Meson \"wrap\" subproject, which has been updated to 0.10.0. The1.12.x and 1.10.x branches will not be updated for this vulnerability.Long-term support OS distributions should backport the individual changesinto their versions of Flatpak and bubblewrap, or update to newer versionsif their stability policy allows it. As a workaround, avoid usingapplications using the `persistent` (`--persist`) permission.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-42472",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-42472"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-08-15 19:15:00 UTC",
			"bug": [
				"https://bugs.launchpad.net/ubuntu/+source/flatpak/+bug/2077087"
			],
			"cve": {
				"text": "CVE-2024-42472",
				"href": "https://ubuntu.com/security/CVE-2024-42472",
				"public": "20240815"
			},
			"public_date_at_usn": "2024-08-15 19:15:00 UTC",
			"assigned_to": "leosilva",
			"ref": [
				"https://ubuntu.com/security/notices/USN-7046-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2021438600000000",
						"comment": "flatpak package in bionic is affected and may need fixing."
					}
				]
			}
		]
	}
}
