{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2024312100000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-31210 on Ubuntu 20.04 LTS (focal) - medium",
		"description": "WordPress is an open publishing platform for the Web. It's possible for afile of a type other than a zip file to be submitted as a new plugin by anadministrative user on the Plugins -> Add New -> Upload Plugin screen inWordPress. If FTP credentials are requested for installation (in order tomove the file into place outside of the `uploads` directory) then theuploaded file remains temporary available in the Media Library despite itnot being allowed. If the `DISALLOW_FILE_EDIT` constant is set to `true` onthe site _and_ FTP credentials are required when uploading a new theme orplugin, then this technically allows an RCE when the user would otherwisehave no means of executing arbitrary PHP code. This issue _only_ affectsAdministrator level users on single site installations, and Super Adminlevel users on Multisite installations where it's otherwise expected thatthe user does not have permission to upload or execute arbitrary PHP code.Lower level users are not affected. Sites where the `DISALLOW_FILE_MODS`constant is set to `true` are not affected. Sites where an administrativeuser either does not need to enter FTP credentials or they have access tothe valid FTP credentials, are not affected. The issue was fixed inWordPress 6.4.3 on January 30, 2024 and backported to versions 6.3.3,6.2.4, 6.1.5, 6.0.7, 5.9.9, 5.8.9, 5.7.11, 5.6.13, 5.5.14, 5.4.15, 5.3.17,5.2.20, 5.1.18, 5.0.21, 4.9.25, 2.8.24, 4.7.28, 4.6.28, 4.5.31, 4.4.32,4.3.33, 4.2.37, and 4.1.40. A workaround is available. If the`DISALLOW_FILE_MODS` constant is defined as `true` then it will not bepossible for any user to upload a plugin and therefore this issue will notbe exploitable.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-31210",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-31210"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-04-05",
			"cve": {
				"text": "CVE-2024-31210",
				"href": "https://ubuntu.com/security/CVE-2024-31210",
				"public": "20240405"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:201138180000000",
						"comment": "wordpress package in focal is affected and may need fixing."
					}
				]
			}
		]
	}
}
