{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2021294720000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-29472 on Ubuntu 20.04 LTS (focal) - medium.",
		"Description": "Composer is a dependency manager for PHP. URLs for Mercurial repositories in the root composer.json and package source download URLs are not sanitized correctly. Specifically crafted URL values allow code to be executed in the HgDriver if hg/Mercurial is installed on the system. The impact to Composer users directly is limited as the composer.json file is typically under their own control and source download URLs can only be supplied by third party Composer repositories they explicitly trust to download and execute source code from, e.g. Composer plugins. The main impact is to services passing user input to Composer, including Packagist.org and Private Packagist. This allowed users to trigger remote code execution. The vulnerability has been patched on Packagist.org and Private Packagist within 12h of receiving the initial vulnerability report and based on a review of logs, to the best of our knowledge, was not abused by anyone. Other services/tools using VcsRepository/VcsDriver or derivatives may also be vulnerable and should upgrade their composer/composer dependency immediately. Versions 1.10.22 and 2.0.13 include patches for this issue.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 20.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-29472",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-29472"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2021 Canonical Ltd.",
			"PublicDate": "2021-04-27 21:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2021-29472",
				"href": "https://ubuntu.com/security/CVE-2021-29472",
				"public": "20210427",
				"cvss_score": "8.8",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
				"usns": "5220-1"
			},
			"PublicDateAtUsn": "2021-04-27 21:15:00 UTC",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.focal:tst:2021294720000000",
				"comment": "composer package in focal is affected and may need fixing."
			}
		]
	}
}
