{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:202138820000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-3882 on Ubuntu 20.04 LTS (focal) - medium",
		"description": "LedgerSMB does not set the 'Secure' attribute on the session authorizationcookie when the client uses HTTPS and the LedgerSMB server is behind areverse proxy. By tricking a user to use an unencrypted connection (HTTP),an attacker may be able to obtain the authentication data by capturingnetwork traffic. LedgerSMB 1.8 and newer switched from Basic authenticationto using cookie authentication with encrypted cookies. Although an attackercan't access the information inside the cookie, nor the password of theuser, possession of the cookie is enough to access the application as theuser from which the cookie has been obtained. In order for the attacker toobtain the cookie, first of all the server must be configured to respond tounencrypted requests, the attacker must be suitably positioned to eavesdropon the network traffic between the client and the server *and* the usermust be tricked into using unencrypted HTTP traffic. Proper audit controland separation of duties limit Integrity impact of the attack vector. Usersof LedgerSMB 1.8 are urged to upgrade to known-fixed versions. Users ofLedgerSMB 1.7 or 1.9 are unaffected by this vulnerability and don't need totake action. As a workaround, users may configure their Apache or Nginxreverse proxy to add the Secure attribute at the network boundary insteadof relying on LedgerSMB. For Apache, please refer to the 'Header alwaysedit' configuration command in the mod_headers module. For Nginx, pleaserefer to the 'proxy_cookie_flags' configuration command.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-3882",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-3882"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-10-14 09:15:00 UTC",
			"cve": {
				"text": "CVE-2021-3882",
				"href": "https://ubuntu.com/security/CVE-2021-3882",
				"public": "20211014",
				"cvss_score": "6.8",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:202138820000000",
						"comment": "ledgersmb package in focal is affected and needs fixing."
					}
				]
			}
		]
	}
}
