{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2022311970000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2022-31197 on Ubuntu 20.04 LTS (focal) - medium",
		"Description": "PostgreSQL JDBC Driver (PgJDBC for short) allows Java programs to connectto a PostgreSQL database using standard, database independent Java code.The PGJDBC implementation of the `java.sql.ResultRow.refreshRow()` methodis not performing escaping of column names so a malicious column name thatcontains a statement terminator, e.g. `;`, could lead to SQL injection.This could lead to executing additional SQL commands as the application'sJDBC user. User applications that do not invoke the`ResultSet.refreshRow()` method are not impacted. User application that doinvoke that method are impacted if the underlying database that they arequerying via their JDBC application may be under the control of anattacker. The attack requires the attacker to trick the user into executingSQL against a table name who's column names would contain the malicious SQLand subsequently invoke the `refreshRow()` method on the ResultSet. Notethat the application's JDBC user and the schema owner need not be the same.A JDBC application that executes as a privileged user querying databaseschemas owned by potentially malicious less-privileged users would bevulnerable. In that situation it may be possible for the malicious user tocraft a schema that causes the application to execute commands as theprivileged user. Patched versions will be released as `42.2.26` and`42.4.1`. Users are advised to upgrade. There are no known workarounds forthis issue.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 20.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-31197",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-31197"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2022 Canonical Ltd.",
			"PublicDate": "2022-08-03 19:15:00 UTC",
			"Bug": [
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=1016662"
			],
			"cve": {
				"text": "CVE-2022-31197",
				"href": "https://ubuntu.com/security/CVE-2022-31197",
				"public": "20220803",
				"cvss_score": "8.0",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2018109360000000",
						"comment": "libpgjava package in focal is affected and may need fixing."
					}
				]
			}
		]
	}
}
