{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2021438600000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-43860 on Ubuntu 20.04 LTS (focal) - medium",
		"Description": "Flatpak is a Linux application sandboxing and distribution framework. Priorto versions 1.12.3 and 1.10.6, Flatpak doesn't properly validate that thepermissions displayed to the user for an app at install time match theactual permissions granted to the app at runtime, in the case that there'sa null byte in the metadata file of an app. Therefore apps can grantthemselves permissions without the consent of the user. Flatpak showspermissions to the user during install by reading them from the\"xa.metadata\" key in the commit metadata. This cannot contain a nullterminator, because it is an untrusted GVariant. Flatpak compares thesepermissions to the *actual* metadata, from the \"metadata\" file to ensure itwasn't lied to. However, the actual metadata contents are loaded in severalplaces where they are read as simple C-style strings. That means that, ifthe metadata file includes a null terminator, only the content of the filefrom *before* the terminator gets compared to xa.metadata. Thus, anypermissions that appear in the metadata file after a null terminator areapplied at runtime but not shown to the user. So maliciously crafted appscan give themselves hidden permissions. Users who have Flatpaks installedfrom untrusted sources are at risk in case the Flatpak has a maliciouslycrafted metadata file, either initially or in an update. This issue ispatched in versions 1.12.3 and 1.10.6. As a workaround, users can manuallycheck the permissions of installed apps by checking the metadata file orthe xa.metadata key on the commit metadata.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 20.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-43860",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-43860"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2022 Canonical Ltd.",
			"PublicDate": "2022-01-12 22:15:00 UTC",
			"Bug": [
				"https://bugs.launchpad.net/ubuntu/+source/flatpak/+bug/1957716"
			],
			"cve": {
				"text": "CVE-2021-43860",
				"href": "https://ubuntu.com/security/CVE-2021-43860",
				"public": "20220112",
				"cvss_score": "8.6",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "alexmurray",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2021438600000000",
						"comment": "flatpak package in focal is affected and may need fixing."
					}
				]
			}
		]
	}
}
