{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:201732240000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2017-3224 on Ubuntu 20.04 LTS (focal) - low",
		"description": "Open Shortest Path First (OSPF) protocol implementations may improperlydetermine Link State Advertisement (LSA) recency for LSAs withMaxSequenceNumber. According to RFC 2328 section 13.1, for two instances ofthe same LSA, recency is determined by first comparing sequence numbers,then checksums, and finally MaxAge. In a case where the sequence numbersare the same, the LSA with the larger checksum is considered more recent,and will not be flushed from the Link State Database (LSDB). Since the RFCdoes not explicitly state that the values of links carried by a LSA must bethe same when prematurely aging a self-originating LSA withMaxSequenceNumber, it is possible in vulnerable OSPF implementations for anattacker to craft a LSA with MaxSequenceNumber and invalid links that willresult in a larger checksum and thus a 'newer' LSA that will not be flushedfrom the LSDB. Propagation of the crafted LSA can result in the erasure oralteration of the routing tables of routers within the routing domain,creating a denial of service condition or the re-routing of traffic on thenetwork. CVE-2017-3224 has been reserved for Quagga and downstreamimplementations (SUSE, openSUSE, and Red Hat packages).",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2017-3224",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-3224"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2018 Canonical Ltd.",
			"public_date": "2018-07-24 15:29:00 UTC",
			"bug": [
				"https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=871617"
			],
			"cve": {
				"text": "CVE-2017-3224",
				"href": "https://ubuntu.com/security/CVE-2017-3224",
				"public": "20180724",
				"cvss_score": "8.2",
				"cvss_vector": "CVSS:3.0/AV:A/AC:H/PR:N/UI:N/S:C/C:L/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:201255210000000",
						"comment": "quagga package in focal is affected and needs fixing."
					}
				]
			}
		]
	}
}
