{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2022419460000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2022-41946 on Ubuntu 20.04 LTS (focal) - low",
		"Description": "pgjdbc is an open source postgresql JDBC Driver. In affected versions aprepared statement using either `PreparedStatement.setText(int,InputStream)` or `PreparedStatemet.setBytea(int, InputStream)` will createa temporary file if the InputStream is larger than 2k. This will create atemporary file which is readable by other users on Unix like systems, butnot MacOS. On Unix like systems, the system's temporary directory is sharedbetween all users on that system. Because of this, when files anddirectories are written into this directory they are, by default, readableby other users on that same system. This vulnerability does not allow otherusers to overwrite the contents of these directories or files. This ispurely an information disclosure vulnerability. Because certain JDK filesystem APIs were only added in JDK 1.7, this this fix is dependent upon theversion of the JDK you are using. Java 1.7 and higher users: thisvulnerability is fixed in 4.5.0. Java 1.6 and lower users: no patch isavailable. If you are unable to patch, or are stuck running on Java 1.6,specifying the java.io.tmpdir system environment variable to a directorythat is exclusively owned by the executing user will mitigate thisvulnerability.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 20.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-41946",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-41946"
		},
		"advisory": {
			"Severity": "Low",
			"Rights": "Copyright (C) 2022 Canonical Ltd.",
			"PublicDate": "2022-11-23 20:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2022-41946",
				"href": "https://ubuntu.com/security/CVE-2022-41946",
				"public": "20221123",
				"cvss_score": "5.5",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2018109360000000",
						"comment": "libpgjava package in focal is affected and may need fixing."
					}
				]
			}
		]
	}
}
