{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2023468410000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-46841 on Ubuntu 20.04 LTS (focal) - medium",
		"description": "Recent x86 CPUs offer functionality named Control-flow EnforcementTechnology (CET).  A sub-feature of this are Shadow Stacks (CET-SS).CET-SS is a hardware feature designed to protect against Return OrientedProgramming attacks. When enabled, traditional stacks holding both dataand return addresses are accompanied by so called \"shadow stacks\",holding little more than return addresses.  Shadow stacks aren'twritable by normal instructions, and upon function returns theircontents are used to check for possible manipulation of a return addresscoming from the traditional stack.In particular certain memory accesses need intercepting by Xen.  Invarious cases the necessary emulation involves kind of replaying ofthe instruction.  Such replaying typically involves filling and theninvoking of a stub.  Such a replayed instruction may raise anexceptions, which is expected and dealt with accordingly.Unfortunately the interaction of both of the above wasn't right:Recovery involves removal of a call frame from the (traditional) stack.The counterpart of this operation for the shadow stack was missing.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-46841",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-46841"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-03-20 11:15:00 UTC",
			"cve": {
				"text": "CVE-2023-46841",
				"href": "https://ubuntu.com/security/CVE-2023-46841",
				"public": "20240320"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2020276700000000",
						"comment": "xen package in focal is affected and may need fixing."
					}
				]
			}
		]
	}
}
