{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.bionic:def:2021326180000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2021-32618 on Ubuntu 18.04 FIPS Compliant (bionic) - low.",
    "Description": "The Python \"Flask-Security-Too\" package is used for adding security features to your Flask application. It is an is an independently maintained version of Flask-Security based on the 3.0.0 version of Flask-Security. All versions of Flask-Security-Too allow redirects after many successful views (e.g. /login) by honoring the ?next query param. There is code in FS to validate that the url specified in the next parameter is either relative OR has the same netloc (network location) as the requesting URL. This check utilizes Pythons urlsplit library. However many browsers are very lenient on the kind of URL they accept and 'fill in the blanks' when presented with a possibly incomplete URL. As a concrete example - setting http://login?next=\\\\\\github.com will pass FS's relative URL check however many browsers will gladly convert this to http://github.com. Thus an attacker could send such a link to an unwitting user, using a legitimate site and have it redirect to whatever site they want. This is considered a low severity due to the fact that if Werkzeug is used (which is very common with Flask applications) as the WSGI layer, it by default ALWAYS ensures that the Location header is absolute - thus making this attack vector mute. It is possible for application writers to modify this default behavior by setting the 'autocorrect_location_header=False`.",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 18.04 FIPS Compliant"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2021-32618",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-32618"
    },
    "advisory": {
      "Severity": "Low",
      "Rights": "Copyright (C) 2021 Canonical Ltd.",
      "PublicDate": "2021-05-17 18:15:00 UTC",
      "Bug": null,
      "cve": {
        "text": "CVE-2021-32618",
        "href": "https://ubuntu.com/security/CVE-2021-32618",
        "public": "20210517",
        "cvss_score": "6.1",
        "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N"
      },
      "PublicDateAtUsn": "",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": ""
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.bionic:tst:2021212410000000",
        "comment": "flask-security: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needs-triage')."
      }
    ]
  }
}
