{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.bionic:def:2022247780000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2022-24778 on Ubuntu 18.04 FIPS Compliant (bionic) - medium.",
    "Description": "The imgcrypt library provides API exensions for containerd to support encrypted container images and implements the ctd-decoder command line tool for use by containerd to decrypt encrypted container images. The imgcrypt function `CheckAuthorization` is supposed to check whether the current used is authorized to access an encrypted image and prevent the user from running an image that another user previously decrypted on the same system. In versions prior to 1.1.4, a failure occurs when an image with a ManifestList is used and the architecture of the local host is not the first one in the ManifestList. Only the first architecture in the list was tested, which may not have its layers available locally since it could not be run on the host architecture. Therefore, the verdict on unavailable layers was that the image could be run anticipating that image run failure would occur later due to the layers not being available. However, this verdict to allow the image to run enabled other architectures in the ManifestList to run an image without providing keys if that image had previously been decrypted. A patch has been applied to imgcrypt 1.1.4. Workarounds may include usage of different namespaces for each remote user.\n\nUpdate Instructions:\n\nRun `sudo pro fix CVE-2022-24778` to fix the vulnerability. The problem can be corrected\nby updating your system to the following package versions:\n\ncontainerd - 1.5.9-0ubuntu1~18.04.2\nNo subscription required",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 18.04 FIPS Compliant"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2022-24778",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-24778"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2022 Canonical Ltd.",
      "PublicDate": "2022-03-25 18:15:00 UTC",
      "Bug": [
        "https://github.com/containerd/imgcrypt/issues/69"
      ],
      "cve": {
        "text": "CVE-2022-24778",
        "href": "https://ubuntu.com/security/CVE-2022-24778",
        "public": "20220325",
        "cvss_score": "7.5",
        "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N",
        "usns": "5776-1"
      },
      "PublicDateAtUsn": "2022-03-25 18:15:00 UTC",
      "AssignedTo": "litios",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": ""
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.bionic:tst:2022234710000000",
        "comment": "containerd package in bionic was vulnerable but has been fixed (note: '1.5.9-0ubuntu1~18.04.2')."
      }
    ]
  }
}
