{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2022235380000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2022-23538 on Ubuntu 18.04 FIPS Compliant (bionic) - medium",
		"Description": "github.com/sylabs/scs-library-client is the Go client for the SingularityContainer Services (SCS) Container Library Service. When thescs-library-client is used to pull a container image, with authentication,the HTTP Authorization header sent by the client to the library service maybe incorrectly leaked to an S3 backing storage provider. This occurs in aspecific flow, where the library service redirects the client to a backingS3 storage server, to perform a multi-part concurrent download. Dependingon site configuration, the S3 service may be provided by a third party. Anattacker with access to the S3 service may be able to extract usercredentials, allowing them to impersonate the user. The vulnerablemulti-part concurrent download flow, with redirect to S3, is only used whencommunicating with a Singularity Enterprise 1.x installation, or thirdparty server implementing this flow. Interaction with SingularityEnterprise 2.x, and Singularity Container Services (cloud.sylabs.io), doesnot trigger the vulnerable flow. We encourage all users to update. Userswho interact with a Singularity Enterprise 1.x installation, using a 3rdparty S3 storage service, are advised to revoke and recreate theirauthentication tokens within Singularity Enterprise. There is no workaroundavailable at this time.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 18.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-23538",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-23538"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2023 Canonical Ltd.",
			"PublicDate": "2023-01-17 21:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2022-23538",
				"href": "https://ubuntu.com/security/CVE-2022-23538",
				"public": "20230117",
				"cvss_score": "7.6",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:H/I:L/A:N"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2018120210000000",
						"comment": "singularity-container: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needs-triage')."
					}
				]
			}
		]
	}
}
