{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2024268260000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26826 on Ubuntu 18.04 FIPS Compliant (bionic) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: mptcp:fix data re-injection from stale subflow When the MPTCP PM detects that asubflow is stale, all the packet scheduler must re-inject all themptcp-level unacked data. To avoid acquiring unneeded locks, it first tryto check if any unacked data is present at all in the RTX queue, but suchcheck is currently broken, as it uses TCP-specific helper on an MPTCPsocket. Funnily enough fuzzers and static checkers are happy, as theaccessed memory still belongs to the mptcp_sock struct, and even from afunctional perspective the recovery completed successfully, as theshort-cut test always failed. A recent unrelated TCP change - commitd5fed5addb2b (\"tcp: reorganize tcp_sock fast path variables\") - exposed theissue, as the tcp field reorganization makes the mptcp code always skip there-inection. Fix the issue dropping the bogus call: we are on a slow path,the early optimization proved once again to be evil.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26826",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-26826"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-04-17 10:15:00 UTC",
			"cve": {
				"text": "CVE-2024-26826",
				"href": "https://ubuntu.com/security/CVE-2024-26826",
				"public": "20240417"
			},
			"public_date_at_usn": "2024-04-17 10:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-6766-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201585530000010",
						"comment": "linux-fips package in fips-updates/bionic is affected and may need fixing."
					}
				]
			}
		]
	}
}
