{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:202137110000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-3711 on Ubuntu 18.04 FIPS Compliant (bionic) - high",
		"description": "In order to decrypt SM2 encrypted data an application is expected to callthe API function EVP_PKEY_decrypt(). Typically an application will callthis function twice. The first time, on entry, the \"out\" parameter can beNULL and, on exit, the \"outlen\" parameter is populated with the buffer sizerequired to hold the decrypted plaintext. The application can then allocatea sufficiently sized buffer and call EVP_PKEY_decrypt() again, but thistime passing a non-NULL value for the \"out\" parameter. A bug in theimplementation of the SM2 decryption code means that the calculation of thebuffer size required to hold the plaintext returned by the first call toEVP_PKEY_decrypt() can be smaller than the actual size required by thesecond call. This can lead to a buffer overflow when EVP_PKEY_decrypt() iscalled by the application a second time with a buffer that is too small. Amalicious attacker who is able present SM2 content for decryption to anapplication could cause attacker chosen data to overflow the buffer by upto a maximum of 62 bytes altering the contents of other data held after thebuffer, possibly changing application behaviour or causing the applicationto crash. The location of the buffer is application dependent but istypically heap allocated. Fixed in OpenSSL 1.1.1l (Affected 1.1.1-1.1.1k).\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2021-3711` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nlibssl1.1 - 1.1.1-1ubuntu2.1~18.04.13\nopenssl - 1.1.1-1ubuntu2.1~18.04.13\nNo subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-3711",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-3711"
		},
		"advisory": {
			"severity": "High",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-08-24",
			"cve": {
				"text": "CVE-2021-3711",
				"href": "https://ubuntu.com/security/CVE-2021-3711",
				"public": "20210824",
				"cvss_score": "9.8",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
				"usns": "5051-1"
			},
			"public_date_at_usn": "2021-08-24",
			"ref": [
				"https://ubuntu.com/security/notices/USN-5051-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:202137110000000",
						"comment": "openssl package in bionic was vulnerable but has been fixed (note: '1.1.1-1ubuntu2.1~18.04.13')."
					}
				]
			}
		]
	}
}
