{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2021377120000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-37712 on Ubuntu 18.04 FIPS Compliant (bionic) - medium",
		"description": "The npm package \"tar\" (aka node-tar) before versions 4.4.18, 5.0.10, and6.1.9 has an arbitrary file creation/overwrite and arbitrary code executionvulnerability. node-tar aims to guarantee that any file whose locationwould be modified by a symbolic link is not extracted. This is, in part,achieved by ensuring that extracted directories are not symlinks.Additionally, in order to prevent unnecessary stat calls to determinewhether a given path is a directory, paths are cached when directories arecreated. This logic was insufficient when extracting tar files thatcontained both a directory and a symlink with names containing unicodevalues that normalized to the same value. Additionally, on Windows systems,long path portions would resolve to the same file system entities as their8.3 \"short path\" counterparts. A specially crafted tar archive could thusinclude a directory with one form of the path, followed by a symbolic linkwith a different string that resolves to the same file system entity,followed by a file using the first form. By first creating a directory, andthen replacing that directory with a symlink that had a different apparentname that resolved to the same entry in the filesystem, it was thuspossible to bypass node-tar symlink checks on directories, essentiallyallowing an untrusted tar file to symlink into an arbitrary location andsubsequently extracting arbitrary files into that location, thus allowingarbitrary file creation and overwrite. These issues were addressed inreleases 4.4.18, 5.0.10 and 6.1.9. The v3 branch of node-tar has beendeprecated and did not receive patches for these issues. If you are stillusing a v3 release we recommend you update to a more recent version ofnode-tar. If this is not possible, a workaround is available in thereferenced GHSA-qq89-hq3f-393p.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-37712",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-37712"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-08-31 17:15:00 UTC",
			"cve": {
				"text": "CVE-2021-37712",
				"href": "https://ubuntu.com/security/CVE-2021-37712",
				"public": "20210831",
				"cvss_score": "8.6",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2021328040000000",
						"comment": "node-tar: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needs-triage')."
					}
				]
			}
		]
	}
}
