{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2024352470000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-35247 on Ubuntu 18.04 FIPS Compliant (bionic) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: fpga:region: add owner module and take its refcount The current implementationof the fpga region assumes that the low-level module registers a driver forthe parent device and uses its owner pointer to take the module's refcount.This approach is problematic since it can lead to a null pointerdereference while attempting to get the region during programming if theparent device does not have a driver. To address this problem, add a moduleowner pointer to the fpga_region struct and use it to take the module'srefcount. Modify the functions for registering a region to take anadditional owner module parameter and rename them to avoid conflicts. Usethe old function names for helper macros that automatically set the modulethat registers the region as the owner. This ensures compatibility withexisting low-level control modules and reduces the chances of registering aregion without setting the owner. Also, update the documentation to keep itconsistent with the new interface for registering an fpga region.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-35247",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-35247"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-06-24 14:15:00 UTC",
			"cve": {
				"text": "CVE-2024-35247",
				"href": "https://ubuntu.com/security/CVE-2024-35247",
				"public": "20240624"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201585530000010",
						"comment": "linux-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000320",
						"comment": "linux-aws-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000330",
						"comment": "linux-azure-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000340",
						"comment": "linux-gcp-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					}
				]
			}
		]
	}
}
