{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2022361130000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-36113 on Ubuntu Pro FIPS-updates 18.04 LTS (bionic) - low",
		"description": "Cargo is a package manager for the rust programming language. After apackage is downloaded, Cargo extracts its source code in the ~/.cargofolder on disk, making it available to the Rust projects it builds. Torecord when an extraction is successful, Cargo writes \"ok\" to the .cargo-okfile at the root of the extracted source code once it extracted all thefiles. It was discovered that Cargo allowed packages to contain a .cargo-oksymbolic link, which Cargo would extract. Then, when Cargo attempted towrite \"ok\" into .cargo-ok, it would actually replace the first two bytes ofthe file the symlink pointed to with ok. This would allow an attacker tocorrupt one file on the machine using Cargo to extract the package. Notethat by design Cargo allows code execution at build time, due to buildscripts and procedural macros. The vulnerabilities in this advisory allowperforming a subset of the possible damage in a harder to track down way.Your dependencies must still be trusted if you want to be protected fromattacks, as it's possible to perform the same attacks with build scriptsand procedural macros. The vulnerability is present in all versions ofCargo. Rust 1.64, to be released on September 22nd, will include a fix forit. Since the vulnerability is just a more limited way to accomplish what amalicious build scripts or procedural macros can do, we decided not topublish Rust point releases backporting the security fix. Patch files areavailable for Rust 1.63.0 are available in the wg-security-responserepository for people building their own toolchain. Mitigations Werecommend users of alternate registries to exercise care in which packagethey download, by only including trusted dependencies in their projects.Please note that even with these vulnerabilities fixed, by design Cargoallows arbitrary code execution at build time thanks to build scripts andprocedural macros: a malicious dependency will be able to cause damageregardless of these vulnerabilities. crates.io implemented server-sidechecks to reject these kinds of packages years ago, and there are nopackages on crates.io exploiting these vulnerabilities. crates.io usersstill need to exercise care in choosing their dependencies though, asremote code execution is allowed by design there as well.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS-updates 18.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-36113",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2022-36113"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-09-14 18:15:00 UTC",
			"cve": {
				"text": "CVE-2022-36113",
				"href": "https://ubuntu.com/security/CVE-2022-36113",
				"public": "20220914",
				"cvss_score": "8.1",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2022361130000000",
						"comment": "cargo package in bionic is affected and needs fixing."
					}
				]
			}
		]
	}
}
