{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:201791060000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2017-9106 on Ubuntu 18.04 FIPS Compliant (bionic) - medium",
		"Description": "An issue was discovered in adns before 1.5.2. adns_rr_info mishandles abogus *datap. The general pattern for formatting integers is to sprintfinto a fixed-size buffer. This is correct if the input is in the rightrange; if it isn't, the buffer may be overrun (depending on the sizes ofthe types on the current platform). Of course the inputs ought to be right.And there are pointers in there too, so perhaps one could say that thecaller ought to check these things. It may be better to require the callerto make the pointer structure right, but to have the code here be defensiveabout (and tolerate with an error but without crashing) out-of-rangeinteger values. So: it should defend each of these integer conversion siteswith a check for the actual permitted range, and return adns_s_invaliddataif not. The lack of this check causes the SOA sign extension bug to be aserious security problem: the sign extended SOA value is out of range, andoverruns the buffer when reconverted. This is related to sign extending SOA32-bit integer fields, and use of a signed data type.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 18.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2017-9106",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-9106"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2020 Canonical Ltd.",
			"PublicDate": "2020-06-18 14:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2017-9106",
				"href": "https://ubuntu.com/security/CVE-2017-9106",
				"public": "20200618",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201791030000000",
						"comment": "adns: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needed')."
					}
				]
			}
		]
	}
}
