{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2020262370000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2020-26237 on Ubuntu 18.04 FIPS Compliant (bionic) - medium",
		"Description": "Highlight.js is a syntax highlighter written in JavaScript. Highlight.jsversions before 9.18.2 and 10.1.2 are vulnerable to Prototype Pollution. Amalicious HTML code block can be crafted that will result in prototypepollution of the base object's prototype during highlighting. If you allowusers to insert custom HTML code blocks into your page/app via parsingMarkdown code blocks (or similar) and do not filter the language names theuser can provide you may be vulnerable. The pollution should just beharmless data but this can cause problems for applications not expectingthese properties to exist and can result in strange behavior or applicationcrashes, i.e. a potential DOS vector. If your website or application doesnot render user provided data it should be unaffected. Versions 9.18.2 and10.1.2 and newer include fixes for this vulnerability. If you are usingversion 7 or 8 you are encouraged to upgrade to a newer release.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 18.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-26237",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26237"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2020 Canonical Ltd.",
			"PublicDate": "2020-11-24 23:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2020-26237",
				"href": "https://ubuntu.com/security/CVE-2020-26237",
				"public": "20201124",
				"cvss_score": "8.7",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:N/I:H/A:H"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2020262370000000",
						"comment": "highlight.js: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needs-triage')."
					}
				]
			}
		]
	}
}
