{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2024267060000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26706 on Ubuntu 18.04 FIPS Compliant (bionic) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: parisc:Fix random data corruption from exception handler The current exceptionhandler implementation, which assists when accessing user space memory, mayexhibit random data corruption if the compiler decides to use a differentregister than the specified register %r29 (defined inASM_EXCEPTIONTABLE_REG) for the error code. If the compiler choose anotherregister, the fault handler will nevertheless store -EFAULT into %r29 andthus trash whatever this register is used for. Looking at the assembly Ifound that this happens sometimes in emulate_ldd(). To solve the issue, theeasiest solution would be if it somehow is possible to tell the faulthandler which register is used to hold the error code. Using %0 or %1 inthe inline assembly is not posssible as it will show up as e.g. %r29 (withthe \"%r\" prefix), which the GNU assembler can not convert to an integer.This patch takes another, better and more flexible approach: We extend the__ex_table (which is out of the execution path) by one 32-word. In thisword we tell the compiler to insert the assembler instruction \"or%r0,%r0,%reg\", where %reg references the register which the compilerchoosed for the error return code. In case of an access failure, the faulthandler finds the __ex_table entry and can examine the opcode. The usedregister is encoded in the lowest 5 bits, and the fault handler can thenstore -EFAULT into this register. Since we extend the __ex_table to 3 wordswe can't use the BUILDTIME_TABLE_SORT config option any longer.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26706",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-26706"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-04-03 15:15:00 UTC",
			"cve": {
				"text": "CVE-2024-26706",
				"href": "https://ubuntu.com/security/CVE-2024-26706",
				"public": "20240403"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201585530000010",
						"comment": "linux-fips package in fips-updates/bionic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000320",
						"comment": "linux-aws-fips package in fips-updates/bionic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000330",
						"comment": "linux-azure-fips package in fips-updates/bionic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000340",
						"comment": "linux-gcp-fips package in fips-updates/bionic is affected and may need fixing."
					}
				]
			}
		]
	}
}
