{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2024269560000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26956 on Ubuntu 18.04 FIPS Compliant (bionic) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: nilfs2:fix failure to detect DAT corruption in btree and direct mappings Patchseries \"nilfs2: fix kernel bug at submit_bh_wbc()\". This resolves a kernelBUG reported by syzbot. Since there are two flaws involved, I've made eachone a separate patch. The first patch alone resolves the syzbot-reportedbug, but I think both fixes should be sent to stable, so I've tagged themas such. This patch (of 2): Syzbot has reported a kernel bug insubmit_bh_wbc() when writing file data to a nilfs2 file system whosemetadata is corrupted. There are two flaws involved in this issue. Thefirst flaw is that when nilfs_get_block() locates a data block using btreeor direct mapping, if the disk address translation routinenilfs_dat_translate() fails with internal code -ENOENT due to DAT metadatacorruption, it can be passed back to nilfs_get_block(). This causesnilfs_get_block() to misidentify an existing block as non-existent, causingboth data block lookup and insertion to fail inconsistently. The secondflaw is that nilfs_get_block() returns a successful status in thisinconsistent state. This causes the caller __block_write_begin_int() orothers to request a read even though the buffer is not mapped, resulting ina BUG_ON check for the BH_Mapped flag in submit_bh_wbc() failing. Thisfixes the first issue by changing the return value to code -EINVAL when aconversion using DAT fails with code -ENOENT, avoiding the conflictingcondition that leads to the kernel bug described above. Here, code -EINVALindicates that metadata corruption was detected during the block lookup,which will be properly handled as a file system error and converted to -EIOwhen passing through the nilfs2 bmap layer.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Compliant"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26956",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-26956"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-01 06:15:00 UTC",
			"cve": {
				"text": "CVE-2024-26956",
				"href": "https://ubuntu.com/security/CVE-2024-26956",
				"public": "20240501"
			},
			"public_date_at_usn": "2024-05-01 06:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-6816-1",
				"https://ubuntu.com/security/notices/USN-6817-1",
				"https://ubuntu.com/security/notices/USN-6817-2",
				"https://ubuntu.com/security/notices/USN-6817-3",
				"https://ubuntu.com/security/notices/USN-6878-1",
				"https://ubuntu.com/security/notices/USN-6896-1",
				"https://ubuntu.com/security/notices/USN-6898-1",
				"https://ubuntu.com/security/notices/USN-6896-2"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201585530000010",
						"comment": "linux-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000320",
						"comment": "linux-aws-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000330",
						"comment": "linux-azure-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000340",
						"comment": "linux-gcp-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					}
				]
			}
		]
	}
}
