{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.lunar:def:2021326770000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2021-32677 on Ubuntu 23.04 (lunar) - medium.",
    "Description": "FastAPI is a web framework for building APIs with Python 3.6+ based on standard Python type hints. FastAPI versions lower than 0.65.2 that used cookies for authentication in path operations that received JSON payloads sent by browsers were vulnerable to a Cross-Site Request Forgery (CSRF) attack. In versions lower than 0.65.2, FastAPI would try to read the request payload as JSON even if the content-type header sent was not set to application/json or a compatible JSON media type (e.g. application/geo+json). A request with a content type of text/plain containing JSON data would be accepted and the JSON data would be extracted. Requests with content type text/plain are exempt from CORS preflights, for being considered Simple requests. The browser will execute them right away including cookies, and the text content could be a JSON string that would be parsed and accepted by the FastAPI application. This is fixed in FastAPI 0.65.2. The request data is now parsed as JSON only if the content-type header is application/json or another JSON compatible media type like application/geo+json. It's best to upgrade to the latest FastAPI, but if updating is not possible then a middleware or a dependency that checks the content-type header and aborts the request if it is not application/json or another JSON compatible content type can act as a mitigating workaround.\n\nUpdate Instructions:\n\nRun `sudo pro fix CVE-2021-32677` to fix the vulnerability. The problem can be corrected\nby updating your system to the following package versions:\n\npython3-fastapi - 0.74.1-1\nNo subscription required",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 23.04"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2021-32677",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-32677"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2021 Canonical Ltd.",
      "PublicDate": "2021-06-09 18:15:00 UTC",
      "Bug": null,
      "cve": {
        "text": "CVE-2021-32677",
        "href": "https://ubuntu.com/security/CVE-2021-32677",
        "public": "20210609",
        "cvss_score": "8.1",
        "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:N"
      },
      "PublicDateAtUsn": "",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": ""
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.lunar:tst:2021326770000000",
        "comment": "fastapi package in lunar, is related to the CVE in some way and has been fixed (note: '0.74.1-1')."
      }
    ]
  }
}
