{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.lunar:def:2023359340000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2023-35934 on Ubuntu 23.04 (lunar) - medium",
		"Description": "yt-dlp is a command-line program to download videos from video sites.During file downloads, yt-dlp or the external downloaders that yt-dlpemploys may leak cookies on HTTP redirects to a different host, or leakthem when the host for download fragments differs from their parentmanifest's host. This vulnerable behavior is present in yt-dlp prior to2023.07.06 and nightly 2023.07.06.185519. All native and externaldownloaders are affected, except for `curl` and `httpie` (version 3.1.0 orlater). At the file download stage, all cookies are passed by yt-dlp to thefile downloader as a `Cookie` header, thereby losing their scope. This alsooccurs in yt-dlp's info JSON output, which may be used by external tools.As a result, the downloader or external tool may indiscriminately sendcookies with requests to domains or paths for which the cookies are notscoped. yt-dlp version 2023.07.06 and nightly 2023.07.06.185519 fix thisissue by removing the `Cookie` header upon HTTP redirects; having nativedownloaders calculate the `Cookie` header from the cookiejar, utilizingexternal downloaders' built-in support for cookies instead of passing themas header arguments, disabling HTTP redirectiong if the external downloaderdoes not have proper cookie support, processing cookies passed as HTTPheaders to limit their scope, and having a separate field for cookies inthe info dict storing more information about scoping Some workarounds areavailable for those who are unable to upgrade. Avoid using cookies and userauthentication methods. While extractors may set custom cookies, theseusually do not contain sensitive information. Alternatively, avoid using`--load-info-json`. Or, if authentication is a must: verify the integrityof download links from unknown sources in browser (including redirects)before passing them to yt-dlp; use `curl` as external downloader, since itis not impacted; and/or avoid fragmented formats such as HLS/m3u8, DASH/mpdand ISM.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 23.04"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-35934",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-35934"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2023 Canonical Ltd.",
			"PublicDate": "2023-07-06 20:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2023-35934",
				"href": "https://ubuntu.com/security/CVE-2023-35934",
				"public": "20230706",
				"cvss_score": "8.2",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:H/I:L/A:N"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.lunar:tst:2023359340000000",
						"comment": "yt-dlp package in lunar is affected and may need fixing."
					}
				]
			}
		]
	}
}
