{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.lunar:def:2022310420000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2022-31042 on Ubuntu 23.04 (lunar) - low.",
		"Description": "Guzzle is an open source PHP HTTP client. In affected versions the `Cookie` headers on requests are sensitive information. On making a request using the `https` scheme to a server which responds with a redirect to a URI with the `http` scheme, or on making a request to a server which responds with a redirect to a a URI to a different host, we should not forward the `Cookie` header on. Prior to this fix, only cookies that were managed by our cookie middleware would be safely removed, and any `Cookie` header manually added to the initial request would not be stripped. We now always strip it, and allow the cookie middleware to re-add any cookies that it deems should be there. Affected Guzzle 7 users should upgrade to Guzzle 7.4.4 as soon as possible. Affected users using any earlier series of Guzzle should upgrade to Guzzle 6.5.7 or 7.4.4. Users unable to upgrade may consider an alternative approach to use your own redirect middleware, rather than ours. If you do not require or expect redirects to be followed, one should simply disable redirects all together.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 23.04"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-31042",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-31042"
		},
		"advisory": {
			"Severity": "Low",
			"Rights": "Copyright (C) 2022 Canonical Ltd.",
			"PublicDate": "2022-06-10 00:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2022-31042",
				"href": "https://ubuntu.com/security/CVE-2022-31042",
				"public": "20220610",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.lunar:tst:2022292480000000",
				"comment": "guzzle package in lunar is affected and may need fixing."
			}
		]
	}
}
