{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.lunar:def:2022292380000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2022-29238 on Ubuntu 23.04 (lunar) - medium.",
    "Description": "Jupyter Notebook is a web-based notebook environment for interactive computing. Prior to version 6.4.12, authenticated requests to the notebook server with `ContentsManager.allow_hidden = False` only prevented listing the contents of hidden directories, not accessing individual hidden files or files in hidden directories (i.e. hidden files were 'hidden' but not 'inaccessible'). This could lead to notebook configurations allowing authenticated access to files that may reasonably be expected to be disallowed. Because fully authenticated requests are required, this is of relatively low impact. But if a server's root directory contains sensitive files whose only protection from the server is being hidden (e.g. `~/.ssh` while serving $HOME), then any authenticated requests could access files if their names are guessable. Such contexts also necessarily have full access to the server and therefore execution permissions, which also generally grants access to all the same files. So this does not generally result in any privilege escalation or increase in information access, only an additional, unintended means by which the files could be accessed. Version 6.4.12 contains a patch for this issue. There are currently no known workarounds.",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 23.04"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2022-29238",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-29238"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2022 Canonical Ltd.",
      "PublicDate": "2022-06-14 18:15:00 UTC",
      "Bug": [
        "https://bugs.launchpad.net/ubuntu/+source/jupyter-notebook/+bug/1982670"
      ],
      "cve": {
        "text": "CVE-2022-29238",
        "href": "https://ubuntu.com/security/CVE-2022-29238",
        "public": "20220614",
        "cvss_score": "4.3",
        "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N",
        "usns": "5585-1"
      },
      "PublicDateAtUsn": "2022-06-14 18:15:00 UTC",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": "sbeattie> the allow-hidden feature was added in jupyter-notebook upstream commit 605eaa72b (\"Added a flag to allow access of hidden files (#2819)\") (version 5.3.0rc1), and as such, bionic's 5.2.x based version is not affected. Thanks to Luís Infante da Câmara for researching this."
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.lunar:tst:2019108560000000",
        "comment": "jupyter-notebook package in lunar is affected and needs fixing."
      }
    ]
  }
}
