{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.lunar:def:2023368300000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-36830 on Ubuntu 23.04 (lunar) - medium",
		"description": "SQLFluff is a SQL linter. Prior to version 2.1.2, in environments whereuntrusted users have access to the config files, there is a potentialsecurity vulnerability where those users could use the `library_path`config value to allow arbitrary python code to be executed via macros. Formany users who use SQLFluff in the context of an environment where allusers already have fairly escalated privileges, this may not be an issue -however in larger user bases, or where SQLFluff is bundled into anothertool where developers still wish to give users access to supply their onrule configuration, this may be an issue. The 2.1.2 release offers theability for the `library_path` argument to be overwritten on the commandline by using the `--library-path` option. This overrides any valuesprovided in the config files and effectively prevents this route of attackfor users which have access to the config file, but not to the scriptswhich call the SQLFluff CLI directly. A similar option is provided for thePython API, where users also have a greater ability to further customise oroverride configuration as necessary. Unless `library_path` is explicitlyrequired, SQLFluff maintainers recommend using the option `--library-pathnone` when invoking SQLFluff which will disable the `library-path` optionentirely regardless of the options set in the configuration file or viainline config directives. As a workaround, limiting access to - orotherwise validating configuration files before they are ingested bySQLFluff will provides a similar effect and does not require upgrade.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 23.04"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-36830",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-36830"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-07-06 16:15:00 UTC",
			"cve": {
				"text": "CVE-2023-36830",
				"href": "https://ubuntu.com/security/CVE-2023-36830",
				"public": "20230706",
				"cvss_score": "7.8",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.lunar:tst:2023368300000000",
						"comment": "sqlfluff package in lunar is affected and may need fixing."
					}
				]
			}
		]
	}
}
