{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.lunar:def:2021437840000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-43784 on Ubuntu 23.04 (lunar) - low",
		"Description": "runc is a CLI tool for spawning and running containers on Linux accordingto the OCI specification. In runc, netlink is used internally as aserialization system for specifying the relevant container configuration tothe `C` portion of the code (responsible for the based namespace setup ofcontainers). In all versions of runc prior to 1.0.3, the encoder did nothandle the possibility of an integer overflow in the 16-bit length fieldfor the byte array attribute type, meaning that a large enough maliciousbyte array attribute could result in the length overflowing and theattribute contents being parsed as netlink messages for containerconfiguration. This vulnerability requires the attacker to have somecontrol over the configuration of the container and would allow theattacker to bypass the namespace restrictions of the container by simplyadding their own netlink payload which disables all namespaces. The mainusers impacted are those who allow untrusted images with untrustedconfigurations to run on their machines (such as with shared cloudinfrastructure). runc version 1.0.3 contains a fix for this bug. As aworkaround, one may try disallowing untrusted namespace paths from yourcontainer. It should be noted that untrusted namespace paths would allowthe attacker to disable namespace protections entirely even in the absenceof this bug.\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2021-43784` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nrunc - 1.0.3-0\nNo subscription required",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 23.04"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-43784",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-43784"
		},
		"advisory": {
			"Severity": "Low",
			"Rights": "Copyright (C) 2021 Canonical Ltd.",
			"PublicDate": "2021-12-06 18:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2021-43784",
				"href": "https://ubuntu.com/security/CVE-2021-43784",
				"public": "20211206",
				"cvss_score": "5.0",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:L/I:L/A:L",
				"usns": "6088-2"
			},
			"PublicDateAtUsn": "2021-12-06 18:15:00 UTC",
			"AssignedTo": "litios",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": [
				"https://ubuntu.com/security/notices/USN-6088-2"
			]
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.lunar:tst:2021437840000000",
						"comment": "runc package in lunar, is related to the CVE in some way and has been fixed (note: '1.0.3-0')."
					}
				]
			}
		]
	}
}
