{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.lunar:def:202019380000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2020-1938 on Ubuntu 23.04 (lunar) - low",
		"description": "When using the Apache JServ Protocol (AJP), care must be taken whentrusting incoming connections to Apache Tomcat. Tomcat treats AJPconnections as having higher trust than, for example, a similar HTTPconnection. If such connections are available to an attacker, they can beexploited in ways that may be surprising. In Apache Tomcat 9.0.0.M1 to9.0.0.30, 8.5.0 to 8.5.50 and 7.0.0 to 7.0.99, Tomcat shipped with an AJPConnector enabled by default that listened on all configured IP addresses.It was expected (and recommended in the security guide) that this Connectorwould be disabled if not required. This vulnerability report identified amechanism that allowed: - returning arbitrary files from anywhere in theweb application - processing any file in the web application as a JSPFurther, if the web application allowed file upload and stored those fileswithin the web application (or the attacker was able to control the contentof the web application by some other means) then this, along with theability to process a file as a JSP, made remote code execution possible. Itis important to note that mitigation is only required if an AJP port isaccessible to untrusted users. Users wishing to take a defence-in-depthapproach and block the vector that permits returning arbitrary files andexecution as JSP may upgrade to Apache Tomcat 9.0.31, 8.5.51 or 7.0.100 orlater. A number of changes were made to the default AJP Connectorconfiguration in 9.0.31 to harden the default configuration. It is likelythat users upgrading to 9.0.31, 8.5.51 or 7.0.100 or later will need tomake small changes to their configurations.\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2020-1938` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nlibtomcat9-embed-java - 9.0.31-1\nlibtomcat9-java - 9.0.31-1\ntomcat9 - 9.0.31-1\ntomcat9-admin - 9.0.31-1\ntomcat9-common - 9.0.31-1\ntomcat9-examples - 9.0.31-1\ntomcat9-user - 9.0.31-1\nNo subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 23.04"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-1938",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-1938"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2020 Canonical Ltd.",
			"public_date": "2020-02-24 22:15:00 UTC",
			"bug": [
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=952437",
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=952438",
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=952436",
				"https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=959747 (apache support)",
				"https://bugs.launchpad.net/bugs/1865904"
			],
			"cve": {
				"text": "CVE-2020-1938",
				"href": "https://ubuntu.com/security/CVE-2020-1938",
				"public": "20200224",
				"cvss_score": "9.8",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.lunar:tst:2019124180000000",
						"comment": "tomcat9 package in lunar, is related to the CVE in some way and has been fixed (note: '9.0.31-1')."
					}
				]
			}
		]
	}
}
