{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.lunar:def:2021294280000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-29428 on Ubuntu 23.04 (lunar) - medium",
		"description": "In Gradle before version 7.0, on Unix-like systems, the system temporarydirectory can be created with open permissions that allow multiple users tocreate and delete files within it. Gradle builds could be vulnerable to alocal privilege escalation from an attacker quickly deleting and recreatingfiles in the system temporary directory. This vulnerability impacted buildsusing precompiled script plugins written in Kotlin DSL and tests for Gradleplugins written using ProjectBuilder or TestKit. If you are on Windows ormodern versions of macOS, you are not vulnerable. If you are on a Unix-likeoperating system with the \"sticky\" bit set on your system temporarydirectory, you are not vulnerable. The problem has been patched andreleased with Gradle 7.0. As a workaround, on Unix-like operating systems,ensure that the \"sticky\" bit is set. This only allows the original user (orroot) to delete a file. If you are unable to change the permissions of thesystem temporary directory, you can move the Java temporary directory bysetting the System Property `java.io.tmpdir`. The new path needs to limitpermissions to the build user only. For additional details refer to thereferenced GitHub Security Advisory.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 23.04"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-29428",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-29428"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-04-13 20:15:00 UTC",
			"cve": {
				"text": "CVE-2021-29428",
				"href": "https://ubuntu.com/security/CVE-2021-29428",
				"public": "20210413",
				"cvss_score": "7.8",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.lunar:tst:2019150520000000",
						"comment": "gradle package in lunar is affected and needs fixing."
					}
				]
			}
		]
	}
}
