{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2023281170000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-28117 on Ubuntu 22.04 ESM (jammy) - medium",
		"description": "Sentry SDK is the official Python SDK for Sentry, real-time crash reportingsoftware. When using the Django integration of versions prior to 1.14.0 ofthe Sentry SDK in a specific configuration it is possible to leak sensitivecookies values, including the session cookie to Sentry. These sensitivecookies could then be used by someone with access to your Sentry issues toimpersonate or escalate their privileges within your application. In orderfor these sensitive values to be leaked, the Sentry SDK configuration musthave `sendDefaultPII` set to `True`; one must use a custom name for either`SESSION_COOKIE_NAME` or `CSRF_COOKIE_NAME` in one's Django settings; andone must not be configured in one's organization or project settings to useSentry's data scrubbing features to account for the custom cookie names. Asof version 1.14.0, the Django integration of the `sentry-sdk` will detectthe custom cookie names based on one's Django settings and will remove thevalues from the payload before sending the data to Sentry. As a workaround,use the SDK's filtering mechanism to remove the cookies from the payloadthat is sent to Sentry. For error events, this can be done with the`before_send` callback method and for performance related events(transactions) one can use the `before_send_transaction` callback method.Those who want to handle filtering of these values on the server-side canalso use Sentry's advanced data scrubbing feature to account for the customcookie names. Look for the `$http.cookies`, `$http.headers`,`$request.cookies`, or `$request.headers` fields to target with a scrubbingrule.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-28117",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-28117"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-03-22 20:15:00 UTC",
			"cve": {
				"text": "CVE-2023-28117",
				"href": "https://ubuntu.com/security/CVE-2023-28117",
				"public": "20230322",
				"cvss_score": "6.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2022234850000000",
						"comment": "sentry-python package in esm-apps/jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
