{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2021326770000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-32677 on Ubuntu 22.04 ESM (jammy) - medium",
		"description": "FastAPI is a web framework for building APIs with Python 3.6+ based onstandard Python type hints. FastAPI versions lower than 0.65.2 that usedcookies for authentication in path operations that received JSON payloadssent by browsers were vulnerable to a Cross-Site Request Forgery (CSRF)attack. In versions lower than 0.65.2, FastAPI would try to read therequest payload as JSON even if the content-type header sent was not set toapplication/json or a compatible JSON media type (e.g.application/geo+json). A request with a content type of text/plaincontaining JSON data would be accepted and the JSON data would beextracted. Requests with content type text/plain are exempt from CORSpreflights, for being considered Simple requests. The browser will executethem right away including cookies, and the text content could be a JSONstring that would be parsed and accepted by the FastAPI application. Thisis fixed in FastAPI 0.65.2. The request data is now parsed as JSON only ifthe content-type header is application/json or another JSON compatiblemedia type like application/geo+json. It's best to upgrade to the latestFastAPI, but if updating is not possible then a middleware or a dependencythat checks the content-type header and aborts the request if it is notapplication/json or another JSON compatible content type can act as amitigating workaround.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-32677",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-32677"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-06-09 18:15:00 UTC",
			"cve": {
				"text": "CVE-2021-32677",
				"href": "https://ubuntu.com/security/CVE-2021-32677",
				"public": "20210609",
				"cvss_score": "8.1",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2021326770000000",
						"comment": "fastapi package in esm-apps/jammy is affected and needs fixing."
					}
				]
			}
		]
	}
}
