{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2022216680000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-21668 on Ubuntu 22.04 ESM (jammy) - medium",
		"description": "pipenv is a Python development workflow tool. Starting with version2018.10.9 and prior to version 2022.1.8, a flaw in pipenv's parsing ofrequirements files allows an attacker to insert a specially crafted stringinside a comment anywhere within a requirements.txt file, which will causevictims who use pipenv to install the requirements file to downloaddependencies from a package index server controlled by the attacker. Byembedding malicious code in packages served from their malicious indexserver, the attacker can trigger arbitrary remote code execution (RCE) onthe victims' systems. If an attacker is able to hide a malicious`--index-url` option in a requirements file that a victim installs withpipenv, the attacker can embed arbitrary malicious code in packages servedfrom their malicious index server that will be executed on the victim'shost during installation (remote code execution/RCE). When pip installsfrom a source distribution, any code in the setup.py is executed by theinstall process. This issue is patched in version 2022.1.8. The GitHubSecurity Advisory contains more information about this vulnerability.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-21668",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-21668"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-01-10 21:15:00 UTC",
			"cve": {
				"text": "CVE-2022-21668",
				"href": "https://ubuntu.com/security/CVE-2022-21668",
				"public": "20220110",
				"cvss_score": "8.6",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2022216680000000",
						"comment": "pipenv package in esm-apps/jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
