{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2023359360000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2023-35936 on Ubuntu 22.04 ESM (jammy) - medium.",
		"Description": "Pandoc is a Haskell library for converting from one markup format to another, and a command-line tool that uses this library. Starting in version 1.13 and prior to version 3.1.4, Pandoc is susceptible to an arbitrary file write vulnerability, which can be triggered by providing a specially crafted image element in the input when generating files using the `--extract-media` option or outputting to PDF format. This vulnerability allows an attacker to create or overwrite arbitrary files on the system ,depending on the privileges of the process running pandoc. It only affects systems that pass untrusted user input to pandoc and allow pandoc to be used to produce a PDF or with the `--extract-media` option. The fix is to unescape the percent-encoding prior to checking that the resource is not above the working directory, and prior to extracting the extension. Some code for checking that the path is below the working directory was flawed in a similar way and has also been fixed. Note that the `--sandbox` option, which only affects IO done by readers and writers themselves, does not block this vulnerability. The vulnerability is patched in pandoc 3.1.4. As a workaround, audit the pandoc command and disallow PDF output and the `--extract-media` option.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 22.04 ESM"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-35936",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-35936"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2023 Canonical Ltd.",
			"PublicDate": "2023-07-05 21:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2023-35936",
				"href": "https://ubuntu.com/security/CVE-2023-35936",
				"public": "20230705",
				"cvss_score": "5.0",
				"cvss_vector": "CVSS:3.1/AV:L/AC:H/PR:L/UI:R/S:U/C:N/I:H/A:L"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.jammy:tst:2023359360000000",
				"comment": "pandoc package in jammy is affected and may need fixing."
			}
		]
	}
}
