{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.kinetic:def:2021377010000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2021-37701 on Ubuntu 22.10 (kinetic) - medium.",
    "Description": "The npm package \"tar\" (aka node-tar) before versions 4.4.16, 5.0.8, and 6.1.7 has an arbitrary file creation/overwrite and arbitrary code execution vulnerability. node-tar aims to guarantee that any file whose location would be modified by a symbolic link is not extracted. This is, in part, achieved by ensuring that extracted directories are not symlinks. Additionally, in order to prevent unnecessary stat calls to determine whether a given path is a directory, paths are cached when directories are created. This logic was insufficient when extracting tar files that contained both a directory and a symlink with the same name as the directory, where the symlink and directory names in the archive entry used backslashes as a path separator on posix systems. The cache checking logic used both `\\` and `/` characters as path separators, however `\\` is a valid filename character on posix systems. By first creating a directory, and then replacing that directory with a symlink, it was thus possible to bypass node-tar symlink checks on directories, essentially allowing an untrusted tar file to symlink into an arbitrary location and subsequently extracting arbitrary files into that location, thus allowing arbitrary file creation and overwrite. Additionally, a similar confusion could arise on case-insensitive filesystems. If a tar archive contained a directory at `FOO`, followed by a symbolic link named `foo`, then on case-insensitive file systems, the creation of the symbolic link would remove the directory from the filesystem, but _not_ from the internal directory cache, as it would not be treated as a cache hit. A subsequent file entry within the `FOO` directory would then be placed in the target of the symbolic link, thinking that the directory had already been created. These issues were addressed in releases 4.4.16, 5.0.8 and 6.1.7. The v3 branch of node-tar has been deprecated and did not receive patches for these issues. If you are still using a v3 release we recommend you update to a more recent version of node-tar. If this is not possible, a workaround is available in the referenced GHSA-9r2w-394v-53qc.\n\nUpdate Instructions:\n\nRun `sudo pro fix CVE-2021-37701` to fix the vulnerability. The problem can be corrected\nby updating your system to the following package versions:\n\nnode-tar - 6.1.7+~cs11.3.10-1\nNo subscription required",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 22.10"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2021-37701",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-37701"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2021 Canonical Ltd.",
      "PublicDate": "2021-08-31 17:15:00 UTC",
      "Bug": null,
      "cve": {
        "text": "CVE-2021-37701",
        "href": "https://ubuntu.com/security/CVE-2021-37701",
        "severity": "medium",
        "public": "20210831",
        "cvss_score": "8.6",
        "cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H"
      },
      "PublicDateAtUsn": "",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": ""
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.kinetic:tst:2021377010000000",
        "comment": "node-tar package in kinetic, is related to the CVE in some way and has been fixed (note: '6.1.7+~cs11.3.10-1')."
      }
    ]
  }
}
