{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2024210850000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-21085 on Ubuntu 22.04 LTS (jammy) - medium",
		"description": "Vulnerability in the Oracle Java SE, Oracle GraalVM Enterprise Editionproduct of Oracle Java SE (component: Concurrency).  Supported versionsthat are affected are Oracle Java SE: 8u401, 8u401-perf, 11.0.22; OracleGraalVM Enterprise Edition: 20.3.13 and  21.3.9. Difficult to exploitvulnerability allows unauthenticated attacker with network access viamultiple protocols to compromise Oracle Java SE, Oracle GraalVM EnterpriseEdition.  Successful attacks of this vulnerability can result inunauthorized ability to cause a partial denial of service (partial DOS) ofOracle Java SE, Oracle GraalVM Enterprise Edition. Note: This vulnerabilitycan be exploited by using APIs in the specified Component, e.g., through aweb service which supplies data to the APIs. This vulnerability alsoapplies to Java deployments, typically in clients running sandboxed JavaWeb Start applications or sandboxed Java applets, that load and rununtrusted code (e.g., code that comes from the internet) and rely on theJava sandbox for security. CVSS 3.1 Base Score 3.7 (Availability impacts).CVSS Vector: (CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:L).",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-21085",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-21085"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-04-22",
			"cve": {
				"text": "CVE-2024-21085",
				"href": "https://ubuntu.com/security/CVE-2024-21085",
				"public": "20240422"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:201548520000020",
						"comment": "openjdk-8 package in jammy is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2024210020000000",
						"comment": "openjdk-lts package in jammy is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2024210020000010",
						"comment": "openjdk-17 package in jammy is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2022212480000030",
						"comment": "openjdk-18: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'superseded by openjdk-19')."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023219300000030",
						"comment": "openjdk-19: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'no longer supported by upstream')."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2024210020000020",
						"comment": "openjdk-21 package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
