{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2022311690000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-31169 on Ubuntu 22.04 LTS (jammy) - medium",
		"description": "Wasmtime is a standalone runtime for WebAssembly. There is a bug inWasmtime's code generator, Cranelift, for AArch64 targets where constantdivisors can result in incorrect division results at runtime. This affectsWasmtime prior to version 0.38.2 and Cranelift prior to 0.85.2. This issueonly affects the AArch64 platform. Other platforms are not affected. Thetranslation rules for constants did not take into account whether sign orzero-extension should happen which resulted in an incorrect value beingplaced into a register when a division was encountered. The impact of thisbug is that programs executing within the WebAssembly sandbox would notbehave according to the WebAssembly specification. This means that it ishypothetically possible for execution within the sandbox to go awry andWebAssembly programs could produce unexpected results. This should notimpact hosts executing WebAssembly but does affect the correctness of guestprograms. This bug has been patched in Wasmtime version 0.38.2 andcranelift-codegen 0.85.2. There are no known workarounds.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-31169",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-31169"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-07-22 04:15:00 UTC",
			"cve": {
				"text": "CVE-2022-31169",
				"href": "https://ubuntu.com/security/CVE-2022-31169",
				"public": "20220722",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N"
			},
			"assigned_to": "chrisccoulson"
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2022236390000000",
						"comment": "thunderbird: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'bundled deps handled by upstream in new versions')."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2020160440000020",
						"comment": "mozjs78 package in jammy is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202219190000000",
						"comment": "mozjs91 package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
