{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.jammy:def:2021287030000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2021-28703 on Ubuntu 22.04 LTS (jammy) - medium.",
    "Description": "grant table v2 status pages may remain accessible after de-allocation (take two) Guest get permitted access to certain Xen-owned pages of memory. The majority of such pages remain allocated / associated with a guest for its entire lifetime. Grant table v2 status pages, however, get de-allocated when a guest switched (back) from v2 to v1. The freeing of such pages requires that the hypervisor know where in the guest these pages were mapped. The hypervisor tracks only one use within guest space, but racing requests from the guest to insert mappings of these pages may result in any of them to become mapped in multiple locations. Upon switching back from v2 to v1, the guest would then retain access to a page that was freed and perhaps re-used for other purposes. This bug was fortuitously fixed by code cleanup in Xen 4.14, and backported to security-supported Xen branches as a prerequisite of the fix for XSA-378.",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 22.04 LTS"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2021-28703",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-28703"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2021 Canonical Ltd.",
      "PublicDate": "2021-12-07 12:15:00 UTC",
      "Bug": null,
      "cve": {
        "text": "CVE-2021-28703",
        "href": "https://ubuntu.com/security/CVE-2021-28703",
        "public": "20211207",
        "cvss_score": "7.0",
        "cvss_vector": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H"
      },
      "PublicDateAtUsn": "",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": "mdeslaur> hypervisor packages are in universe. For issues in the hypervisor, add appropriate tags to each section, ex: Tags_xen: universe-binary"
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.jammy:tst:202100890000000",
        "comment": "xen package in jammy is affected and may need fixing."
      }
    ]
  }
}
