{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2022392500000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-39250 on Ubuntu 22.04 LTS (jammy) - medium",
		"description": "Matrix JavaScript SDK is the Matrix Client-Server software development kit(SDK) for JavaScript. Prior to version 19.7.0, an attacker cooperating witha malicious homeserver could interfere with the verification flow betweentwo users, injecting its own cross-signing user identity in place of one ofthe users’ identities. This would lead to the other devicetrusting/verifying the user identity under the control of the homeserverinstead of the intended one. The vulnerability is a bug in thematrix-js-sdk, caused by checking and signing user identities and devicesin two separate steps, and inadequately fixing the keys to be signedbetween those steps. Even though the attack is partly made possible due tothe design decision of treating cross-signing user identities as Matrixdevices on the server side (with their device ID set to the public part ofthe user identity key), no other examined implementations were vulnerable.Starting with version 19.7.0, the matrix-js-sdk has been modified to doublecheck that the key signed is the one that was verified instead of justreferencing the key by ID. An additional check has been made to report anerror when one of the device ID matches a cross-signing key. As this attackrequires coordination between a malicious homeserver and an attacker, thosewho trust their homeservers do not need a particular workaround.\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2022-39250` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nthunderbird - 1:102.4.2+build2-0ubuntu0.22.04.1\nthunderbird-gnome-support - 1:102.4.2+build2-0ubuntu0.22.04.1\nthunderbird-mozsymbols - 1:102.4.2+build2-0ubuntu0.22.04.1\nxul-ext-calendar-timezones - 1:102.4.2+build2-0ubuntu0.22.04.1\nxul-ext-gdata-provider - 1:102.4.2+build2-0ubuntu0.22.04.1\nxul-ext-lightning - 1:102.4.2+build2-0ubuntu0.22.04.1\nNo subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-39250",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-39250"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-09-29 13:15:00 UTC",
			"cve": {
				"text": "CVE-2022-39250",
				"href": "https://ubuntu.com/security/CVE-2022-39250",
				"public": "20220929",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
				"usns": "5724-1"
			},
			"public_date_at_usn": "2022-09-29 13:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-5724-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2021408230000000",
						"comment": "node-matrix-js-sdk package in jammy is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202232660000000",
						"comment": "thunderbird package in jammy was vulnerable but has been fixed (note: '1:102.4.2+build2-0ubuntu0.22.04.1')."
					}
				]
			}
		]
	}
}
