{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2021213090000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-21309 on Ubuntu 22.04 LTS (jammy) - medium",
		"description": "Redis is an open-source, in-memory database that persists on disk. Inaffected versions of Redis an integer overflow bug in 32-bit Redis version4.0 or newer could be exploited to corrupt the heap and potentially resultwith remote code execution. Redis 4.0 or newer uses a configurable limitfor the maximum supported bulk input size. By default, it is 512MB which isa safe value for all platforms. If the limit is significantly increased,receiving a large request from a client may trigger several integeroverflow scenarios, which would result with buffer overflow and heapcorruption. We believe this could in certain conditions be exploited forremote code execution. By default, authenticated Redis users have access toall configuration parameters and can therefore use the “CONFIG SETproto-max-bulk-len” to change the safe default, making the systemvulnerable. **This problem only affects 32-bit Redis (on a 32-bit system,or as a 32-bit executable running on a 64-bit system).** The problem isfixed in version 6.2, and the fix is back ported to 6.0.11 and 5.0.11. Makesure you use one of these versions if you are running 32-bit Redis. Anadditional workaround to mitigate the problem without patching theredis-server executable is to prevent clients from directly executing`CONFIG SET`: Using Redis 6.0 or newer, ACL configuration can be used toblock the command. Using older versions, the `rename-command` configurationdirective can be used to rename the command to a random string unknown tousers, rendering it inaccessible. Please note that this workaround may havean additional impact on users or operational systems that expect `CONFIGSET` to behave in certain ways.\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2021-21309` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nredis - 5:6.0.11-1\nredis-sentinel - 5:6.0.11-1\nredis-server - 5:6.0.11-1\nredis-tools - 5:6.0.11-1\nNo subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-21309",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-21309"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-02-26 22:15:00 UTC",
			"bug": [
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=983446"
			],
			"cve": {
				"text": "CVE-2021-21309",
				"href": "https://ubuntu.com/security/CVE-2021-21309",
				"public": "20210226",
				"cvss_score": "8.8",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
				"usns": "5221-1"
			},
			"public_date_at_usn": "2021-02-26 22:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-5221-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2021213090000000",
						"comment": "redis package in jammy, is related to the CVE in some way and has been fixed (note: '5:6.0.11-1')."
					}
				]
			}
		]
	}
}
