{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:202362370000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-6237 on Ubuntu 22.04 LTS (jammy) - low",
		"description": "Issue summary: Checking excessively long invalid RSA public keys may take along time. Impact summary: Applications that use the functionEVP_PKEY_public_check() to check RSA public keys may experience longdelays. Where the key that is being checked has been obtained from anuntrusted source this may lead to a Denial of Service. When functionEVP_PKEY_public_check() is called on RSA public keys, a computation is doneto confirm that the RSA modulus, n, is composite. For valid RSA keys, n isa product of two or more large primes and this computation completesquickly. However, if n is an overly large prime, then this computationwould take a long time. An application that calls EVP_PKEY_public_check()and supplies an RSA key obtained from an untrusted source could bevulnerable to a Denial of Service attack. The functionEVP_PKEY_public_check() is not called from other OpenSSL functions howeverit is called from the OpenSSL pkey command line application. For thatreason that application is also vulnerable if used with the '-pubin' and'-check' options on untrusted data. The OpenSSL SSL/TLS implementation isnot affected by this issue. The OpenSSL 3.0 and 3.1 FIPS providers areaffected by this issue.\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2023-6237` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nlibssl3 - 3.0.2-0ubuntu1.14\nopenssl - 3.0.2-0ubuntu1.14\nNo subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-6237",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-6237"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-01-15",
			"cve": {
				"text": "CVE-2023-6237",
				"href": "https://ubuntu.com/security/CVE-2023-6237",
				"public": "20240115"
			},
			"public_date_at_usn": "2024-01-15",
			"ref": [
				"https://ubuntu.com/security/notices/USN-6622-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202356780000000",
						"comment": "openssl package in jammy was vulnerable but has been fixed (note: '3.0.2-0ubuntu1.14')."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:201915630000010",
						"comment": "nodejs package in jammy is affected and needs fixing."
					}
				]
			}
		]
	}
}
