{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2023224910000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-22491 on Ubuntu 22.04 LTS (jammy) - medium",
		"description": "Gatsby is a free and open source framework based on React that helpsdevelopers build websites and apps. The gatsby-transformer-remark pluginprior to versions 5.25.1 and 6.3.2 passes input through to the`gray-matter` npm package, which is vulnerable to JavaScript injection inits default configuration, unless input is sanitized. The vulnerability ispresent in gatsby-transformer-remark when passing input in data mode(querying MarkdownRemark nodes via GraphQL). Injected JavaScript executesin the context of the build server. To exploit this vulnerabilityuntrusted/unsanitized input would need to be sourced by or added into afile processed by gatsby-transformer-remark. A patch has been introduced in`gatsby-transformer-remark@5.25.1` and `gatsby-transformer-remark@6.3.2`which mitigates the issue by disabling the `gray-matter` JavaScriptFrontmatter engine. As a workaround, if an older version of`gatsby-transformer-remark` must be used, input passed into the pluginshould be sanitized ahead of processing. It is encouraged for projects toupgrade to the latest major release branch for all Gatsby plugins to ensurethe latest security updates and bug fixes are received in a timely manner.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-22491",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22491"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-01-13 19:15:00 UTC",
			"cve": {
				"text": "CVE-2023-22491",
				"href": "https://ubuntu.com/security/CVE-2023-22491",
				"public": "20230113",
				"cvss_score": "5.4",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:L/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023224910000000",
						"comment": "react package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
