{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2022360690000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-36069 on Ubuntu 22.04 LTS for NVIDIA BlueField (jammy) - medium",
		"description": "Poetry is a dependency manager for Python. When handling dependencies thatcome from a Git repository instead of a registry, Poetry uses variouscommands, such as `git clone`. These commands are constructed using userinput (e.g. the repository URL). When building the commands, Poetrycorrectly avoids Command Injection vulnerabilities by passing an array ofarguments instead of a command string. However, there is the possibilitythat a user input starts with a dash (`-`) and is therefore treated as anoptional argument instead of a positional one. This can lead to CodeExecution because some of the commands have options that can be leveragedto run arbitrary executables. If a developer is exploited, the attackercould steal credentials or persist their access. If the exploit happens ona server, the attackers could use their access to attack other internalsystems. Since this vulnerability requires a fair amount of userinteraction, it is not as dangerous as a remotely exploitable one. However,it still puts developers at risk when dealing with untrusted files in a waythey think is safe, because the exploit still works when the victim triesto make sure nothing can happen, e.g. by vetting any Git or Poetry configfiles that might be present in the directory. Versions 1.1.9 and 1.2.0b1contain patches for this issue.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS for NVIDIA BlueField"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-36069",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2022-36069"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-09-07 19:15:00 UTC",
			"cve": {
				"text": "CVE-2022-36069",
				"href": "https://ubuntu.com/security/CVE-2022-36069",
				"public": "20220907",
				"cvss_score": "7.3",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2022261840000000",
						"comment": "poetry package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
