{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2022407350000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-40735 on Ubuntu 22.04 LTS (jammy) - low",
		"description": "The Diffie-Hellman Key Agreement Protocol allows use of long exponents thatarguably make certain calculations unnecessarily expensive, because the1996 van Oorschot and Wiener paper found that \"(appropriately) shortexponents\" can be used when there are adequate subgroup constraints, andthese short exponents can lead to less expensive calculations than for longexponents. This issue is different from CVE-2002-20001 because it is basedon an observation about exponent size, rather than an observation aboutnumbers that are not public keys. The specific situations in whichcalculation expense would constitute a server-side vulnerability depend onthe protocol (e.g., TLS, SSH, or IKE) and the DHE implementation details.In general, there might be an availability concern because of server-sideresource consumption from DHE modular-exponentiation calculations. Finally,it is possible for an attacker to exploit this vulnerability andCVE-2002-20001 together.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-40735",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2022-40735"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-11-14 23:15:00 UTC",
			"cve": {
				"text": "CVE-2022-40735",
				"href": "https://ubuntu.com/security/CVE-2022-40735",
				"public": "20221114",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2022407350000000",
						"comment": "openssl package in jammy is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:201915630000010",
						"comment": "nodejs package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
