{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2023442160000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2023-44216 on Ubuntu 22.04 LTS (jammy) - medium",
		"Description": "PVRIC (PowerVR Image Compression) on Imagination 2018 and later GPU devicesoffers software-transparent compression that enables cross-originpixel-stealing attacks against feTurbulence and feBlend in the SVG Filterspecification, aka a GPU.zip issue. For example, attackers can sometimesaccurately determine text contained on a web page from one origin if theycontrol a resource from a different origin.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-44216",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-44216"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2023 Canonical Ltd.",
			"PublicDate": "2023-09-27 15:19:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2023-44216",
				"href": "https://ubuntu.com/security/CVE-2023-44216",
				"public": "20230927",
				"cvss_score": "5.3",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:N/A:N"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2022218130000000",
						"comment": "nvidia-graphics-drivers-390: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2022218130000010",
						"comment": "nvidia-graphics-drivers-418-server: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202110760000020",
						"comment": "nvidia-graphics-drivers-430: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202110760000030",
						"comment": "nvidia-graphics-drivers-440: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2022218130000020",
						"comment": "nvidia-graphics-drivers-450: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023310180000000",
						"comment": "nvidia-graphics-drivers-450-server package in jammy is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202110760000050",
						"comment": "nvidia-graphics-drivers-455: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2022218130000040",
						"comment": "nvidia-graphics-drivers-460: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023442160000000",
						"comment": "nvidia-graphics-drivers-470 package in jammy is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023442160000010",
						"comment": "nvidia-graphics-drivers-470-server package in jammy is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202301800000020",
						"comment": "nvidia-graphics-drivers-510: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023255160000020",
						"comment": "nvidia-graphics-drivers-515 package in jammy is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023255160000030",
						"comment": "nvidia-graphics-drivers-515-server package in jammy is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:202301800000040",
						"comment": "nvidia-graphics-drivers-520: while related to the CVE in some way, a decision has been made to ignore this issue."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023442160000020",
						"comment": "nvidia-graphics-drivers-525 package in jammy is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023442160000030",
						"comment": "nvidia-graphics-drivers-525-server package in jammy is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023255160000050",
						"comment": "nvidia-graphics-drivers-530 package in jammy is affected, but a decision has been made to defer addressing it."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023442160000040",
						"comment": "nvidia-graphics-drivers-535 package in jammy is affected, but a decision has been made to defer addressing it."
					}
				]
			}
		]
	}
}
