{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2024423580000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-42358 on Ubuntu 22.04 LTS for NVIDIA BlueField (jammy) - medium",
		"description": "PDFio is a simple C library for reading and writing PDF files. There is adenial of service (DOS) vulnerability in the TTF parser. Maliciouslycrafted TTF files can cause the program to utilize 100% of the Memory andenter an infinite loop. This can also lead to a heap-buffer-overflowvulnerability. An infinite loop occurs in the read_camp function by nGroupsvalue. The ttf.h library is vulnerable. A value called nGroups is extractedfrom the file, and by changing that value, you can cause the program toutilize 100% of the Memory and enter an infinite loop. If the value ofnGroups in the file is small, an infinite loop will not occur. Thislibrary, whether used as a standalone binary or as part of anotherapplication, is vulnerable to DOS attacks when parsing certain types offiles. Automated systems, including web servers that use this code toconvert PDF submissions into plaintext, can be DOSed if an attacker uploadsa malicious TTF file. This issue has been addressed in release version1.3.1. All users are advised to upgrade. There are no known workarounds forthis vulnerability.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS for NVIDIA BlueField"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-42358",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-42358"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-08-06 17:15:00 UTC",
			"cve": {
				"text": "CVE-2024-42358",
				"href": "https://ubuntu.com/security/CVE-2024-42358",
				"public": "20240806",
				"cvss_score": "5.5",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023248080000000",
						"comment": "ippsample package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
