{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.bionic:def:2023431150000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2023-43115 on Ubuntu 18.04 FIPS Certified (bionic) - medium.",
    "Description": "In Artifex Ghostscript through 10.01.2, gdevijs.c in GhostPDL can lead to remote code execution via crafted PostScript documents because they can switch to the IJS device, or change the IjsServer parameter, after SAFER has been activated. NOTE: it is a documented risk that the IJS server can be specified on a gs command line (the IJS device inherently must execute a command to start the IJS server).",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 18.04 FIPS Certified"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2023-43115",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-43115"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2023 Canonical Ltd.",
      "PublicDate": "2023-09-18 08:15:00 UTC",
      "Bug": [
        "https://bugs.ghostscript.com/show_bug.cgi?id=707051"
      ],
      "cve": {
        "text": "CVE-2023-43115",
        "href": "https://ubuntu.com/security/CVE-2023-43115",
        "public": "20230918",
        "cvss_score": "9.8",
        "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
        "usns": "6433-1"
      },
      "PublicDateAtUsn": "2023-09-18 08:15:00 UTC",
      "AssignedTo": "mdeslaur",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": "rodrigo-zaiden> the risk of having programs being executed with IJS server is documented in the start of the devices/gdevijs.c source file and in the online documentation: https://ghostscript.readthedocs.io/en/gs10.02.0/Devices.html#ijs-inkjet-and-other-raster-devices \"Note also that if -dSAFER is not specified, it’s possible for PostScript code to set this parameter, so it can cause arbitrary code to be executed.\" the commit that fixes this issue makes it clear that there is no way to properly validate it. what the fix does is to provide a minimal guard based on file opening path validation. it will prevent PostScript programs switching to the IJS device after SAFER has been activated. file opening path validation was added in version 9.28, with commmit 9de16a6637b73e35f79d2d622de403b24e6502f2, so in Ubuntu it is applicable starting from focal, for previous versions, the remediation is not applicable. applying file opening path validation for older versions sounds risky and could possible bring other problems."
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.bionic:tst:201969880000000",
        "comment": "ghostscript: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
      }
    ]
  }
}
