{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2023502980000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-50298 on Ubuntu 18.04 FIPS Certified (bionic) - medium",
		"description": "Exposure of Sensitive Information to an Unauthorized Actor vulnerability inApache Solr.This issue affects Apache Solr: from 6.0.0 through 8.11.2, from9.0.0 before 9.4.1. Solr Streaming Expressions allows users to extract datafrom other Solr Clouds, using a \"zkHost\" parameter. When original SolrCloudis setup to use ZooKeeper credentials and ACLs, they will be sent towhatever \"zkHost\" the user provides. An attacker could setup a server tomock ZooKeeper, that accepts ZooKeeper requests with credentials and ACLsand extracts the sensitive information, then send a streaming expressionusing the mock server's address in \"zkHost\". Streaming Expressions areexposed via the \"/streaming\" handler, with \"read\" permissions. Users arerecommended to upgrade to version 8.11.3 or 9.4.1, which fix the issue.From these versions on, only zkHost values that have the same serveraddress (regardless of chroot), will use the given ZooKeeper credentialsand ACLs when connecting.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-50298",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-50298"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-02-09 18:15:00 UTC",
			"cve": {
				"text": "CVE-2023-50298",
				"href": "https://ubuntu.com/security/CVE-2023-50298",
				"public": "20240209",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201731640000000",
						"comment": "lucene-solr: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
