{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2023235830000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2023-23583 on Ubuntu 18.04 FIPS Certified (bionic) - high.",
		"Description": "Sequence of processor instructions leads to unexpected behavior for some Intel(R) Processors may allow an authenticated user to potentially enable escalation of privilege and/or information disclosure and/or denial of service via local access. Benoit Morgan, Paul Grosen, Thais Moreira Hamasaki, Ke Sun, Alyssa Milburn, Hisham Shafi, Nir Shlomovich, Tavis Ormandy, Daniel Moghimi, Josh Eads, Salman Qazi, Alexandra Sandulescu, Andy Nguyen, Eduardo Vela, Doug Kwan, and Kostik Shtoyk discovered that some Intel(R) Processors did not properly handle certain sequences of processor instructions. A local attacker could possibly use this to cause a core hang (resulting in a denial of service) or gain access to sensitive information or possibly escalate their privileges.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 18.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-23583",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23583"
		},
		"advisory": {
			"Severity": "High",
			"Rights": "Copyright (C) 2023 Canonical Ltd.",
			"PublicDate": "2023-11-14 18:00:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2023-23583",
				"href": "https://ubuntu.com/security/CVE-2023-23583",
				"public": "20231114",
				"cvss_score": "8.8",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "alexmurray",
			"DiscoveredBy": "Benoit Morgan, Paul Grosen, Thais Moreira Hamasaki, Ke Sun,\nAlyssa Milburn, Hisham Shafi, Nir Shlomovich, Tavis Ormandy, Daniel\nMoghimi, Josh Eads, Salman Qazi, Alexandra Sandulescu, Andy Nguyen, Eduardo\nVela, Doug Kwan, and Kostik Shtoyk",
			"Crd": "2023-11-14 18:00:00 UTC",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.bionic:tst:2022409820000000",
				"comment": "intel-microcode: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
			}
		]
	}
}
