{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2022247690000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2022-24769 on Ubuntu 18.04 FIPS Certified (bionic) - medium.",
		"Description": "Moby is an open-source project created by Docker to enable and accelerate software containerization. A bug was found in Moby (Docker Engine) prior to version 20.10.14 where containers were incorrectly started with non-empty inheritable Linux process capabilities, creating an atypical Linux environment and enabling programs with inheritable file capabilities to elevate those capabilities to the permitted set during `execve(2)`. Normally, when executable programs have specified permitted file capabilities, otherwise unprivileged users and processes can execute those programs and gain the specified file capabilities up to the bounding set. Due to this bug, containers which included executable programs with inheritable file capabilities allowed otherwise unprivileged users and processes to additionally gain these inheritable file capabilities up to the container's bounding set. Containers which use Linux users and groups to perform privilege separation inside the container are most directly impacted. This bug did not affect the container security sandbox as the inheritable set never contained more capabilities than were included in the container's bounding set. This bug has been fixed in Moby (Docker Engine) 20.10.14. Running containers should be stopped, deleted, and recreated for the inheritable capabilities to be reset. This fix changes Moby (Docker Engine) behavior such that containers are started with a more typical Linux environment. As a workaround, the entry point of a container can be modified to use a utility like `capsh(1)` to drop inheritable capabilities prior to the primary process starting.\n\nUpdate Instructions:\n\nRun `sudo pro fix CVE-2022-24769` to fix the vulnerability. The problem can be corrected\nby updating your system to the following package versions:\n\ncontainerd - 1.5.9-0ubuntu1~18.04.2\nNo subscription required",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 18.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-24769",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-24769"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2022 Canonical Ltd.",
			"PublicDate": "2022-03-24 20:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2022-24769",
				"href": "https://ubuntu.com/security/CVE-2022-24769",
				"public": "20220324",
				"cvss_score": "5.9",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L",
				"usns": "5776-1"
			},
			"PublicDateAtUsn": "2022-03-24 20:15:00 UTC",
			"AssignedTo": "litios",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.bionic:tst:2022234710000000",
				"comment": "containerd package in bionic was vulnerable but has been fixed (note: '1.5.9-0ubuntu1~18.04.2')."
			}
		]
	}
}
