{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2021476030000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-47603 on Ubuntu 18.04 FIPS Certified (bionic) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: audit:improve robustness of the audit queue handling If the audit daemon wereever to get stuck in a stopped state the kernel's kauditd_thread() couldget blocked attempting to send audit records to the userspace audit daemon.With the kernel thread blocked it is possible that the audit queue couldgrow unbounded as certain audit record generating events must be exemptfrom the queue limits else the system enter a deadlock state. This patchresolves this problem by lowering the kernel thread's socket sendingtimeout from MAX_SCHEDULE_TIMEOUT to HZ/10 and tweaks thekauditd_send_queue() function to better manage the various audit queueswhen connection problems occur between the kernel and the audit daemon.With this patch, the backlog may temporarily grow beyond the defined limitswhen the audit daemon is stopped and the system is under heavy auditpressure, but kauditd_thread() will continue to make progress and drain thequeues as it would for other connection problems. For example, with theaudit daemon put into a stopped state and the system configured to auditevery syscall it was still possible to shutdown the system without a kernelpanic, deadlock, etc.; granted, the system was slow to shutdown but that isto be expected given the extreme pressure of recording every syscall. Thetimeout value of HZ/10 was chosen primarily through experimentation andthis developer's \"gut feeling\". There is likely no one perfect value, butas this scenario is limited in scope (root privileges would be needed tosend SIGSTOP to the audit daemon), it is likely not worth exposing this asa tunable at present. This can always be done at a later date if it provesnecessary.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-47603",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-47603"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-06-19 15:15:00 UTC",
			"cve": {
				"text": "CVE-2021-47603",
				"href": "https://ubuntu.com/security/CVE-2021-47603",
				"public": "20240619"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201585530000010",
						"comment": "linux-fips package in fips/bionic is affected. An update containing the fix has been completed and is pending publication."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000320",
						"comment": "linux-aws-fips package in fips/bionic is affected. An update containing the fix has been completed and is pending publication."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000330",
						"comment": "linux-azure-fips package in fips/bionic is affected. An update containing the fix has been completed and is pending publication."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000340",
						"comment": "linux-gcp-fips package in fips/bionic is affected. An update containing the fix has been completed and is pending publication."
					}
				]
			}
		]
	}
}
