{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2021286950000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-28695 on Ubuntu 18.04 FIPS Certified (bionic) - medium",
		"description": "IOMMU page mapping issues on x86 T[his CNA information record relates tomultiple CVEs; the text explains which aspects/vulnerabilities correspondto which CVE.] Both AMD and Intel allow ACPI tables to specify regions ofmemory which should be left untranslated, which typically means theseaddresses should pass the translation phase unaltered. While these aretypically device specific ACPI properties, they can also be specified toapply to a range of devices, or even all devices. On all systems with suchregions Xen failed to prevent guests from undoing/replacing such mappings(CVE-2021-28694). On AMD systems, where a discontinuous range is specifiedby firmware, the supposedly-excluded middle range will also beidentity-mapped (CVE-2021-28695). Further, on AMD systems, uponde-assigment of a physical device from a guest, the identity mappings wouldbe left in place, allowing a guest continued access to ranges of memorywhich it shouldn't have access to anymore (CVE-2021-28696).",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-28695",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-28695"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-08-27 19:15:00 UTC",
			"cve": {
				"text": "CVE-2021-28695",
				"href": "https://ubuntu.com/security/CVE-2021-28695",
				"public": "20210827",
				"cvss_score": "6.8",
				"cvss_vector": "CVSS:3.1/AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2018109820000000",
						"comment": "xen: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needs-triage')."
					}
				]
			}
		]
	}
}
