{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2024357840000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-35784 on Ubuntu 18.04 FIPS Certified (bionic) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: btrfs:fix deadlock with fiemap and extent locking While working on the patchsetto remove extent locking I got a lockdep splat with fiemap and pagefaultingwith my new extent lock replacement lock. This deadlock exists with ournormal code, we just don't have lockdep annotations with the extent lockingso we've never noticed it. Since we're copying the fiemap extent to userspace on every iteration we have the chance of pagefaulting. Because wehold the extent lock for the entire range we could mkwrite into a range inthe file that we have mmap'ed. This would deadlock with the following stacktrace [<0>] lock_extent+0x28d/0x2f0 [<0>] btrfs_page_mkwrite+0x273/0x8a0[<0>] do_page_mkwrite+0x50/0xb0 [<0>] do_fault+0xc1/0x7b0 [<0>]__handle_mm_fault+0x2fa/0x460 [<0>] handle_mm_fault+0xa4/0x330 [<0>]do_user_addr_fault+0x1f4/0x800 [<0>] exc_page_fault+0x7c/0x1e0 [<0>]asm_exc_page_fault+0x26/0x30 [<0>] rep_movs_alternative+0x33/0x70 [<0>]_copy_to_user+0x49/0x70 [<0>] fiemap_fill_next_extent+0xc8/0x120 [<0>]emit_fiemap_extent+0x4d/0xa0 [<0>] extent_fiemap+0x7f8/0xad0 [<0>]btrfs_fiemap+0x49/0x80 [<0>] __x64_sys_ioctl+0x3e1/0xb50 [<0>]do_syscall_64+0x94/0x1a0 [<0>] entry_SYSCALL_64_after_hwframe+0x6e/0x76 Iwrote an fstest to reproduce this deadlock without my replacement lock andverified that the deadlock exists with our existing locking. To fix thissimply don't take the extent lock for the entire duration of the fiemap.This is safe in general because we keep track of where we are when we'researching the tree, so if an ordered extent updates in the middle of ourfiemap call we'll still emit the correct extents because we know whatoffset we were on before. The only place we maintain the lock is searchingdelalloc. Since the delalloc stuff can change during writeback we want tolock the extent range so we have a consistent view of delalloc at the timewe're checking to see if we need to set the delalloc flag. With this patchapplied we no longer deadlock with my testcase.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-35784",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-35784"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-17 13:15:00 UTC",
			"cve": {
				"text": "CVE-2024-35784",
				"href": "https://ubuntu.com/security/CVE-2024-35784",
				"public": "20240517"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201585530000010",
						"comment": "linux-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000320",
						"comment": "linux-aws-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000330",
						"comment": "linux-azure-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000340",
						"comment": "linux-gcp-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					}
				]
			}
		]
	}
}
