{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2024269820000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26982 on Ubuntu 18.04 FIPS Certified (bionic) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:Squashfs: check the inode number is not the invalid value of zero Syskillerhas produced an out of bounds access in fill_meta_index(). That out ofbounds access is ultimately caused because the inode has an inode numberwith the invalid value of zero, which was not checked. The reason thiscauses the out of bounds access is due to following sequence of events: 1.Fill_meta_index() is called to allocate (via empty_meta_index()) and fill ametadata index. It however suffers a data read error and aborts,invalidating the newly returned empty metadata index. It does this bysetting the inode number of the index to zero, which means unused (zero isnot a valid inode number). 2. When fill_meta_index() is subsequently calledagain on another read operation, locate_meta_index() returns the previousindex because it matches the inode number of 0. Because this index has beenreturned it is expected to have been filled, and because it hasn't been, anout of bounds access is performed. This patch adds a sanity check whichchecks that the inode number is not zero when the inode is created andreturns -EINVAL if it is. [phillip@squashfs.org.uk: whitespace fix] Link:https://lkml.kernel.org/r/20240409204723.446925-1-phillip@squashfs.org.uk",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26982",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-26982"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-01 06:15:00 UTC",
			"cve": {
				"text": "CVE-2024-26982",
				"href": "https://ubuntu.com/security/CVE-2024-26982",
				"public": "20240501"
			},
			"public_date_at_usn": "2024-05-01 06:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-6893-1",
				"https://ubuntu.com/security/notices/USN-6893-2"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201585530000010",
						"comment": "linux-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000320",
						"comment": "linux-aws-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000330",
						"comment": "linux-azure-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000340",
						"comment": "linux-gcp-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					}
				]
			}
		]
	}
}
