{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2023305490000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-30549 on Ubuntu 18.04 FIPS Certified (bionic) - medium",
		"description": "Apptainer is an open source container platform for Linux. There is an ext4use-after-free flaw that is exploitable through versions of Apptainer <1.1.0 and installations that include apptainer-suid < 1.1.8 on olderoperating systems where that CVE has not been patched. That includes RedHat Enterprise Linux 7, Debian 10 buster (unless the linux-5.10 package isinstalled), Ubuntu 18.04 bionic and Ubuntu 20.04 focal. Use-after-freeflaws in the kernel can be used to attack the kernel for denial of serviceand potentially for privilege escalation. Apptainer 1.1.8 includes a patchthat by default disables mounting of extfs filesystem types in setuid-rootmode, while continuing to allow mounting of extfs filesystems in non-setuid\"rootless\" mode using fuse2fs. Some workarounds are possible. Either do notinstall apptainer-suid (for versions 1.1.0 through 1.1.7) or set `allowsetuid = no` in apptainer.conf. This requires having unprivileged usernamespaces enabled and except for apptainer 1.1.x versions will disallowmounting of sif files, extfs files, and squashfs files in addition toother, less significant impacts. (Encrypted sif files are also notsupported unprivileged in apptainer 1.1.x.). Alternatively, use the `limitcontainers` options in apptainer.conf/singularity.conf to limit sif filesto trusted users, groups, and/or paths, and set `allow container extfs =no` to disallow mounting of extfs overlay files. The latter option byitself does not disallow mounting of extfs overlay partitions inside SIFfiles, so that's why the former options are also needed.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-30549",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-30549"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-04-25 21:15:00 UTC",
			"bug": [
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=1035026"
			],
			"cve": {
				"text": "CVE-2023-30549",
				"href": "https://ubuntu.com/security/CVE-2023-30549",
				"public": "20230425",
				"cvss_score": "7.8",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2018120210000000",
						"comment": "singularity-container: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needs-triage')."
					}
				]
			}
		]
	}
}
