{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2020110080000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2020-11008 on Ubuntu 18.04 FIPS Certified (bionic) - medium",
		"description": "Affected versions of Git have a vulnerability whereby Git can be trickedinto sending private credentials to a host controlled by an attacker. Thisbug is similar to CVE-2020-5260(GHSA-qm7j-c969-7j4q). The fix for that bugstill left the door open for an exploit where _some_ credential is leaked(but the attacker cannot control which one). Git uses external \"credentialhelper\" programs to store and retrieve passwords or other credentials fromsecure storage provided by the operating system. Specially-crafted URLsthat are considered illegal as of the recently published Git versions cancause Git to send a \"blank\" pattern to helpers, missing hostname andprotocol fields. Many helpers will interpret this as matching _any_ URL,and will return some unspecified stored password, leaking the password toan attacker's server. The vulnerability can be triggered by feeding amalicious URL to `git clone`. However, the affected URLs look rathersuspicious; the likely vector would be through systems which automaticallyclone URLs not visible to the user, such as Git submodules, or packagesystems built around Git. The root of the problem is in Git itself, whichshould not be feeding blank input to helpers. However, the ability toexploit the vulnerability in practice depends on which helpers are in use.Credential helpers which are known to trigger the vulnerability: - Git's\"store\" helper - Git's \"cache\" helper - the \"osxkeychain\" helper that shipsin Git's \"contrib\" directory Credential helpers which are known to be safeeven with vulnerable versions of Git: - Git Credential Manager for WindowsAny helper not in this list should be assumed to trigger the vulnerability.\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2020-11008` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\ngit - 1:2.17.1-1ubuntu0.7\ngit-all - 1:2.17.1-1ubuntu0.7\ngit-cvs - 1:2.17.1-1ubuntu0.7\ngit-daemon-run - 1:2.17.1-1ubuntu0.7\ngit-daemon-sysvinit - 1:2.17.1-1ubuntu0.7\ngit-el - 1:2.17.1-1ubuntu0.7\ngit-email - 1:2.17.1-1ubuntu0.7\ngit-gui - 1:2.17.1-1ubuntu0.7\ngit-man - 1:2.17.1-1ubuntu0.7\ngit-mediawiki - 1:2.17.1-1ubuntu0.7\ngit-svn - 1:2.17.1-1ubuntu0.7\ngitk - 1:2.17.1-1ubuntu0.7\ngitweb - 1:2.17.1-1ubuntu0.7\nNo subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-11008",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2020-11008"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2020 Canonical Ltd.",
			"public_date": "2020-04-20",
			"cve": {
				"text": "CVE-2020-11008",
				"href": "https://ubuntu.com/security/CVE-2020-11008",
				"public": "20200420",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N",
				"usns": "4334-1"
			},
			"public_date_at_usn": "2020-04-20",
			"assigned_to": "mdeslaur",
			"ref": [
				"https://ubuntu.com/security/notices/USN-4334-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2020110080000000",
						"comment": "git package in bionic was vulnerable but has been fixed (note: '1:2.17.1-1ubuntu0.7')."
					}
				]
			}
		]
	}
}
