{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2023458020000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2023-45802 on Ubuntu 18.04 FIPS Certified (bionic) - medium.",
		"Description": "When a HTTP/2 stream was reset (RST frame) by a client, there was a time window were the request's memory resources were not reclaimed immediately. Instead, de-allocation was deferred to connection close. A client could send new requests and resets, keeping the connection busy and open and causing the memory footprint to keep on growing. On connection close, all resources were reclaimed, but the process might run out of memory before that. This was found by the reporter during testing of CVE-2023-44487 (HTTP/2 Rapid Reset Exploit) with their own test client. During \"normal\" HTTP/2 use, the probability to hit this bug is very low. The kept memory would not become noticeable before the connection closes or times out. Users are recommended to upgrade to version 2.4.58, which fixes the issue.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 18.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-45802",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-45802"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2023 Canonical Ltd.",
			"PublicDate": "2023-10-23 07:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2023-45802",
				"href": "https://ubuntu.com/security/CVE-2023-45802",
				"public": "20231023",
				"cvss_score": "5.9",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "mdeslaur",
			"DiscoveredBy": "Will Dormann and David Warren",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": "mdeslaur> backporting this to jammy and earlier will likely require backporting the whole 2.0.10 version of the http/2 module as it refactors how connections and streams are handled: https://github.com/apache/httpd/commit/9767274b884a110e9244f59f50bd31ff1cae2933"
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.bionic:tst:2019175670000000",
				"comment": "apache2: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
			}
		]
	}
}
