{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2023288410000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-28841 on Ubuntu 18.04 FIPS Certified (bionic) - medium",
		"description": "Moby is an open source container framework developed by Docker Inc. that isdistributed as Docker, Mirantis Container Runtime, and various otherdownstream projects/products. The Moby daemon component (`dockerd`), whichis developed as moby/moby is commonly referred to as *Docker*. Swarm Mode,which is compiled in and delivered by default in `dockerd` and is thuspresent in most major Moby downstreams, is a simple, built-in containerorchestrator that is implemented through a combination of SwarmKit andsupporting network code. The `overlay` network driver is a core feature ofSwarm Mode, providing isolated virtual LANs that allow communicationbetween containers and services across the cluster. This driver is animplementation/user of VXLAN, which encapsulates link-layer (Ethernet)frames in UDP datagrams that tag the frame with the VXLAN metadata,including a VXLAN Network ID (VNI) that identifies the originating overlaynetwork. In addition, the overlay network driver supports an optional,off-by-default encrypted mode, which is especially useful when VXLANpackets traverses an untrusted network between nodes. Encrypted overlaynetworks function by encapsulating the VXLAN datagrams through the use ofthe IPsec Encapsulating Security Payload protocol in Transport mode. Bydeploying IPSec encapsulation, encrypted overlay networks gain theadditional properties of source authentication through cryptographic proof,data integrity through check-summing, and confidentiality throughencryption. When setting an endpoint up on an encrypted overlay network,Moby installs three iptables (Linux kernel firewall) rules that enforceboth incoming and outgoing IPSec. These rules rely on the `u32` iptablesextension provided by the `xt_u32` kernel module to directly filter on aVXLAN packet's VNI field, so that IPSec guarantees can be enforced onencrypted overlay networks without interfering with other overlay networksor other users of VXLAN. An iptables rule designates outgoing VXLANdatagrams with a VNI that corresponds to an encrypted overlay network forIPsec encapsulation. Encrypted overlay networks on affected platformssilently transmit unencrypted data. As a result, `overlay` networks mayappear to be functional, passing traffic as expected, but without any ofthe expected confidentiality or data integrity guarantees. It is possiblefor an attacker sitting in a trusted position on the network to read all ofthe application traffic that is moving across the overlay network,resulting in unexpected secrets or user data disclosure. Thus, because manydatabase protocols, internal APIs, etc. are not protected by a second layerof encryption, a user may use Swarm encrypted overlay networks to provideconfidentiality, which due to this vulnerability this is no longerguaranteed. Patches are available in Moby releases 23.0.3, and 20.10.24. AsMirantis Container Runtime's 20.10 releases are numbered differently, usersof that platform should update to 20.10.16. Some workarounds are available.Close the VXLAN port (by default, UDP port 4789) to outgoing traffic at theInternet boundary in order to prevent unintentionally leaking unencryptedtraffic over the Internet, and/or ensure that the `xt_u32` kernel module isavailable on all nodes of the Swarm cluster.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-28841",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-28841"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-04-04 22:15:00 UTC",
			"cve": {
				"text": "CVE-2023-28841",
				"href": "https://ubuntu.com/security/CVE-2023-28841",
				"public": "20230404",
				"cvss_score": "6.8",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:N/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2023288400000000",
						"comment": "docker: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needs-triage')."
					}
				]
			}
		]
	}
}
