{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2024266200000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26620 on Ubuntu 18.04 FIPS Certified (bionic) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:s390/vfio-ap: always filter entire AP matrix The vfio_ap_mdev_filter_matrixfunction is called whenever a new adapter or domain is assigned to themdev. The purpose of the function is to update the guest's AP configurationby filtering the matrix of adapters and domains assigned to the mdev. Whenan adapter or domain is assigned, only the APQNs associated with the APIDof the new adapter or APQI of the new domain are inspected. If an APQN doesnot reference a queue device bound to the vfio_ap device driver, then it'sAPID will be filtered from the mdev's matrix when updating the guest's APconfiguration. Inspecting only the APID of the new adapter or APQI of thenew domain will result in passing AP queues through to a guest that are notbound to the vfio_ap device driver under certain circumstances. Considerthe following: guest's AP configuration (all also assigned to the mdev'smatrix): 14.0004 14.0005 14.0006 16.0004 16.0005 16.0006 unassign domain 4unbind queue 16.0005 assign domain 4 When domain 4 is re-assigned, sinceonly domain 4 will be inspected, the APQNs that will be examined will be:14.0004 16.0004 Since both of those APQNs reference queue devices that arebound to the vfio_ap device driver, nothing will get filtered from themdev's matrix when updating the guest's AP configuration. Consequently,queue 16.0005 will get passed through despite not being bound to thedriver. This violates the linux device model requirement that a guest shallonly be given access to devices bound to the device driver facilitatingtheir pass-through. To resolve this problem, every adapter and domainassigned to the mdev will be inspected when filtering the mdev's matrix.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26620",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-26620"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-03-11 18:15:00 UTC",
			"cve": {
				"text": "CVE-2024-26620",
				"href": "https://ubuntu.com/security/CVE-2024-26620",
				"public": "20240311"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201585530000010",
						"comment": "linux-fips package in fips/bionic is affected and may need fixing."
					}
				]
			}
		]
	}
}
