{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2024269180000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26918 on Ubuntu 18.04 FIPS Certified (bionic) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:PCI: Fix active state requirement in PME pollingThe commit noted in fixes added a bogus requirement that runtime PM manageddevices need to be in the RPM_ACTIVE state for PME polling.  In fact, onlydevices in low power states should be polled.However there's still a requirement that the device config space must beaccessible, which has implications for both the current state of the polleddevice and the parent bridge, when present.  It's not sufficient to assumethe bridge remains in D0 and cases have been observed where the bridgepasses the D0 test, but the PM state indicates RPM_SUSPENDING and configspace of the polled device becomes inaccessible during pci_pme_wakeup().Therefore, since the bridge is already effectively required to be in theRPM_ACTIVE state, formalize this in the code and elevate the PM usage countto maintain the state while polling the subordinate device.This resolves a regression reported in the bugzilla below where aThunderbolt/USB4 hierarchy fails to scan for an attached NVMe endpointdownstream of a bridge in a D3hot power state.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26918",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-26918"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-04-18",
			"bug": [
				"https://bugzilla.kernel.org/show_bug.cgi?id=218360",
				"https://bugzilla.redhat.com/show_bug.cgi?id=CVE-2024-26918"
			],
			"cve": {
				"text": "CVE-2024-26918",
				"href": "https://ubuntu.com/security/CVE-2024-26918",
				"public": "20240418"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201585530000010",
						"comment": "linux-fips package in fips/bionic is affected and may need fixing."
					}
				]
			}
		]
	}
}
