{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2023405490000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-40549 on Ubuntu 18.04 FIPS Certified (bionic) - medium",
		"description": "[Authenticode: verify that the signature header is in bounds.In the validation logic in verify_buffer_authenticode(), there is yetanother case where we need to guarantee an object is in the binary butwe're only validating the pointer to it.  In this case, we're validatingthat the actual signature data is in the binary, but unfortunately wefailed to validate that the header describing it is, so a malformedbinary can cause us to take an out-of-bounds read (probably but notnecessarily on the same page) past the end of the buffer.This patch adds a bounds check to verify that the signature isactually within the bounds.It seems unlikely this can be used for more than a denial of service,and if you can get shim to try to verify a malformed binary, you'veeffectively already accomplished a DoS.]",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-40549",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40549"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-01-23",
			"cve": {
				"text": "CVE-2023-40549",
				"href": "https://ubuntu.com/security/CVE-2023-40549",
				"public": "20240123"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2023405460000000",
						"comment": "secureboot-db: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2023405460000010",
						"comment": "shim-signed: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:2022287370000000",
						"comment": "shim: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
