{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.bionic:def:2024385830000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-38583 on Ubuntu 18.04 FIPS Certified (bionic) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: nilfs2:fix use-after-free of timer for log writer thread Patch series \"nilfs2: fixlog writer related issues\". This bug fix series covers three nilfs2 logwriter-related issues, including a timer use-after-free issue and potentialdeadlock issue on unmount, and a potential freeze issue in eventsynchronization found during their analysis. Details are described in eachcommit log. This patch (of 3): A use-after-free issue has been reportedregarding the timer sc_timer on the nilfs_sc_info structure. The problem isthat even though it is used to wake up a sleeping log writer thread,sc_timer is not shut down until the nilfs_sc_info structure is about to befreed, and is used regardless of the thread's lifetime. Fix this issue bylimiting the use of sc_timer only while the log writer thread is alive.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-38583",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-38583"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-06-19 14:15:00 UTC",
			"cve": {
				"text": "CVE-2024-38583",
				"href": "https://ubuntu.com/security/CVE-2024-38583",
				"public": "20240619"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201585530000010",
						"comment": "linux-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000320",
						"comment": "linux-aws-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000330",
						"comment": "linux-azure-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:201245420000340",
						"comment": "linux-gcp-fips: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'ESM criteria, was needed')."
					}
				]
			}
		]
	}
}
