{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2024409840000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-40984 on Ubuntu 16.04 FIPS Certified (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:ACPICA: Revert \"ACPICA: avoid Info: mapping multiple BARs. Your kernel isfine.\"Undo the modifications made in commit d410ee5109a1 (\"ACPICA: avoid\"Info: mapping multiple BARs. Your kernel is fine.\"\"). The initialpurpose of this commit was to stop memory mappings for operationregions from overlapping page boundaries, as it can trigger warningsif different page attributes are present.However, it was found that when this situation arises, mappingcontinues until the boundary's end, but there is still an attempt toread/write the entire length of the map, leading to a NULL pointerdeference. For example, if a four-byte mapping request is made butonly one byte is mapped because it hits the current page boundary'send, a four-byte read/write attempt is still made, resulting in a NULLpointer deference.Instead, map the entire length, as the ACPI specification does notmandate that it must be within the same page boundary. It ispermissible for it to be mapped across different regions.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-40984",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-40984"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-07-15",
			"cve": {
				"text": "CVE-2024-40984",
				"href": "https://ubuntu.com/security/CVE-2024-40984",
				"public": "20240715"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201585530000000",
						"comment": "linux-fips package in fips/xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
