{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2024386210000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-38621 on Ubuntu 16.04 FIPS Certified (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: media:stk1160: fix bounds checking in stk1160_copy_video() The subtract in thiscondition is reversed. The ->length is the length of the buffer. The->bytesused is how many bytes we have copied thus far. When the conditionis reversed that means the result of the subtraction is always negative butsince it's unsigned then the result is a very high positive value. Thatmeans the overflow check is never true. Additionally, the ->bytesuseddoesn't actually work for this purpose because we're not writing to\"buf->mem + buf->bytesused\". Instead, the math to calculate the destinationwhere we are writing is a bit involved. You calculate the number of fulllines already written, multiply by two, skip a line if necessary so that westart on an odd numbered line, and add the offset into the line. To fixthis buffer overflow, just take the actual destination where we arewriting, if the offset is already out of bounds print an error and return.Otherwise, write up to buf->length bytes.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-38621",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-38621"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-06-21 11:15:00 UTC",
			"cve": {
				"text": "CVE-2024-38621",
				"href": "https://ubuntu.com/security/CVE-2024-38621",
				"public": "20240621"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201585530000000",
						"comment": "linux-fips package in fips/xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
