{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2024268130000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26813 on Ubuntu 16.04 FIPS Certified (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:vfio/platform: Create persistent IRQ handlersThe vfio-platform SET_IRQS ioctl currently allows loopback triggering ofan interrupt before a signaling eventfd has been configured by the user,which thereby allows a NULL pointer dereference.Rather than register the IRQ relative to a valid trigger, register allIRQs in a disabled state in the device open path.  This allows maskoperations on the IRQ to nest within the overall enable state governedby a valid eventfd signal.  This decouples @masked, protected by the@locked spinlock from @trigger, protected via the @igate mutex.In doing so, it's guaranteed that changes to @trigger cannot race theIRQ handlers because the IRQ handler is synchronously disabled beforemodifying the trigger, and loopback triggering of the IRQ via ioctl issafe due to serialization with trigger changes via igate.For compatibility, request_irq() failures are maintained to be local tothe SET_IRQS ioctl rather than a fatal error in the open device path.This allows, for example, a userspace driver with polling mode supportto continue to work regardless of moving the request_irq() call site.This necessarily blocks all SET_IRQS access to the failed index.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26813",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-26813"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-04-05 09:15:00 UTC",
			"cve": {
				"text": "CVE-2024-26813",
				"href": "https://ubuntu.com/security/CVE-2024-26813",
				"public": "20240405"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201585530000000",
						"comment": "linux-fips package in fips/xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
