{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2022247690000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-24769 on Ubuntu 16.04 FIPS Certified (xenial) - medium",
		"description": "Moby is an open-source project created by Docker to enable and acceleratesoftware containerization. A bug was found in Moby (Docker Engine) prior toversion 20.10.14 where containers were incorrectly started with non-emptyinheritable Linux process capabilities, creating an atypical Linuxenvironment and enabling programs with inheritable file capabilities toelevate those capabilities to the permitted set during `execve(2)`.Normally, when executable programs have specified permitted filecapabilities, otherwise unprivileged users and processes can execute thoseprograms and gain the specified file capabilities up to the bounding set.Due to this bug, containers which included executable programs withinheritable file capabilities allowed otherwise unprivileged users andprocesses to additionally gain these inheritable file capabilities up tothe container's bounding set. Containers which use Linux users and groupsto perform privilege separation inside the container are most directlyimpacted. This bug did not affect the container security sandbox as theinheritable set never contained more capabilities than were included in thecontainer's bounding set. This bug has been fixed in Moby (Docker Engine)20.10.14. Running containers should be stopped, deleted, and recreated forthe inheritable capabilities to be reset. This fix changes Moby (DockerEngine) behavior such that containers are started with a more typical Linuxenvironment. As a workaround, the entry point of a container can bemodified to use a utility like `capsh(1)` to drop inheritable capabilitiesprior to the primary process starting.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-24769",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2022-24769"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-03-24 20:15:00 UTC",
			"cve": {
				"text": "CVE-2022-24769",
				"href": "https://ubuntu.com/security/CVE-2022-24769",
				"public": "20220324",
				"cvss_score": "5.9",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L",
				"usns": "5776-1"
			},
			"public_date_at_usn": "2022-03-24 20:15:00 UTC",
			"assigned_to": "litios",
			"ref": [
				"https://ubuntu.com/security/notices/USN-5776-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2021213340000000",
						"comment": "containerd: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
