{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.xenial:def:2020151570000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2020-15157 on Ubuntu 16.04 FIPS Certified (xenial) - medium.",
    "Description": "In containerd (an industry-standard container runtime) before version 1.2.14 there is a credential leaking vulnerability. If a container image manifest in the OCI Image format or Docker Image V2 Schema 2 format includes a URL for the location of a specific image layer (otherwise known as a “foreign layer”), the default containerd resolver will follow that URL to attempt to download it. In v1.2.x but not 1.3.0 or later, the default containerd resolver will provide its authentication credentials if the server where the URL is located presents an HTTP 401 status code along with registry-specific HTTP headers. If an attacker publishes a public image with a manifest that directs one of the layers to be fetched from a web server they control and they trick a user or system into pulling the image, they can obtain the credentials used for pulling that image. In some cases, this may be the user's username and password for the registry. In other cases, this may be the credentials attached to the cloud virtual instance which can grant access to other cloud resources in the account. The default containerd resolver is used by the cri-containerd plugin (which can be used by Kubernetes), the ctr development tool, and other client programs that have explicitly linked against it. This vulnerability has been fixed in containerd 1.2.14. containerd 1.3 and later are not affected. If you are using containerd 1.3 or later, you are not affected. If you are using cri-containerd in the 1.2 series or prior, you should ensure you only pull images from trusted sources. Other container runtimes built on top of containerd but not using the default resolver (such as Docker) are not affected.\n\nUpdate Instructions:\n\nRun `sudo pro fix CVE-2020-15157` to fix the vulnerability. The problem can be corrected\nby updating your system to the following package versions:\n\ncontainerd - 1.2.6-0ubuntu1~16.04.4\nNo subscription required\n\ndocker.io - 18.09.7-0ubuntu1~16.04.6\nNo subscription required",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 16.04 FIPS Certified"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2020-15157",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-15157"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2020 Canonical Ltd.",
      "PublicDate": "2020-10-15",
      "Bug": null,
      "cve": {
        "text": "CVE-2020-15157",
        "href": "https://ubuntu.com/security/CVE-2020-15157",
        "public": "20201015",
        "cvss_score": "6.1",
        "cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:R/S:C/C:H/I:N/A:N",
        "usns": "4589-1,4589-2"
      },
      "PublicDateAtUsn": "",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "2020-10-15",
      "Ref": null
    }
  },
  "notes": {
    "Note": ""
  },
  "criteria": {
    "criterias": [
      {
        "operator": "OR",
        "criterions": [
          {
            "test_ref": "oval:com.ubuntu.xenial:tst:2020151570000000",
            "comment": "containerd package in xenial was vulnerable but has been fixed (note: '1.2.6-0ubuntu1~16.04.4')."
          },
          {
            "test_ref": "oval:com.ubuntu.xenial:tst:2020151570000010",
            "comment": "docker.io package in xenial was vulnerable but has been fixed (note: '18.09.7-0ubuntu1~16.04.6')."
          }
        ]
      }
    ]
  }
}
