{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2022392490000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2022-39249 on Ubuntu 16.04 FIPS Certified (xenial) - medium",
		"Description": "Matrix Javascript SDK is the Matrix Client-Server SDK for JavaScript. Priorto version 19.7.0, an attacker cooperating with a malicious homeserver canconstruct messages appearing to have come from another person. Suchmessages will be marked with a grey shield on some platforms, but this maybe missing in others. This attack is possible due to the matrix-js-sdkimplementing a too permissive key forwarding strategy on the receiving end.Starting with version 19.7.0, the default policy for accepting key forwardshas been made more strict in the matrix-js-sdk. matrix-js-sdk will now onlyaccept forwarded keys in response to previously issued requests and onlyfrom own, verified devices. The SDK now sets a `trusted` flag on thedecrypted message upon decryption, based on whether the key used to decryptthe message was received from a trusted source. Clients need to ensure thatmessages decrypted with a key with `trusted = false` are decoratedappropriately, for example, by showing a warning for such messages. Thisattack requires coordination between a malicious homeserver and anattacker, and those who trust your homeservers do not need a workaround.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 16.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-39249",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-39249"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2022 Canonical Ltd.",
			"PublicDate": "2022-09-28 20:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2022-39249",
				"href": "https://ubuntu.com/security/CVE-2022-39249",
				"public": "20220928",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
				"usns": "5724-1"
			},
			"PublicDateAtUsn": "2022-09-28 20:15:00 UTC",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": [
				"https://ubuntu.com/security/notices/USN-5724-1"
			]
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201361670000010",
						"comment": "thunderbird: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
