{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2023468410000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-46841 on Ubuntu 16.04 FIPS Certified (xenial) - medium",
		"description": "Recent x86 CPUs offer functionality named Control-flow EnforcementTechnology (CET). A sub-feature of this are Shadow Stacks (CET-SS). CET-SSis a hardware feature designed to protect against Return OrientedProgramming attacks. When enabled, traditional stacks holding both data andreturn addresses are accompanied by so called \"shadow stacks\", holdinglittle more than return addresses. Shadow stacks aren't writable by normalinstructions, and upon function returns their contents are used to checkfor possible manipulation of a return address coming from the traditionalstack. In particular certain memory accesses need intercepting by Xen. Invarious cases the necessary emulation involves kind of replaying of theinstruction. Such replaying typically involves filling and then invoking ofa stub. Such a replayed instruction may raise an exceptions, which isexpected and dealt with accordingly. Unfortunately the interaction of bothof the above wasn't right: Recovery involves removal of a call frame fromthe (traditional) stack. The counterpart of this operation for the shadowstack was missing.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-46841",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-46841"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-03-20 11:15:00 UTC",
			"cve": {
				"text": "CVE-2023-46841",
				"href": "https://ubuntu.com/security/CVE-2023-46841",
				"public": "20240320"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2017155970000000",
						"comment": "xen: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
