{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2020294800000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2020-29480 on Ubuntu 16.04 FIPS Certified (xenial) - medium",
		"description": "An issue was discovered in Xen through 4.14.x. Neither xenstoreimplementation does any permission checks when reporting a xenstore watchevent. A guest administrator can watch the root xenstored node, which willcause notifications for every created, modified, and deleted key. A guestadministrator can also use the special watches, which will cause anotification every time a domain is created and destroyed. Data mayinclude: number, type, and domids of other VMs; existence and domids ofdriver domains; numbers of virtual interfaces, block devices, vcpus;existence of virtual framebuffers and their backend style (e.g., existenceof VNC service); Xen VM UUIDs for other domains; timing information aboutdomain creation and device setup; and some hints at the backendprovisioning of VMs and their devices. The watch events do not containvalues stored in xenstore, only key names. A guest administrator canobserve non-sensitive domain and device lifecycle events relating to otherguests. This information allows some insight into overall systemconfiguration (including the number and general nature of other guests),and configuration of other guests (including the number and general natureof other guests' devices). This information might be commerciallyinteresting or might make other attacks easier. There is not believed to beexposure of sensitive data. Specifically, there is no exposure of VNCpasswords, port numbers, pathnames in host and guest filesystems,cryptographic keys, or within-guest data.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-29480",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2020-29480"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2020 Canonical Ltd.",
			"public_date": "2020-12-15 18:15:00 UTC",
			"cve": {
				"text": "CVE-2020-29480",
				"href": "https://ubuntu.com/security/CVE-2020-29480",
				"public": "20201215",
				"cvss_score": "2.3",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:U/C:L/I:N/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2017155970000000",
						"comment": "xen: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needed')."
					}
				]
			}
		]
	}
}
