{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2022361140000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-36114 on Ubuntu 16.04 FIPS Certified (xenial) - low",
		"description": "Cargo is a package manager for the rust programming language. It wasdiscovered that Cargo did not limit the amount of data extracted fromcompressed archives. An attacker could upload to an alternate registry aspecially crafted package that extracts way more data than its size (alsoknown as a \"zip bomb\"), exhausting the disk space on the machine usingCargo to download the package. Note that by design Cargo allows codeexecution at build time, due to build scripts and procedural macros. Thevulnerabilities in this advisory allow performing a subset of the possibledamage in a harder to track down way. Your dependencies must still betrusted if you want to be protected from attacks, as it's possible toperform the same attacks with build scripts and procedural macros. Thevulnerability is present in all versions of Cargo. Rust 1.64, to bereleased on September 22nd, will include a fix for it. Since thevulnerability is just a more limited way to accomplish what a maliciousbuild scripts or procedural macros can do, we decided not to publish Rustpoint releases backporting the security fix. Patch files are available forRust 1.63.0 are available in the wg-security-response repository for peoplebuilding their own toolchain. We recommend users of alternate registries toexcercise care in which package they download, by only including trusteddependencies in their projects. Please note that even with thesevulnerabilities fixed, by design Cargo allows arbitrary code execution atbuild time thanks to build scripts and procedural macros: a maliciousdependency will be able to cause damage regardless of thesevulnerabilities. crates.io implemented server-side checks to reject thesekinds of packages years ago, and there are no packages on crates.ioexploiting these vulnerabilities. crates.io users still need to excercisecare in choosing their dependencies though, as the same concerns aboutbuild scripts and procedural macros apply here.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-36114",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2022-36114"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-09-14 18:15:00 UTC",
			"cve": {
				"text": "CVE-2022-36114",
				"href": "https://ubuntu.com/security/CVE-2022-36114",
				"public": "20220914",
				"cvss_score": "6.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:202202400000000",
						"comment": "cargo: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
