{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:202141600000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-4160 on Ubuntu 16.04 FIPS Certified (xenial) - low",
		"description": "There is a carry propagation bug in the MIPS32 and MIPS64 squaringprocedure. Many EC algorithms are affected, including some of the TLS 1.3default curves. Impact was not analyzed in detail, because thepre-requisites for attack are considered unlikely and include reusingprivate keys. Analysis suggests that attacks against RSA and DSA as aresult of this defect would be very difficult to perform and are notbelieved likely. Attacks against DH are considered just feasible (althoughvery difficult) because most of the work necessary to deduce informationabout a private key may be performed offline. The amount of resourcesrequired for such an attack would be significant. However, for an attack onTLS to be meaningful, the server would have to share the DH private keyamong multiple clients, which is no longer an option since CVE-2016-0701.This issue affects OpenSSL versions 1.0.2, 1.1.1 and 3.0.0. It wasaddressed in the releases of 1.1.1m and 3.0.1 on the 15th of December 2021.For the 1.0.2 release it is addressed in git commit 6fc1aaaf3 that isavailable to premium support customers only. It will be made available in1.0.2zc when it is released. The issue only affects OpenSSL on MIPSplatforms. Fixed in OpenSSL 3.0.1 (Affected 3.0.0). Fixed in OpenSSL 1.1.1m(Affected 1.1.1-1.1.1l). Fixed in OpenSSL 1.0.2zc-dev (Affected1.0.2-1.0.2zb).",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-4160",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-4160"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-01-28 22:15:00 UTC",
			"cve": {
				"text": "CVE-2021-4160",
				"href": "https://ubuntu.com/security/CVE-2021-4160",
				"public": "20220128",
				"cvss_score": "5.9",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201757310000000",
						"comment": "edk2: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needs-triage')."
					}
				]
			}
		]
	}
}
