{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.xenial:def:2022215490000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2022-21549 on Ubuntu 16.04 FIPS Certified (xenial) - medium.",
    "Description": "Vulnerability in the Oracle Java SE, Oracle GraalVM Enterprise Edition product of Oracle Java SE (component: Libraries). Supported versions that are affected are Oracle Java SE: 17.0.3.1; Oracle GraalVM Enterprise Edition: 21.3.2 and 22.1.0. Easily exploitable vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Oracle Java SE, Oracle GraalVM Enterprise Edition. Successful attacks of this vulnerability can result in unauthorized update, insert or delete access to some of Oracle Java SE, Oracle GraalVM Enterprise Edition accessible data. Note: This vulnerability applies to Java deployments, typically in clients running sandboxed Java Web Start applications or sandboxed Java applets, that load and run untrusted code (e.g., code that comes from the internet) and rely on the Java sandbox for security. This vulnerability can also be exploited by using APIs in the specified Component, e.g., through a web service which supplies data to the APIs. CVSS 3.1 Base Score 5.3 (Integrity impacts). CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N).",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 16.04 FIPS Certified"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2022-21549",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-21549"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2022 Canonical Ltd.",
      "PublicDate": "2022-07-19 22:15:00 UTC",
      "Bug": null,
      "cve": {
        "text": "CVE-2022-21549",
        "href": "https://ubuntu.com/security/CVE-2022-21549",
        "public": "20220719",
        "cvss_score": "5.3",
        "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N",
        "usns": "5546-1"
      },
      "PublicDateAtUsn": "2022-07-19 22:15:00 UTC",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": ""
  },
  "criteria": {
    "criterias": [
      {
        "operator": "OR",
        "criterions": [
          {
            "test_ref": "oval:com.ubuntu.xenial:tst:201552360000000",
            "comment": "icedtea-web: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
          },
          {
            "test_ref": "oval:com.ubuntu.xenial:tst:201973170000030",
            "comment": "openjdk-9: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
          }
        ]
      }
    ]
  }
}
