{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2020255970000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2020-25597 on Ubuntu 16.04 FIPS Certified (xenial) - medium",
		"description": "An issue was discovered in Xen through 4.14.x. There is mishandling of theconstraint that once-valid event channels may not turn invalid. Logic inthe handling of event channel operations in Xen assumes that an eventchannel, once valid, will not become invalid over the life time of a guest.However, operations like the resetting of all event channels may involvedecreasing one of the bounds checked when determining validity. This maylead to bug checks triggering, crashing the host. An unprivileged guest maybe able to crash Xen, leading to a Denial of Service (DoS) for the entiresystem. All Xen versions from 4.4 onwards are vulnerable. Xen versions 4.3and earlier are not vulnerable. Only systems with untrusted guestspermitted to create more than the default number of event channels arevulnerable. This number depends on the architecture and type of guest. For32-bit x86 PV guests, this is 1023; for 64-bit x86 PV guests, and for allARM guests, this number is 4095. Systems where untrusted guests are limitedto fewer than this number are not vulnerable. Note that xl and libxl limitmax_event_channels to 1023 by default, so systems using exclusively xl,libvirt+libxl, or their own toolstack based on libxl, and not explicitlysetting max_event_channels, are not vulnerable.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-25597",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-25597"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2020 Canonical Ltd.",
			"public_date": "2020-09-23 22:15:00 UTC",
			"cve": {
				"text": "CVE-2020-25597",
				"href": "https://ubuntu.com/security/CVE-2020-25597",
				"public": "20200923",
				"cvss_score": "6.5",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:N/I:N/A:H",
				"usns": "5617-1"
			},
			"public_date_at_usn": "2020-09-23 22:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-5617-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2017155970000000",
						"comment": "xen: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needs-triage')."
					}
				]
			}
		]
	}
}
