{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.xenial:def:201671520000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2016-7152 on Ubuntu 16.04 FIPS Certified (xenial) - low.",
    "Description": "The HTTPS protocol does not consider the role of the TCP congestion window in providing information about content length, which makes it easier for remote attackers to obtain cleartext data by leveraging a web-browser configuration in which third-party cookies are sent, aka a \"HEIST\" attack.",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 16.04 FIPS Certified"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2016-7152",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-7152"
    },
    "advisory": {
      "Severity": "Low",
      "Rights": "Copyright (C) 2016 Canonical Ltd.",
      "PublicDate": "2016-09-06 10:59:00 UTC",
      "Bug": null,
      "cve": {
        "text": "CVE-2016-7152",
        "href": "https://ubuntu.com/security/CVE-2016-7152",
        "public": "20160906",
        "cvss_score": "5.3",
        "cvss_vector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N"
      },
      "PublicDateAtUsn": "",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": "seth-arnold> NVD had this CVE assigned to multiple browers as of 2016-09-12. This CVE appears to cover a wide variety of browser side channels demonstrating the time difference between first byte and last byte in a response. This can be used both for compression-based determinations of exact strings from requests that are reflected in responses as well as uncompressed responses from sites that have disabled compression to mitigate BEAST or CRIME. The paper authors recommend users disable third-party cookies in their browsers, with the caveat that many services will break. mdeslaur> We have no actionable item to fix this CVE. Since we release new firefox, thunderbird and chromium upstream releases, I'm marking this as ignored."
  },
  "criteria": {
    "criterias": [
      {
        "operator": "OR",
        "criterions": [
          {
            "test_ref": "oval:com.ubuntu.xenial:tst:2017201620000000",
            "comment": "chromium-browser: while related to the CVE in some way, a decision has been made to ignore this issue."
          },
          {
            "test_ref": "oval:com.ubuntu.xenial:tst:2021299520000000",
            "comment": "firefox: while related to the CVE in some way, a decision has been made to ignore this issue."
          },
          {
            "test_ref": "oval:com.ubuntu.xenial:tst:201266150000020",
            "comment": "oxide-qt: while related to the CVE in some way, a decision has been made to ignore this issue."
          },
          {
            "test_ref": "oval:com.ubuntu.xenial:tst:2020124150000010",
            "comment": "thunderbird: while related to the CVE in some way, a decision has been made to ignore this issue."
          }
        ]
      }
    ]
  }
}
