{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:202134500000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-3450 on Ubuntu 16.04 FIPS Certified (xenial) - high",
		"Description": "The X509_V_FLAG_X509_STRICT flag enables additional security checks of thecertificates present in a certificate chain. It is not set by default.Starting from OpenSSL version 1.1.1h a check to disallow certificates inthe chain that have explicitly encoded elliptic curve parameters was addedas an additional strict check. An error in the implementation of this checkmeant that the result of a previous check to confirm that certificates inthe chain are valid CA certificates was overwritten. This effectivelybypasses the check that non-CA certificates must not be able to issue othercertificates. If a \"purpose\" has been configured then there is a subsequentopportunity for checks that the certificate is a valid CA. All of the named\"purpose\" values implemented in libcrypto perform this check. Therefore,where a purpose is set the certificate chain will still be rejected evenwhen the strict flag has been used. A purpose is set by default in libsslclient and server certificate verification routines, but it can beoverridden or removed by an application. In order to be affected, anapplication must explicitly set the X509_V_FLAG_X509_STRICT verificationflag and either not set a purpose for the certificate verification or, inthe case of TLS client or server applications, override the defaultpurpose. OpenSSL versions 1.1.1h and newer are affected by this issue.Users of these versions should upgrade to OpenSSL 1.1.1k. OpenSSL 1.0.2 isnot impacted by this issue. Fixed in OpenSSL 1.1.1k (Affected1.1.1h-1.1.1j).\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2021-3450` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nlibssl1.0.0 - 1.0.2g-1ubuntu4.19\nopenssl - 1.0.2g-1ubuntu4.19\nNo subscription required",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 16.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-3450",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-3450"
		},
		"advisory": {
			"Severity": "High",
			"Rights": "Copyright (C) 2021 Canonical Ltd.",
			"PublicDate": "2021-03-25",
			"Bug": null,
			"cve": {
				"text": "CVE-2021-3450",
				"href": "https://ubuntu.com/security/CVE-2021-3450",
				"public": "20210325",
				"cvss_score": "7.4",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "mdeslaur",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2021238400000000",
						"comment": "openssl package in xenial, is related to the CVE in some way and has been fixed (note: '1.0.2g-1ubuntu4.19')."
					}
				]
			}
		]
	}
}
