{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.xenial:def:2017106000000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2017-10600 on Ubuntu 16.04 FIPS Certified (xenial) - high.",
    "Description": "ubuntu-image 1.0 before 2017-07-07, when invoked as non-root, creates files in the resulting image with the uid of the invoking user. When the resulting image is booted, a local attacker with the same uid as the image creator has unintended access to cloud-init and snapd directories. ubuntu-image 1.0 when invoked as non-root on systems with e2fsprogs >= 1.43 creates file permissions in the resulting image with the UID of the invoking user. When the resulting image is booted, a local attacker with the same UID as the image creator can alter installed snap packages and signatures to downgrade or potentially replace snap packages.",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 16.04 FIPS Certified"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2017-10600",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-10600"
    },
    "advisory": {
      "Severity": "High",
      "Rights": "Copyright (C) 2017 Canonical Ltd.",
      "PublicDate": "2017-07-11 17:29:00 UTC",
      "Bug": null,
      "cve": {
        "text": "CVE-2017-10600",
        "href": "https://ubuntu.com/security/CVE-2017-10600",
        "public": "20170711",
        "cvss_score": "5.9",
        "cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L"
      },
      "PublicDateAtUsn": "",
      "AssignedTo": "jdstrand",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": "jdstrand> this issue only affects Ubuntu Core and not snapd on Ubuntu classic while snapd is not affected, an updated snapd will attempt to correct permissions on refresh. Because this only affects Ubuntu Core, that update will happen via the snap store and not included as a separate security update for the Ubuntu archive. Ubuntu 16.04 LTS has e2fsprogs 1.42.13"
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.xenial:tst:2017106000000000",
        "comment": "ubuntu-image: while related to the CVE in some way, a decision has been made to ignore this issue."
      }
    ]
  }
}
