{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2024358020000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-35802 on Ubuntu 16.04 FIPS Certified (xenial) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:x86/sev: Fix position dependent variable references in startup codeThe early startup code executes from a 1:1 mapping of memory, whichdiffers from the mapping that the code was linked and/or relocated torun at. The latter mapping is not active yet at this point, and sosymbol references that rely on it will fault.Given that the core kernel is built without -fPIC, symbol references aretypically emitted as absolute, and so any such references occuring inthe early startup code will therefore crash the kernel.While an attempt was made to work around this for the early SEV/SMEstartup code, by forcing RIP-relative addressing for certain globalSEV/SME variables via inline assembly (see snp_cpuid_get_table() forexample), RIP-relative addressing must be pervasively enforced forSEV/SME global variables when accessed prior to page table fixups.__startup_64() already handles this issue for select non-SEV/SME globalvariables using fixup_pointer(), which adjusts the pointer relative to a`physaddr` argument. To avoid having to pass around this `physaddr`argument across all functions needing to apply pointer fixups, introducea macro RIP_RELATIVE_REF() which generates a RIP-relative reference toa given global variable. It is used where necessary to forceRIP-relative accesses to global variables.For backporting purposes, this patch makes no attempt at cleaning upother occurrences of this pattern, involving either inline asm orfixup_pointer(). Those will be addressed later.  [ bp: Call it \"rip_rel_ref\" everywhere like other code shortens    \"rIP-relative reference\" and make the asm wrapper __always_inline. ]",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-35802",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-35802"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-17 14:15:00 UTC",
			"cve": {
				"text": "CVE-2024-35802",
				"href": "https://ubuntu.com/security/CVE-2024-35802",
				"public": "20240517"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:201585530000000",
						"comment": "linux-fips package in fips/xenial is affected and may need fixing."
					}
				]
			}
		]
	}
}
