{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:202019710000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2020-1971 on Ubuntu 16.04 FIPS Certified (xenial) - high",
		"description": "The X.509 GeneralName type is a generic type for representing differenttypes of names. One of those name types is known as EDIPartyName. OpenSSLprovides a function GENERAL_NAME_cmp which compares different instances ofa GENERAL_NAME to see if they are equal or not. This function behavesincorrectly when both GENERAL_NAMEs contain an EDIPARTYNAME. A NULL pointerdereference and a crash may occur leading to a possible denial of serviceattack. OpenSSL itself uses the GENERAL_NAME_cmp function for two purposes:1) Comparing CRL distribution point names between an available CRL and aCRL distribution point embedded in an X509 certificate 2) When verifyingthat a timestamp response token signer matches the timestamp authority name(exposed via the API functions TS_RESP_verify_response andTS_RESP_verify_token) If an attacker can control both items being comparedthen that attacker could trigger a crash. For example if the attacker cantrick a client or server into checking a malicious certificate against amalicious CRL then this may occur. Note that some applicationsautomatically download CRLs based on a URL embedded in a certificate. Thischecking happens prior to the signatures on the certificate and CRL beingverified. OpenSSL's s_server, s_client and verify tools have support forthe \"-crl_download\" option which implements automatic CRL downloading andthis attack has been demonstrated to work against those tools. Note that anunrelated bug means that affected versions of OpenSSL cannot parse orconstruct correct encodings of EDIPARTYNAME. However it is possible toconstruct a malformed EDIPARTYNAME that OpenSSL's parser will accept andhence trigger this attack. All OpenSSL 1.1.1 and 1.0.2 versions areaffected by this issue. Other OpenSSL releases are out of support and havenot been checked. Fixed in OpenSSL 1.1.1i (Affected 1.1.1-1.1.1h). Fixed inOpenSSL 1.0.2x (Affected 1.0.2-1.0.2w).\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2020-1971` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nlibssl1.0.0 - 1.0.2g-1ubuntu4.18\nopenssl - 1.0.2g-1ubuntu4.18\nNo subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-1971",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-1971"
		},
		"advisory": {
			"severity": "High",
			"rights": "Copyright (C) 2020 Canonical Ltd.",
			"public_date": "2020-12-08",
			"cve": {
				"text": "CVE-2020-1971",
				"href": "https://ubuntu.com/security/CVE-2020-1971",
				"public": "20201208",
				"cvss_score": "5.9",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H",
				"usns": "4662-1,4745-1"
			},
			"public_date_at_usn": "2020-12-08",
			"ref": [
				"https://ubuntu.com/security/notices/USN-4662-1",
				"https://ubuntu.com/security/notices/USN-4745-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:202019710000000",
						"comment": "openssl package in xenial was vulnerable but has been fixed (note: '1.0.2g-1ubuntu4.18')."
					}
				]
			}
		]
	}
}
