{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.xenial:def:2020294840000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2020-29484 on Ubuntu 16.04 FIPS Certified (xenial) - medium",
		"description": "An issue was discovered in Xen through 4.14.x. When a Xenstore watch fires,the xenstore client that registered the watch will receive a Xenstoremessage containing the path of the modified Xenstore entry that triggeredthe watch, and the tag that was specified when registering the watch. Anycommunication with xenstored is done via Xenstore messages, consisting of amessage header and the payload. The payload length is limited to 4096bytes. Any request to xenstored resulting in a response with a payloadlonger than 4096 bytes will result in an error. When registering a watch,the payload length limit applies to the combined length of the watched pathand the specified tag. Because watches for a specific path are alsotriggered for all nodes below that path, the payload of a watch eventmessage can be longer than the payload needed to register the watch. Amalicious guest that registers a watch using a very large tag (i.e., with aregistration operation payload length close to the 4096 byte limit) cancause the generation of watch events with a payload length larger than 4096bytes, by writing to Xenstore entries below the watched path. This willresult in an error condition in xenstored. This error can result in a NULLpointer dereference, leading to a crash of xenstored. A malicious guestadministrator can cause xenstored to crash, leading to a denial of service.Following a xenstored crash, domains may continue to run, but managementoperations will be impossible. Only C xenstored is affected, oxenstored isnot affected.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 16.04 FIPS Certified"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-29484",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-29484"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2020 Canonical Ltd.",
			"public_date": "2020-12-15 18:15:00 UTC",
			"cve": {
				"text": "CVE-2020-29484",
				"href": "https://ubuntu.com/security/CVE-2020-29484",
				"public": "20201215",
				"cvss_score": "6.0",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:C/C:N/I:N/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.xenial:tst:2017155970000000",
						"comment": "xen: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support, was needed')."
					}
				]
			}
		]
	}
}
