{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.focal:def:2024458180000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-45818 on Ubuntu Pro FIPS 20.04 LTS (focal) - medium",
		"description": "The hypervisor contains code to accelerate VGA memory accesses for HVMguests, when the (virtual) VGA is in \"standard\" mode.  Locking involvedthere has an unusual discipline, leaving a lock acquired past thereturn from the function that acquired it.  This behavior results in aproblem when emulating an instruction with two memory accesses, both ofwhich touch VGA memory (plus some further constraints which aren'trelevant here).  When emulating the 2nd access, the lock that is alreadybeing held would be attempted to be re-acquired, resulting in adeadlock.This deadlock was already found when the code was first introduced, butwas analysed incorrectly and the fix was incomplete.  Analysis in lightof the new finding cannot find a way to make the existing lockingdiscipline work.In staging, this logic has all been removed because it was discoveredto be accidentally disabled since Xen 4.7.  Therefore, we are fixing thelocking problem by backporting the removal of most of the feature.  Notethat even with the feature disabled, the lock would still be acquiredfor any accesses to the VGA MMIO region.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS 20.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-45818",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-45818"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-12-19 12:15:00 UTC",
			"cve": {
				"text": "CVE-2024-45818",
				"href": "https://ubuntu.com/security/CVE-2024-45818",
				"public": "20241219"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:2020276700000000",
						"comment": "xen package in focal is affected and may need fixing."
					}
				]
			}
		]
	}
}
