{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2022247350000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-24735 on Ubuntu Pro FIPS-preview 22.04 LTS (jammy) - medium",
		"description": "Redis is an in-memory database that persists on disk. By exploitingweaknesses in the Lua script execution environment, an attacker with accessto Redis prior to version 7.0.0 or 6.2.7 can inject Lua code that willexecute with the (potentially higher) privileges of another Redis user. TheLua script execution environment in Redis provides some measures thatprevent a script from creating side effects that persist and can affect theexecution of the same, or different script, at a later time. Severalweaknesses of these measures have been publicly known for a long time, butthey had no security impact as the Redis security model did not endorse theconcept of users or privileges. With the introduction of ACLs in Redis 6.0,these weaknesses can be exploited by a less privileged users to inject Luacode that will execute at a later time, when a privileged user executes aLua script. The problem is fixed in Redis versions 7.0.0 and 6.2.7. Anadditional workaround to mitigate this problem without patching theredis-server executable, if Lua scripting is not being used, is to blockaccess to `SCRIPT LOAD` and `EVAL` commands using ACL rules.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS-preview 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-24735",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2022-24735"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-04-27 20:15:00 UTC",
			"cve": {
				"text": "CVE-2022-24735",
				"href": "https://ubuntu.com/security/CVE-2022-24735",
				"public": "20220427",
				"cvss_score": "7.8",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2021312940000000",
						"comment": "redis package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
