{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2024212170000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-21217 on Ubuntu Pro FIPS-preview 22.04 LTS (jammy) - low",
		"description": "Vulnerability in the Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVMEnterprise Edition product of Oracle Java SE (component: Serialization).Supported versions that are affected are Oracle Java SE: 8u421, 8u421-perf,11.0.24, 17.0.12, 21.0.4, 23; Oracle GraalVM for JDK: 17.0.12, 21.0.4, 23;Oracle GraalVM Enterprise Edition: 20.3.15 and  21.3.11. Difficult toexploit vulnerability allows unauthenticated attacker with network accessvia multiple protocols to compromise Oracle Java SE, Oracle GraalVM forJDK, Oracle GraalVM Enterprise Edition.  Successful attacks of thisvulnerability can result in unauthorized ability to cause a partial denialof service (partial DOS) of Oracle Java SE, Oracle GraalVM for JDK, OracleGraalVM Enterprise Edition. Note: This vulnerability can be exploited byusing APIs in the specified Component, e.g., through a web service whichsupplies data to the APIs. This vulnerability also applies to Javadeployments, typically in clients running sandboxed Java Web Startapplications or sandboxed Java applets, that load and run untrusted code(e.g., code that comes from the internet) and rely on the Java sandbox forsecurity. CVSS 3.1 Base Score 3.7 (Availability impacts).  CVSS Vector:(CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:L).",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS-preview 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-21217",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-21217"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-10-15 20:15:00 UTC",
			"cve": {
				"text": "CVE-2024-21217",
				"href": "https://ubuntu.com/security/CVE-2024-21217",
				"public": "20241015",
				"cvss_score": "3.7",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:L"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:201548520000020",
						"comment": "openjdk-8 package in jammy is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2024212080000000",
						"comment": "openjdk-lts package in jammy is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2024212080000010",
						"comment": "openjdk-17 package in jammy is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2022212480000030",
						"comment": "openjdk-18: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'superseded by openjdk-19')."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023219300000030",
						"comment": "openjdk-19: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'no longer supported by upstream')."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2024212080000020",
						"comment": "openjdk-21 package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
