{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:51651000000",
	"version": "1",
	"metadata": {
		"title": "USN-5165-1 -- Linux kernel (OEM) vulnerabilities",
		"description": "It was discovered that the NFC subsystem in the Linux kernel contained a use-after-free vulnerability in its NFC Controller Interface (NCI) implementation. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2021-3760)  It was discovered that the SCTP protocol implementation in the Linux kernel did not properly verify VTAGs in some situations. A remote attacker could possibly use this to cause a denial of service (connection disassociation). (CVE-2021-3772)  It was discovered that the AMD Radeon GPU driver in the Linux kernel did not properly validate writes in the debugfs file system. A privileged attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-42327)  Luo Likang discovered that the FireDTV Firewire driver in the Linux kernel did not properly perform bounds checking in some situations. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-42739)  It was discovered that the KVM implementation for POWER8 processors in the Linux kernel did not properly keep track if a wakeup event could be resolved by a guest. An attacker in a guest VM could possibly use this to cause a denial of service (host OS crash). (CVE-2021-43056)  It was discovered that the TIPC Protocol implementation in the Linux kernel did not properly validate MSG_CRYPTO messages in some situations. An attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-43267)  It was discovered that the ISDN CAPI implementation in the Linux kernel contained a race condition in certain situations that could trigger an array out-of-bounds bug. A privileged local attacker could possibly use this to cause a denial of service or execute arbitrary code. (CVE-2021-43389)  Update Instructions:  Run `sudo pro fix USN-5165-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-headers-5.14.0-1008-oem - 5.14.0-1008.8 linux-image-unsigned-5.14.0-1008-oem - 5.14.0-1008.8 linux-buildinfo-5.14.0-1008-oem - 5.14.0-1008.8 linux-tools-5.14.0-1008-oem - 5.14.0-1008.8 linux-modules-5.14.0-1008-oem - 5.14.0-1008.8 linux-image-5.14.0-1008-oem - 5.14.0-1008.8 linux-oem-5.14-tools-5.14.0-1008 - 5.14.0-1008.8 linux-oem-5.14-tools-host - 5.14.0-1008.8 linux-oem-5.14-headers-5.14.0-1008 - 5.14.0-1008.8 No subscription required  linux-headers-oem-20.04d - 5.14.0.1008.8 linux-image-oem-20.04d - 5.14.0.1008.8 linux-tools-oem-20.04d - 5.14.0.1008.8 linux-oem-20.04d - 5.14.0.1008.8 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5165-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5165-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2021-11-30"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:516510000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
