{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:44322000000",
	"version": "1",
	"metadata": {
		"title": "USN-4432-2 -- GRUB2 regression",
		"description": "USN-4432-1 fixed vulnerabilities in GRUB2 affecting Secure Boot environments. Unfortunately, the update introduced regressions for some BIOS systems (either pre-UEFI or UEFI configured in Legacy mode), preventing them from successfully booting. This update addresses the issue.  Users with BIOS systems that installed GRUB2 versions from USN-4432-1 should verify that their GRUB2 installation has a correct understanding of their boot device location and installed the boot loader correctly.  We apologize for the inconvenience.  Original advisory details:   Jesse Michael and Mickey Shkatov discovered that the configuration parser  in GRUB2 did not properly exit when errors were discovered, resulting in  heap-based buffer overflows. A local attacker could use this to execute  arbitrary code and bypass UEFI Secure Boot restrictions. (CVE-2020-10713)   Chris Coulson discovered that the GRUB2 function handling code did not  properly handle a function being redefined, leading to a use-after-free  vulnerability. A local attacker could use this to execute arbitrary code  and bypass UEFI Secure Boot restrictions. (CVE-2020-15706)   Chris Coulson discovered that multiple integer overflows existed in GRUB2  when handling certain filesystems or font files, leading to heap-based  buffer overflows. A local attacker could use these to execute arbitrary  code and bypass UEFI Secure Boot restrictions. (CVE-2020-14309,  CVE-2020-14310, CVE-2020-14311)   It was discovered that the memory allocator for GRUB2 did not validate  allocation size, resulting in multiple integer overflows and heap-based  buffer overflows when handling certain filesystems, PNG images or disk  metadata. A local attacker could use this to execute arbitrary code and  bypass UEFI Secure Boot restrictions. (CVE-2020-14308)   Mathieu Trudel-Lapierre discovered that in certain situations, GRUB2  failed to validate kernel signatures. A local attacker could use this  to bypass Secure Boot restrictions. (CVE-2020-15705)   Colin Watson and Chris Coulson discovered that an integer overflow  existed in GRUB2 when handling the initrd command, leading to a heap-based  buffer overflow. A local attacker could use this to execute arbitrary code  and bypass UEFI Secure Boot restrictions. (CVE-2020-15707)  Update Instructions:  Run `sudo pro fix USN-4432-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  grub-efi-amd64-signed - 1.142.4+2.04-1ubuntu26.2 grub-efi-arm64-signed - 1.142.4+2.04-1ubuntu26.2 No subscription required  grub-ieee1275 - 2.04-1ubuntu26.2 grub-efi-amd64 - 2.04-1ubuntu26.2 grub2-common - 2.04-1ubuntu26.2 grub-pc-bin - 2.04-1ubuntu26.2 grub-uboot-bin - 2.04-1ubuntu26.2 grub-common - 2.04-1ubuntu26.2 grub-efi-amd64-bin - 2.04-1ubuntu26.2 grub-firmware-qemu - 2.04-1ubuntu26.2 grub-theme-starfield - 2.04-1ubuntu26.2 grub-efi-arm - 2.04-1ubuntu26.2 grub2 - 2.04-1ubuntu26.2 grub-xen-host - 2.04-1ubuntu26.2 grub-efi-arm64-bin - 2.04-1ubuntu26.2 grub-pc - 2.04-1ubuntu26.2 grub-emu - 2.04-1ubuntu26.2 grub-efi-arm-bin - 2.04-1ubuntu26.2 grub-linuxbios - 2.04-1ubuntu26.2 grub-xen - 2.04-1ubuntu26.2 grub-uboot - 2.04-1ubuntu26.2 grub-efi-ia32 - 2.04-1ubuntu26.2 grub-coreboot - 2.04-1ubuntu26.2 grub-efi-ia32-bin - 2.04-1ubuntu26.2 grub-ieee1275-bin - 2.04-1ubuntu26.2 grub-xen-bin - 2.04-1ubuntu26.2 grub-efi-amd64-signed-template - 2.04-1ubuntu26.2 grub-rescue-pc - 2.04-1ubuntu26.2 grub-mount-udeb - 2.04-1ubuntu26.2 grub-coreboot-bin - 2.04-1ubuntu26.2 grub-efi-arm64-signed-template - 2.04-1ubuntu26.2 grub-efi-arm64 - 2.04-1ubuntu26.2 grub-efi - 2.04-1ubuntu26.2 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4432-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-4432-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-08-04"
			},
			"bug": [
				"https://launchpad.net/bugs/1889556"
			],
			"ref": [
				"https://wiki.ubuntu.com/SecurityTeam/KnowledgeBase/GRUB2SecureBootBypass"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:443220000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:443220000010",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
