{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:66052000000",
	"version": "1",
	"metadata": {
		"title": "USN-6605-2 -- Linux kernel (KVM) vulnerabilities",
		"description": "Lin Ma discovered that the netfilter subsystem in the Linux kernel did not properly validate network family support while creating a new netfilter table. A local attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2023-6040)  It was discovered that the CIFS network file system implementation in the Linux kernel did not properly validate the server frame size in certain situation, leading to an out-of-bounds read vulnerability. An attacker could use this to construct a malicious CIFS image that, when operated on, could cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-6606)  Budimir Markovic, Lucas De Marchi, and Pengfei Xu discovered that the perf subsystem in the Linux kernel did not properly validate all event sizes when attaching new events, leading to an out-of-bounds write vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-6931)  It was discovered that the IGMP protocol implementation in the Linux kernel contained a race condition, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-6932)  Update Instructions:  Run `sudo pro fix USN-6605-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-tools-5.4.0-1105-kvm - 5.4.0-1105.112 linux-kvm-headers-5.4.0-1105 - 5.4.0-1105.112 linux-headers-5.4.0-1105-kvm - 5.4.0-1105.112 linux-image-unsigned-5.4.0-1105-kvm - 5.4.0-1105.112 linux-kvm-tools-5.4.0-1105 - 5.4.0-1105.112 linux-modules-5.4.0-1105-kvm - 5.4.0-1105.112 linux-image-5.4.0-1105-kvm - 5.4.0-1105.112 linux-buildinfo-5.4.0-1105-kvm - 5.4.0-1105.112 No subscription required  linux-tools-kvm - 5.4.0.1105.101 linux-kvm - 5.4.0.1105.101 linux-headers-kvm - 5.4.0.1105.101 linux-image-kvm - 5.4.0.1105.101 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6605-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-6605-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2024-01-29"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:660520000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
