{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:47251000000",
	"version": "1",
	"metadata": {
		"title": "USN-4725-1 -- QEMU vulnerabilities",
		"description": "It was discovered that QEMU incorrectly handled memory in iSCSI emulation. An attacker inside the guest could possibly use this issue to obtain sensitive information. This issue only affected Ubuntu 16.04 LTS, Ubuntu 18.04 LTS, and Ubuntu 20.04 LTS. (CVE-2020-11947)  Alexander Bulekov discovered that QEMU incorrectly handled Intel e1000e emulation. An attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. (CVE-2020-15859)  Alexander Bulekov discovered that QEMU incorrectly handled memory region cache. An attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. This issue only affected Ubuntu 20.04 LTS, and Ubuntu 20.10. (CVE-2020-27821)  Cheol-woo Myung discovered that QEMU incorrectly handled Intel e1000e emulation. An attacker inside the guest could use this issue to cause a denial of service. This issue only affected Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, and Ubuntu 20.10. (CVE-2020-28916)  Wenxiang Qian discovered that QEMU incorrectly handled ATAPI emulation. An attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. (CVE-2020-29443)  It was discovered that QEMU incorrectly handled VirtFS directory sharing. An attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. (CVE-2021-20181)  Update Instructions:  Run `sudo pro fix USN-4725-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  qemu-system-common - 1:4.2-3ubuntu6.12 qemu-system-data - 1:4.2-3ubuntu6.12 qemu-system-misc - 1:4.2-3ubuntu6.12 qemu-block-extra - 1:4.2-3ubuntu6.12 qemu-system-s390x - 1:4.2-3ubuntu6.12 qemu-user - 1:4.2-3ubuntu6.12 qemu-system-gui - 1:4.2-3ubuntu6.12 qemu-guest-agent - 1:4.2-3ubuntu6.12 qemu - 1:4.2-3ubuntu6.12 qemu-system - 1:4.2-3ubuntu6.12 qemu-utils - 1:4.2-3ubuntu6.12 qemu-user-static - 1:4.2-3ubuntu6.12 qemu-kvm - 1:4.2-3ubuntu6.12 qemu-user-binfmt - 1:4.2-3ubuntu6.12 qemu-system-x86 - 1:4.2-3ubuntu6.12 qemu-system-arm - 1:4.2-3ubuntu6.12 qemu-system-sparc - 1:4.2-3ubuntu6.12 qemu-system-x86-microvm - 1:4.2-3ubuntu6.12 qemu-system-ppc - 1:4.2-3ubuntu6.12 qemu-system-mips - 1:4.2-3ubuntu6.12 qemu-system-x86-xen - 1:4.2-3ubuntu6.12 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4725-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4725-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2021-02-08"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:472510000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
