{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:49491000000",
	"version": "1",
	"metadata": {
		"title": "USN-4949-1 -- Linux kernel vulnerabilities",
		"description": "Ryota Shiga discovered that the eBPF implementation in the Linux kernel did not properly verify that a BPF program only reserved as much memory for a ring buffer as was allocated. A local attacker could use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2021-3489)  Manfred Paul discovered that the eBPF implementation in the Linux kernel did not properly track bounds on bitwise operations. A local attacker could use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2021-3490)  Billy Jheng Bing-Jhong discovered that the io_uring implementation of the Linux kernel did not properly enforce the MAX_RW_COUNT limit in some situations. A local attacker could use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2021-3491)  It was discovered that the Nouveau GPU driver in the Linux kernel did not properly handle error conditions in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2020-25639)  Olivier Benjamin, Norbert Manthey, Martin Mazein, and Jan H. Schönherr discovered that the Xen paravirtualization backend in the Linux kernel did not properly propagate errors to frontend drivers in some situations. An attacker in a guest VM could possibly use this to cause a denial of service (host domain crash). (CVE-2021-26930)  Jan Beulich discovered that multiple Xen backends in the Linux kernel did not properly handle certain error conditions under paravirtualization. An attacker in a guest VM could possibly use this to cause a denial of service (host domain crash). (CVE-2021-26931)  It was discovered that the fastrpc driver in the Linux kernel did not prevent user space applications from sending kernel RPC messages. A local attacker could possibly use this to gain elevated privileges. (CVE-2021-28375)  It was discovered that the Freescale Gianfar Ethernet driver for the Linux kernel did not properly handle receive queue overrun when jumbo frames were enabled in some situations. An attacker could use this to cause a denial of service (system crash). (CVE-2021-29264)  It was discovered that the USB/IP driver in the Linux kernel contained race conditions during the update of local and shared status. An attacker could use this to cause a denial of service (system crash). (CVE-2021-29265)  It was discovered that the vDPA backend virtio driver in the Linux kernel contained a use-after-free vulnerability. An attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-29266)  It was discovered that the TIPC protocol implementation in the Linux kernel did not properly validate passed encryption key sizes. A local attacker could use this to cause a denial of service (system crash). (CVE-2021-29646)  It was discovered that a race condition existed in the netfilter subsystem of the Linux kernel when replacing tables. A local attacker could use this to cause a denial of service (system crash). (CVE-2021-29650)  Update Instructions:  Run `sudo pro fix USN-4949-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-5.8.0-53-lowlatency - 5.8.0-53.60~20.04.1 linux-image-5.8.0-53-generic-lpae - 5.8.0-53.60~20.04.1 linux-image-5.8.0-53-generic-64k - 5.8.0-53.60~20.04.1 linux-image-5.8.0-53-generic - 5.8.0-53.60~20.04.1 No subscription required  linux-image-virtual-hwe-20.04-edge - 5.8.0.53.60~20.04.37 linux-image-generic-hwe-20.04-edge - 5.8.0.53.60~20.04.37 linux-image-generic-lpae-hwe-20.04 - 5.8.0.53.60~20.04.37 linux-image-generic-lpae-hwe-20.04-edge - 5.8.0.53.60~20.04.37 linux-image-generic-64k-hwe-20.04 - 5.8.0.53.60~20.04.37 linux-image-generic-64k-hwe-20.04-edge - 5.8.0.53.60~20.04.37 linux-image-virtual-hwe-20.04 - 5.8.0.53.60~20.04.37 linux-image-generic-hwe-20.04 - 5.8.0.53.60~20.04.37 linux-image-lowlatency-hwe-20.04 - 5.8.0.53.60~20.04.37 linux-image-lowlatency-hwe-20.04-edge - 5.8.0.53.60~20.04.37 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4949-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4949-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2021-05-11"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:494910000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
