{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:44281000000",
	"version": "1",
	"metadata": {
		"title": "USN-4428-1 -- Python vulnerabilities",
		"description": "It was discovered that Python documentation had a misleading information. A security issue could be possibly caused by wrong assumptions of this information. This issue only affected Ubuntu 12.04 ESM, Ubuntu 14.04 ESM, Ubuntu 16.04 LTS and Ubuntu 18.04 LTS. (CVE-2019-17514)  It was discovered that Python incorrectly handled certain TAR archives. An attacker could possibly use this issue to cause a denial of service. (CVE-2019-20907)  It was discovered that incorrectly handled certain ZIP files. An attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 12.04 ESM, Ubuntu 14.04 ESM, Ubuntu 16.04 LTS and Ubuntu 18.04 LTS. (CVE-2019-9674)  It was discovered that Python incorrectly handled certain IP values. An attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 14.04 ESM, Ubuntu 16.04 LTS, Ubuntu 18.04 LTS and Ubuntu 20.04 LTS. (CVE-2020-14422)  Update Instructions:  Run `sudo pro fix USN-4428-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  python3.8-minimal - 3.8.2-1ubuntu1.2 python3.8-examples - 3.8.2-1ubuntu1.2 python3.8-dev - 3.8.2-1ubuntu1.2 libpython3.8-minimal - 3.8.2-1ubuntu1.2 libpython3.8-stdlib - 3.8.2-1ubuntu1.2 python3.8-venv - 3.8.2-1ubuntu1.2 libpython3.8 - 3.8.2-1ubuntu1.2 idle-python3.8 - 3.8.2-1ubuntu1.2 libpython3.8-testsuite - 3.8.2-1ubuntu1.2 libpython3.8-dev - 3.8.2-1ubuntu1.2 python3.8 - 3.8.2-1ubuntu1.2 python3.8-doc - 3.8.2-1ubuntu1.2 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4428-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4428-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-07-22"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:442810000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
