{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:44581000000",
	"version": "1",
	"metadata": {
		"title": "USN-4458-1 -- Apache HTTP Server vulnerabilities",
		"description": "Fabrice Perez discovered that the Apache mod_rewrite module incorrectly handled certain redirects. A remote attacker could possibly use this issue to perform redirects to an unexpected URL. (CVE-2020-1927)  Chamal De Silva discovered that the Apache mod_proxy_ftp module incorrectly handled memory when proxying to a malicious FTP server. A remote attacker could possibly use this issue to obtain sensitive information. (CVE-2020-1934)  Felix Wilhelm discovered that the HTTP/2 implementation in Apache did not properly handle certain Cache-Digest headers. A remote attacker could possibly use this issue to cause Apache to crash, resulting in a denial of service. This issue only affected Ubuntu 18.04 LTS and Ubuntu 20.04 LTS. (CVE-2020-9490)  Felix Wilhelm discovered that the Apache mod_proxy_uwsgi module incorrectly handled large headers. A remote attacker could use this issue to obtain sensitive information or possibly execute arbitrary code. This issue only affected Ubuntu 20.04 LTS. (CVE-2020-11984)  Felix Wilhelm discovered that the HTTP/2 implementation in Apache did not properly handle certain logging statements. A remote attacker could possibly use this issue to cause Apache to crash, resulting in a denial of service. This issue only affected Ubuntu 18.04 LTS and Ubuntu 20.04 LTS. (CVE-2020-11993)  Update Instructions:  Run `sudo pro fix USN-4458-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  apache2-data - 2.4.41-4ubuntu3.1 libapache2-mod-md - 2.4.41-4ubuntu3.1 apache2-utils - 2.4.41-4ubuntu3.1 apache2-dev - 2.4.41-4ubuntu3.1 apache2-suexec-pristine - 2.4.41-4ubuntu3.1 apache2-suexec-custom - 2.4.41-4ubuntu3.1 apache2 - 2.4.41-4ubuntu3.1 apache2-doc - 2.4.41-4ubuntu3.1 libapache2-mod-proxy-uwsgi - 2.4.41-4ubuntu3.1 apache2-ssl-dev - 2.4.41-4ubuntu3.1 apache2-bin - 2.4.41-4ubuntu3.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4458-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4458-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-08-13"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:445810000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
