{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:51791000000",
	"version": "1",
	"metadata": {
		"title": "USN-5179-1 -- BusyBox vulnerabilities",
		"description": "It was discovered that BusyBox incorrectly handled certain malformed gzip archives. If a user or automated system were tricked into processing a specially crafted gzip archive, a remote attacker could use this issue to cause BusyBox to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2021-28831)  It was discovered that BusyBox incorrectly handled certain malformed LZMA archives. If a user or automated system were tricked into processing a specially crafted LZMA archive, a remote attacker could use this issue to cause BusyBox to crash, resulting in a denial of service, or possibly leak sensitive information. (CVE-2021-42374)  Vera Mens, Uri Katz, Tal Keren, Sharon Brizinov, and Shachar Menashe discovered that BusyBox incorrectly handled certain awk patterns. If a user or automated system were tricked into processing a specially crafted awk pattern, a remote attacker could use this issue to cause BusyBox to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2021-42378, CVE-2021-42379, CVE-2021-42380, CVE-2021-42381, CVE-2021-42382, CVE-2021-42384, CVE-2021-42385, CVE-2021-42386)  Update Instructions:  Run `sudo pro fix USN-5179-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  busybox - 1:1.30.1-4ubuntu6.4 busybox-initramfs - 1:1.30.1-4ubuntu6.4 udhcpd - 1:1.30.1-4ubuntu6.4 busybox-syslogd - 1:1.30.1-4ubuntu6.4 udhcpc - 1:1.30.1-4ubuntu6.4 busybox-static - 1:1.30.1-4ubuntu6.4 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5179-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5179-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2021-12-07"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:517910000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
