{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:46581000000",
	"version": "1",
	"metadata": {
		"title": "USN-4658-1 -- Linux kernel vulnerabilities",
		"description": "It was discovered that a race condition existed in the binder IPC implementation in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2020-0423)  Daniele Antonioli, Nils Ole Tippenhauer, and Kasper Rasmussen discovered that legacy pairing and secure-connections pairing authentication in the Bluetooth protocol could allow an unauthenticated user to complete authentication without pairing credentials via adjacent access. A physically proximate attacker could use this to impersonate a previously paired Bluetooth device. (CVE-2020-10135)  It was discovered that a race condition existed in the perf subsystem of the Linux kernel, leading to a use-after-free vulnerability. An attacker with access to the perf subsystem could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2020-14351)  It was discovered that the frame buffer implementation in the Linux kernel did not properly handle some edge cases in software scrollback. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2020-14390)  It was discovered that the netfilter connection tracker for netlink in the Linux kernel did not properly perform bounds checking in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2020-25211)  It was discovered that the Rados block device (rbd) driver in the Linux kernel did not properly perform privilege checks for access to rbd devices in some situations. A local attacker could use this to map or unmap rbd block devices. (CVE-2020-25284)  It was discovered that the HDLC PPP implementation in the Linux kernel did not properly validate input in some situations. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2020-25643)  It was discovered that the GENEVE tunnel implementation in the Linux kernel when combined with IPSec did not properly select IP routes in some situations. An attacker could use this to expose sensitive information (unencrypted network traffic). (CVE-2020-25645)  Keyu Man discovered that the ICMP global rate limiter in the Linux kernel could be used to assist in scanning open UDP ports. A remote attacker could use to facilitate attacks on UDP based services that depend on source port randomization. (CVE-2020-25705)  It was discovered that the framebuffer implementation in the Linux kernel did not properly perform range checks in certain situations. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2020-28915)  It was discovered that Power 9 processors could be coerced to expose information from the L1 cache in certain situations. A local attacker could use this to expose sensitive information. (CVE-2020-4788)  Update Instructions:  Run `sudo pro fix USN-4658-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-5.4.0-1023-raspi - 5.4.0-1023.26 No subscription required  linux-image-5.4.0-1028-kvm - 5.4.0-1028.29 No subscription required  linux-image-5.4.0-1030-aws - 5.4.0-1030.31 No subscription required  linux-image-5.4.0-1030-gcp - 5.4.0-1030.32 linux-image-5.4.0-1030-oracle - 5.4.0-1030.32 No subscription required  linux-image-5.4.0-1032-azure - 5.4.0-1032.33 No subscription required  linux-image-5.4.0-56-generic-lpae - 5.4.0-56.62 linux-image-5.4.0-56-generic - 5.4.0-56.62 linux-image-5.4.0-56-lowlatency - 5.4.0-56.62 No subscription required  linux-image-raspi - 5.4.0.1023.58 linux-image-raspi2 - 5.4.0.1023.58 linux-image-raspi-hwe-18.04-edge - 5.4.0.1023.58 linux-image-raspi-hwe-18.04 - 5.4.0.1023.58 linux-image-raspi2-hwe-18.04-edge - 5.4.0.1023.58 linux-image-raspi2-hwe-18.04 - 5.4.0.1023.58 No subscription required  linux-image-kvm - 5.4.0.1028.26 No subscription required  linux-image-oracle - 5.4.0.1030.27 No subscription required  linux-image-aws - 5.4.0.1030.31 No subscription required  linux-image-gke - 5.4.0.1030.38 linux-image-gcp - 5.4.0.1030.38 No subscription required  linux-image-azure - 5.4.0.1032.30 No subscription required  linux-image-virtual-hwe-20.04 - 5.4.0.56.59 linux-image-generic-hwe-20.04 - 5.4.0.56.59 linux-image-oem-osp1 - 5.4.0.56.59 linux-image-generic-hwe-18.04 - 5.4.0.56.59 linux-image-generic-lpae-hwe-20.04 - 5.4.0.56.59 linux-image-generic-lpae-hwe-18.04 - 5.4.0.56.59 linux-image-virtual - 5.4.0.56.59 linux-image-lowlatency-hwe-18.04 - 5.4.0.56.59 linux-image-generic - 5.4.0.56.59 linux-image-virtual-hwe-18.04 - 5.4.0.56.59 linux-image-oem - 5.4.0.56.59 linux-image-generic-hwe-18.04-edge - 5.4.0.56.59 linux-image-generic-lpae-hwe-18.04-edge - 5.4.0.56.59 linux-image-virtual-hwe-18.04-edge - 5.4.0.56.59 linux-image-generic-lpae - 5.4.0.56.59 linux-image-lowlatency-hwe-18.04-edge - 5.4.0.56.59 linux-image-lowlatency - 5.4.0.56.59 linux-image-lowlatency-hwe-20.04 - 5.4.0.56.59 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4658-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4658-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-12-03"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:465810000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:465810000010",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:465810000020",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:465810000030",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:465810000040",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:465810000050",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
