{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:67282000000",
	"version": "1",
	"metadata": {
		"title": "USN-6728-2 -- Squid regression",
		"description": "USN-6728-1 fixed vulnerabilities in Squid. The fix for CVE-2023-5824 caused Squid to crash in certain environments on Ubuntu 20.04 LTS. The problematic fix has been reverted pending further investigation.  We apologize for the inconvenience.  Original advisory details:   Joshua Rogers discovered that Squid incorrectly handled collapsed  forwarding. A remote attacker could possibly use this issue to cause Squid  to crash, resulting in a denial of service. This issue only affected Ubuntu  20.04 LTS and Ubuntu 22.04 LTS. (CVE-2023-49288)    Joshua Rogers discovered that Squid incorrectly handled certain structural  elements. A remote attacker could possibly use this issue to cause Squid to  crash, resulting in a denial of service. (CVE-2023-5824)    Joshua Rogers discovered that Squid incorrectly handled Cache Manager error  responses. A remote trusted client can possibly use this issue to cause  Squid to crash, resulting in a denial of service. (CVE-2024-23638)    Joshua Rogers discovered that Squid incorrectly handled the HTTP Chunked  decoder. A remote attacker could possibly use this issue to cause Squid to  stop responding, resulting in a denial of service. (CVE-2024-25111)    Joshua Rogers discovered that Squid incorrectly handled HTTP header  parsing. A remote trusted client can possibly use this issue to cause  Squid to crash, resulting in a denial of service. (CVE-2024-25617)  Update Instructions:  Run `sudo pro fix USN-6728-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  squid - 4.10-1ubuntu1.11 squid-cgi - 4.10-1ubuntu1.11 squid-common - 4.10-1ubuntu1.11 squid-purge - 4.10-1ubuntu1.11 squidclient - 4.10-1ubuntu1.11 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6728-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-6728-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2024-04-11"
			},
			"bug": [
				"https://launchpad.net/bugs/2060880"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:672820000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
