{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:60671000000",
	"version": "1",
	"metadata": {
		"title": "USN-6067-1 -- OpenStack Neutron vulnerabilities",
		"description": "David Sinquin discovered that OpenStack Neutron incorrectly handled the default Open vSwitch firewall rules. An attacker could possibly use this issue to impersonate the IPv6 addresses of other systems on the network. This issue only affected Ubuntu 18.04 LTS, and Ubuntu 20.04 LTS. (CVE-2021-20267)  Jake Yip and Justin Mammarella discovered that OpenStack Neutron incorrectly handled the linuxbridge driver when ebtables-nft is being used. An attacker could possibly use this issue to impersonate the hardware addresss of other systems on the network. This issue only affected Ubuntu 18.04 LTS, and Ubuntu 20.04 LTS. (CVE-2021-38598)  Pavel Toporkov discovered that OpenStack Neutron incorrectly handled extra_dhcp_opts values. An attacker could possibly use this issue to reconfigure dnsmasq. This issue only affected Ubuntu 18.04 LTS, and Ubuntu 20.04 LTS. (CVE-2021-40085)  Slawek Kaplonski discovered that OpenStack Neutron incorrectly handled the routes middleware. An attacker could possibly use this issue to cause the API worker to consume memory, leading to a denial of service. This issue only affected Ubuntu 18.04 LTS, and Ubuntu 20.04 LTS. (CVE-2021-40797)  It was discovered that OpenStack Neutron incorrectly handled certain queries. A remote authenticated user could possibly use this issue to cause resource consumption, leading to a denial of service. (CVE-2022-3277)  Update Instructions:  Run `sudo pro fix USN-6067-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  neutron-linuxbridge-agent - 2:16.4.2-0ubuntu6.2 neutron-metering-agent - 2:16.4.2-0ubuntu6.2 neutron-dhcp-agent - 2:16.4.2-0ubuntu6.2 neutron-server - 2:16.4.2-0ubuntu6.2 neutron-common - 2:16.4.2-0ubuntu6.2 python3-neutron - 2:16.4.2-0ubuntu6.2 neutron-l3-agent - 2:16.4.2-0ubuntu6.2 neutron-metadata-agent - 2:16.4.2-0ubuntu6.2 neutron-plugin-ml2 - 2:16.4.2-0ubuntu6.2 neutron-sriov-agent - 2:16.4.2-0ubuntu6.2 neutron-openvswitch-agent - 2:16.4.2-0ubuntu6.2 neutron-ovn-metadata-agent - 2:16.4.2-0ubuntu6.2 neutron-macvtap-agent - 2:16.4.2-0ubuntu6.2 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6067-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6067-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-05-10"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:606710000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
