{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:49101000000",
	"version": "1",
	"metadata": {
		"title": "USN-4910-1 -- Linux kernel vulnerabilities",
		"description": "Ryota Shiga discovered that the sockopt BPF hooks in the Linux kernel could allow a user space program to probe for valid kernel addresses. A local attacker could use this to ease exploitation of another kernel vulnerability. (CVE-2021-20239)  It was discovered that the BPF verifier in the Linux kernel did not properly handle signed add32 and sub integer overflows. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-20268)  It was discovered that the priority inheritance futex implementation in the Linux kernel contained a race condition, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-3347)  It was discovered that the network block device (nbd) driver in the Linux kernel contained a use-after-free vulnerability during device setup. A local attacker with access to the nbd device could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-3348)  吴异 discovered that the NFS implementation in the Linux kernel did not properly prevent access outside of an NFS export that is a subdirectory of a file system. An attacker could possibly use this to bypass NFS access restrictions. (CVE-2021-3178)  Update Instructions:  Run `sudo pro fix USN-4910-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-5.8.0-49-lowlatency - 5.8.0-49.55~20.04.1 linux-image-5.8.0-49-generic - 5.8.0-49.55~20.04.1 linux-image-5.8.0-49-generic-lpae - 5.8.0-49.55~20.04.1 linux-image-5.8.0-49-generic-64k - 5.8.0-49.55~20.04.1 No subscription required  linux-image-virtual-hwe-20.04-edge - 5.8.0.49.55~20.04.33 linux-image-virtual-hwe-20.04 - 5.8.0.49.55~20.04.33 linux-image-generic-hwe-20.04-edge - 5.8.0.49.55~20.04.33 linux-image-generic-lpae-hwe-20.04 - 5.8.0.49.55~20.04.33 linux-image-generic-lpae-hwe-20.04-edge - 5.8.0.49.55~20.04.33 linux-image-generic-64k-hwe-20.04 - 5.8.0.49.55~20.04.33 linux-image-lowlatency-hwe-20.04 - 5.8.0.49.55~20.04.33 linux-image-generic-64k-hwe-20.04-edge - 5.8.0.49.55~20.04.33 linux-image-generic-hwe-20.04 - 5.8.0.49.55~20.04.33 linux-image-lowlatency-hwe-20.04-edge - 5.8.0.49.55~20.04.33 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4910-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4910-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2021-04-13"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:491010000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
