{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:46501000000",
	"version": "1",
	"metadata": {
		"title": "USN-4650-1 -- QEMU vulnerabilities",
		"description": "Alexander Bulekov discovered that QEMU incorrectly handled SDHCI device emulation. An attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service, or possibly execute arbitrary code on the host. In the default installation, when QEMU is used with libvirt, attackers would be isolated by the libvirt AppArmor profile.  (CVE-2020-17380)  Sergej Schumilo, Cornelius Aschermann, and Simon Wrner discovered that QEMU incorrectly handled USB device emulation. An attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. (CVE-2020-25084)  Sergej Schumilo, Cornelius Aschermann, and Simon Wrner discovered that QEMU incorrectly handled SDHCI device emulation. An attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. (CVE-2020-25085)  Gaoning Pan, Yongkang Jia, and Yi Ren discovered that QEMU incorrectly handled USB device emulation. An attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. (CVE-2020-25624)  It was discovered that QEMU incorrectly handled USB device emulation. An attacker inside the guest could use this issue to cause QEMU to hang, resulting in a denial of service. (CVE-2020-25625)  Cheolwoo Myung discovered that QEMU incorrectly handled USB device emulation. An attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. (CVE-2020-25723)  Gaoning Pan discovered that QEMU incorrectly handled ATI graphics device emulation. An attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. This issue only affected Ubuntu 20.04 LTS and Ubuntu 20.10. (CVE-2020-27616)  Gaoning Pan discovered that QEMU incorrectly handled networking. An attacker inside the guest could use this issue to cause QEMU to crash, resulting in a denial of service. (CVE-2020-27617)  Update Instructions:  Run `sudo pro fix USN-4650-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  qemu-system-x86-microvm - 1:4.2-3ubuntu6.10 qemu-system-common - 1:4.2-3ubuntu6.10 qemu-system-data - 1:4.2-3ubuntu6.10 qemu-system-s390x - 1:4.2-3ubuntu6.10 qemu-block-extra - 1:4.2-3ubuntu6.10 qemu-system-misc - 1:4.2-3ubuntu6.10 qemu-user - 1:4.2-3ubuntu6.10 qemu-system-sparc - 1:4.2-3ubuntu6.10 qemu-guest-agent - 1:4.2-3ubuntu6.10 qemu-system - 1:4.2-3ubuntu6.10 qemu-utils - 1:4.2-3ubuntu6.10 qemu-user-static - 1:4.2-3ubuntu6.10 qemu-kvm - 1:4.2-3ubuntu6.10 qemu-user-binfmt - 1:4.2-3ubuntu6.10 qemu-system-x86 - 1:4.2-3ubuntu6.10 qemu-system-arm - 1:4.2-3ubuntu6.10 qemu-system-gui - 1:4.2-3ubuntu6.10 qemu - 1:4.2-3ubuntu6.10 qemu-system-ppc - 1:4.2-3ubuntu6.10 qemu-system-mips - 1:4.2-3ubuntu6.10 qemu-system-x86-xen - 1:4.2-3ubuntu6.10 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4650-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4650-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-11-30"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:465010000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
