{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:65672000000",
	"version": "1",
	"metadata": {
		"title": "USN-6567-2 -- QEMU regression",
		"description": "USN-6567-1 fixed vulnerabilities QEMU. The fix for CVE-2023-2861 was too restrictive and introduced a behaviour change leading to a regression in certain environments. This update fixes the problem.  Original advisory details:   Gaoning Pan and Xingwei Li discovered that QEMU incorrectly handled the  USB xHCI controller device. A privileged guest attacker could possibly use  this issue to cause QEMU to crash, leading to a denial of service. This  issue only affected Ubuntu 20.04 LTS and Ubuntu 22.04 LTS. (CVE-2020-14394)    It was discovered that QEMU incorrectly handled the TCG Accelerator. A  local attacker could use this issue to cause QEMU to crash, leading to a  denial of service, or possibly execute arbitrary code and esclate  privileges. This issue only affected Ubuntu 20.04 LTS. (CVE-2020-24165)    It was discovered that QEMU incorrectly handled the Intel HD audio device.  A malicious guest attacker could use this issue to cause QEMU to crash,  leading to a denial of service. This issue only affected Ubuntu 22.04 LTS.  (CVE-2021-3611)    It was discovered that QEMU incorrectly handled the ATI VGA device. A  malicious guest attacker could use this issue to cause QEMU to crash,  leading to a denial of service. This issue only affected Ubuntu 20.04 LTS.  (CVE-2021-3638)    It was discovered that QEMU incorrectly handled the VMWare paravirtual RDMA  device. A malicious guest attacker could use this issue to cause QEMU to  crash, leading to a denial of service. (CVE-2023-1544)    It was discovered that QEMU incorrectly handled the 9p passthrough  filesystem. A malicious guest attacker could possibly use this issue to  open special files and escape the exported 9p tree. This issue only  affected Ubuntu 20.04 LTS, Ubuntu 22.04 LTS, and Ubuntu 23.04.  (CVE-2023-2861)    It was discovered that QEMU incorrectly handled the virtual crypto device.  A malicious guest attacker could use this issue to cause QEMU to crash,  leading to a denial of service, or possibly execute arbitrary code. This  issue only affected Ubuntu 20.04 LTS, Ubuntu 22.04 LTS, and Ubuntu 23.04.  (CVE-2023-3180)    It was discovered that QEMU incorrectly handled the built-in VNC server.  A remote authenticated attacker could possibly use this issue to cause QEMU  to stop responding, resulting in a denial of service. This issue only  affected Ubuntu 22.04 LTS and Ubuntu 23.04. (CVE-2023-3255)    It was discovered that QEMU incorrectly handled net device hot-unplugging.  A malicious guest attacker could use this issue to cause QEMU to crash,  leading to a denial of service. This issue only affected Ubuntu 22.04 LTS  and Ubuntu 23.04. (CVE-2023-3301)    It was discovered that QEMU incorrectly handled the built-in VNC server.  A remote attacker could possibly use this issue to cause QEMU to crash,  resulting in a denial of service. This issue only affected Ubuntu 20.04  LTS, Ubuntu 22.04 LTS, and Ubuntu 23.04. (CVE-2023-3354)    It was discovered that QEMU incorrectly handled NVME devices. A malicious  guest attacker could use this issue to cause QEMU to crash, leading to a  denial of service. This issue only affected Ubuntu 23.10. (CVE-2023-40360)    It was discovered that QEMU incorrectly handled NVME devices. A malicious  guest attacker could use this issue to cause QEMU to crash, leading to a  denial of service, or possibly obtain sensitive information. This issue  only affected Ubuntu 23.10. (CVE-2023-4135)    It was discovered that QEMU incorrectly handled SCSI devices. A malicious  guest attacker could use this issue to cause QEMU to crash, leading to a  denial of service. This issue only affected Ubuntu 23.04 and Ubuntu 23.10.  (CVE-2023-42467)    It was discovered that QEMU incorrectly handled certain disk offsets. A  malicious guest attacker could possibly use this issue to gain control of  the host in certain nested virtualization scenarios. (CVE-2023-5088)  Update Instructions:  Run `sudo pro fix USN-6567-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  qemu-system-x86-microvm - 1:4.2-3ubuntu6.29 qemu-system-common - 1:4.2-3ubuntu6.29 qemu-system-data - 1:4.2-3ubuntu6.29 qemu-system-misc - 1:4.2-3ubuntu6.29 qemu-utils - 1:4.2-3ubuntu6.29 qemu-block-extra - 1:4.2-3ubuntu6.29 qemu-system-s390x - 1:4.2-3ubuntu6.29 qemu-kvm - 1:4.2-3ubuntu6.29 qemu-user - 1:4.2-3ubuntu6.29 qemu-guest-agent - 1:4.2-3ubuntu6.29 qemu-system - 1:4.2-3ubuntu6.29 qemu-system-x86-xen - 1:4.2-3ubuntu6.29 qemu-user-static - 1:4.2-3ubuntu6.29 qemu - 1:4.2-3ubuntu6.29 qemu-user-binfmt - 1:4.2-3ubuntu6.29 qemu-system-x86 - 1:4.2-3ubuntu6.29 qemu-system-sparc - 1:4.2-3ubuntu6.29 qemu-system-gui - 1:4.2-3ubuntu6.29 qemu-system-arm - 1:4.2-3ubuntu6.29 qemu-system-ppc - 1:4.2-3ubuntu6.29 qemu-system-mips - 1:4.2-3ubuntu6.29 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6567-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-6567-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2024-06-06"
			},
			"bug": [
				"https://launchpad.net/bugs/2065579"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:656720000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
