{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:63251000000",
	"version": "1",
	"metadata": {
		"title": "USN-6325-1 -- Linux kernel vulnerabilities",
		"description": "Daniel Moghimi discovered that some Intel(R) Processors did not properly clear microarchitectural state after speculative execution of various instructions. A local unprivileged user could use this to obtain to sensitive information. (CVE-2022-40982)  Tavis Ormandy discovered that some AMD processors did not properly handle speculative execution of certain vector register instructions. A local attacker could use this to expose sensitive information. (CVE-2023-20593)  Ye Zhang and Nicolas Wu discovered that the io_uring subsystem in the Linux kernel did not properly handle locking for rings with IOPOLL, leading to a double-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-21400)  It was discovered that the universal 32bit network packet classifier implementation in the Linux kernel did not properly perform reference counting in some situations, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3609)  It was discovered that the netfilter subsystem in the Linux kernel did not properly handle certain error conditions, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3610)  It was discovered that the Quick Fair Queueing network scheduler implementation in the Linux kernel contained an out-of-bounds write vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3611)  It was discovered that the network packet classifier with netfilter/firewall marks implementation in the Linux kernel did not properly handle reference counting, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3776)  Kevin Rich discovered that the netfilter subsystem in the Linux kernel did not properly handle table rules flush in certain circumstances. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2023-3777)  Kevin Rich discovered that the netfilter subsystem in the Linux kernel did not properly handle rule additions to bound chains in certain circumstances. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2023-3995)  It was discovered that the netfilter subsystem in the Linux kernel did not properly handle PIPAPO element removal, leading to a use-after-free vulnerability. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2023-4004)  Kevin Rich discovered that the netfilter subsystem in the Linux kernel did not properly handle bound chain deactivation in certain circumstances. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2023-4015)  Update Instructions:  Run `sudo pro fix USN-6325-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-gkeop-5.15-headers-5.15.0-1026 - 5.15.0-1026.31~20.04.1 linux-image-unsigned-5.15.0-1026-gkeop - 5.15.0-1026.31~20.04.1 linux-tools-5.15.0-1026-gkeop - 5.15.0-1026.31~20.04.1 linux-cloud-tools-5.15.0-1026-gkeop - 5.15.0-1026.31~20.04.1 linux-gkeop-5.15-cloud-tools-5.15.0-1026 - 5.15.0-1026.31~20.04.1 linux-modules-5.15.0-1026-gkeop - 5.15.0-1026.31~20.04.1 linux-buildinfo-5.15.0-1026-gkeop - 5.15.0-1026.31~20.04.1 linux-headers-5.15.0-1026-gkeop - 5.15.0-1026.31~20.04.1 linux-modules-extra-5.15.0-1026-gkeop - 5.15.0-1026.31~20.04.1 linux-gkeop-5.15-tools-5.15.0-1026 - 5.15.0-1026.31~20.04.1 linux-image-5.15.0-1026-gkeop - 5.15.0-1026.31~20.04.1 No subscription required  linux-image-gkeop-edge - 5.15.0.1026.31~20.04.22 linux-image-gkeop-5.15 - 5.15.0.1026.31~20.04.22 linux-cloud-tools-gkeop-edge - 5.15.0.1026.31~20.04.22 linux-headers-gkeop-edge - 5.15.0.1026.31~20.04.22 linux-headers-gkeop-5.15 - 5.15.0.1026.31~20.04.22 linux-tools-gkeop-edge - 5.15.0.1026.31~20.04.22 linux-cloud-tools-gkeop-5.15 - 5.15.0.1026.31~20.04.22 linux-gkeop-5.15 - 5.15.0.1026.31~20.04.22 linux-modules-extra-gkeop-edge - 5.15.0.1026.31~20.04.22 linux-gkeop-edge - 5.15.0.1026.31~20.04.22 linux-tools-gkeop-5.15 - 5.15.0.1026.31~20.04.22 linux-modules-extra-gkeop-5.15 - 5.15.0.1026.31~20.04.22 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6325-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6325-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-08-31"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:632510000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
