{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:49921000000",
	"version": "1",
	"metadata": {
		"title": "USN-4992-1 -- GRUB 2 vulnerabilities",
		"description": "Máté Kukri discovered that the acpi command in GRUB 2 allowed privileged users to load crafted ACPI tables when secure boot is enabled. An attacker could use this to bypass UEFI Secure Boot restrictions. (CVE-2020-14372)  Chris Coulson discovered that the rmmod command in GRUB 2 contained a use- after-free vulnerability. A local attacker could use this to execute arbitrary code and bypass UEFI Secure Boot restrictions. (CVE-2020-25632)  Chris Coulson discovered that a buffer overflow existed in the command line parser in GRUB 2. A local attacker could use this to execute arbitrary code and bypass UEFI Secure Boot restrictions. (CVE-2020-27749)  It was discovered that the cutmem command in GRUB 2 did not honor secure boot locking. A local attacker could use this to execute arbitrary code and bypass UEFI Secure Boot restrictions. (CVE-2020-27779)  It was discovered that the option parser in GRUB 2 contained a heap overflow vulnerability. A local attacker could use this to execute arbitrary code and bypass UEFI Secure Boot restrictions. (CVE-2021-20225)  It was discovered that the menu rendering implementation in GRUB 2 did not properly calculate the amount of memory needed in some situations, leading to out-of-bounds writes. A local attacker could use this to execute arbitrary code and bypass UEFI Secure Boot restrictions. (CVE-2021-20233)  Update Instructions:  Run `sudo pro fix USN-4992-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  grub-efi-arm64-signed - 1.167.2+2.04-1ubuntu44.2 grub-efi-amd64-signed - 1.167.2+2.04-1ubuntu44.2 No subscription required  grub-efi-arm64-bin - 2.04-1ubuntu44.2 grub-efi-amd64 - 2.04-1ubuntu44.2 grub-efi-amd64-bin - 2.04-1ubuntu44.2 grub-efi-arm64 - 2.04-1ubuntu44.2 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4992-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4992-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2021-06-18"
			},
			"ref": [
				"https://wiki.ubuntu.com/SecurityTeam/KnowledgeBase/GRUB2SecureBootBypass2021"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:499210000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.focal:tst:499210000010",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
