{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:53331000000",
	"version": "1",
	"metadata": {
		"title": "USN-5333-1 -- Apache HTTP Server vulnerabilities",
		"description": "Chamal De Silva discovered that the Apache HTTP Server mod_lua module incorrectly handled certain crafted request bodies. A remote attacker could possibly use this issue to cause the server to crash, resulting in a denial of service. (CVE-2022-22719)  James Kettle discovered that the Apache HTTP Server incorrectly closed inbound connection when certain errors are encountered. A remote attacker could possibly use this issue to perform an HTTP Request Smuggling attack. (CVE-2022-22720)  It was discovered that the Apache HTTP Server incorrectly handled large LimitXMLRequestBody settings on certain platforms. In certain configurations, a remote attacker could use this issue to cause the server to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2022-22721)  Ronald Crane discovered that the Apache HTTP Server mod_sed module incorrectly handled memory. A remote attacker could use this issue to cause the server to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2022-23943)  Update Instructions:  Run `sudo pro fix USN-5333-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  apache2-data - 2.4.41-4ubuntu3.10 libapache2-mod-md - 2.4.41-4ubuntu3.10 apache2-utils - 2.4.41-4ubuntu3.10 apache2-dev - 2.4.41-4ubuntu3.10 apache2-suexec-pristine - 2.4.41-4ubuntu3.10 apache2-suexec-custom - 2.4.41-4ubuntu3.10 apache2 - 2.4.41-4ubuntu3.10 apache2-doc - 2.4.41-4ubuntu3.10 libapache2-mod-proxy-uwsgi - 2.4.41-4ubuntu3.10 apache2-ssl-dev - 2.4.41-4ubuntu3.10 apache2-bin - 2.4.41-4ubuntu3.10 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5333-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5333-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-03-17"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:533310000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
