{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:61091000000",
	"version": "1",
	"metadata": {
		"title": "USN-6109-1 -- Linux kernel (Raspberry Pi) vulnerabilities",
		"description": "Zheng Wang discovered that the Intel i915 graphics driver in the Linux kernel did not properly handle certain error conditions, leading to a double-free. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-3707)  Jordy Zomer and Alexandra Sandulescu discovered that the Linux kernel did not properly implement speculative execution barriers in usercopy functions in certain situations. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2023-0459)  It was discovered that the TLS subsystem in the Linux kernel contained a type confusion vulnerability in some situations. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-1075)  It was discovered that the Reliable Datagram Sockets (RDS) protocol implementation in the Linux kernel contained a type confusion vulnerability in some situations. An attacker could use this to cause a denial of service (system crash). (CVE-2023-1078)  Xingyuan Mo discovered that the x86 KVM implementation in the Linux kernel did not properly initialize some data structures. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2023-1513)  It was discovered that a use-after-free vulnerability existed in the iSCSI TCP implementation in the Linux kernel. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2023-2162)  It was discovered that the NET/ROM protocol implementation in the Linux kernel contained a race condition in some situations, leading to a use- after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-32269)  Duoming Zhou discovered that a race condition existed in the infrared receiver/transceiver driver in the Linux kernel, leading to a use-after- free vulnerability. A privileged attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-1118)  Update Instructions:  Run `sudo pro fix USN-6109-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-raspi-tools-5.4.0-1085 - 5.4.0-1085.96 linux-raspi-headers-5.4.0-1085 - 5.4.0-1085.96 linux-modules-5.4.0-1085-raspi - 5.4.0-1085.96 linux-headers-5.4.0-1085-raspi - 5.4.0-1085.96 linux-buildinfo-5.4.0-1085-raspi - 5.4.0-1085.96 linux-image-5.4.0-1085-raspi - 5.4.0-1085.96 linux-tools-5.4.0-1085-raspi - 5.4.0-1085.96 No subscription required  linux-raspi2-hwe-18.04-edge - 5.4.0.1085.115 linux-headers-raspi2-hwe-18.04-edge - 5.4.0.1085.115 linux-raspi-hwe-18.04-edge - 5.4.0.1085.115 linux-raspi - 5.4.0.1085.115 linux-tools-raspi2-hwe-18.04-edge - 5.4.0.1085.115 linux-raspi-hwe-18.04 - 5.4.0.1085.115 linux-tools-raspi - 5.4.0.1085.115 linux-image-raspi - 5.4.0.1085.115 linux-tools-raspi2-hwe-18.04 - 5.4.0.1085.115 linux-raspi2-hwe-18.04 - 5.4.0.1085.115 linux-raspi2 - 5.4.0.1085.115 linux-headers-raspi2 - 5.4.0.1085.115 linux-headers-raspi2-hwe-18.04 - 5.4.0.1085.115 linux-image-raspi2 - 5.4.0.1085.115 linux-image-raspi-hwe-18.04-edge - 5.4.0.1085.115 linux-tools-raspi-hwe-18.04 - 5.4.0.1085.115 linux-tools-raspi-hwe-18.04-edge - 5.4.0.1085.115 linux-tools-raspi2 - 5.4.0.1085.115 linux-image-raspi2-hwe-18.04-edge - 5.4.0.1085.115 linux-headers-raspi-hwe-18.04-edge - 5.4.0.1085.115 linux-headers-raspi - 5.4.0.1085.115 linux-headers-raspi-hwe-18.04 - 5.4.0.1085.115 linux-image-raspi-hwe-18.04 - 5.4.0.1085.115 linux-image-raspi2-hwe-18.04 - 5.4.0.1085.115 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6109-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6109-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-05-25"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:610910000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
