{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:65871000000",
	"version": "1",
	"metadata": {
		"title": "USN-6587-1 -- X.Org X Server vulnerabilities",
		"description": "Jan-Niklas Sohn discovered that the X.Org X Server incorrectly handled memory when processing the DeviceFocusEvent and ProcXIQueryPointer APIs. An attacker could possibly use this issue to cause the X Server to crash, obtain sensitive information, or execute arbitrary code. (CVE-2023-6816)  Jan-Niklas Sohn discovered that the X.Org X Server incorrectly handled reattaching to a different master device. An attacker could use this issue to cause the X Server to crash, leading to a denial of service, or possibly execute arbitrary code. (CVE-2024-0229)  Olivier Fourdan and Donn Seeley discovered that the X.Org X Server incorrectly labeled GLX PBuffers when used with SELinux. An attacker could use this issue to cause the X Server to crash, leading to a denial of service. (CVE-2024-0408)  Olivier Fourdan discovered that the X.Org X Server incorrectly handled the curser code when used with SELinux. An attacker could use this issue to cause the X Server to crash, leading to a denial of service. (CVE-2024-0409)  Jan-Niklas Sohn discovered that the X.Org X Server incorrectly handled memory when processing the XISendDeviceHierarchyEvent API. An attacker could possibly use this issue to cause the X Server to crash, or execute arbitrary code. (CVE-2024-21885)  Jan-Niklas Sohn discovered that the X.Org X Server incorrectly handled devices being disabled. An attacker could possibly use this issue to cause the X Server to crash, or execute arbitrary code. (CVE-2024-21886)  Update Instructions:  Run `sudo pro fix USN-6587-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  xserver-xorg-core - 2:1.20.13-1ubuntu1~20.04.14 xwayland - 2:1.20.13-1ubuntu1~20.04.14 xorg-server-source - 2:1.20.13-1ubuntu1~20.04.14 xdmx - 2:1.20.13-1ubuntu1~20.04.14 xserver-xorg-dev - 2:1.20.13-1ubuntu1~20.04.14 xvfb - 2:1.20.13-1ubuntu1~20.04.14 xnest - 2:1.20.13-1ubuntu1~20.04.14 xserver-xorg-legacy - 2:1.20.13-1ubuntu1~20.04.14 xserver-common - 2:1.20.13-1ubuntu1~20.04.14 xserver-xephyr - 2:1.20.13-1ubuntu1~20.04.14 xdmx-tools - 2:1.20.13-1ubuntu1~20.04.14 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6587-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6587-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2024-01-16"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:658710000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
