{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:66721000000",
	"version": "1",
	"metadata": {
		"title": "USN-6672-1 -- Node.js vulnerabilities",
		"description": "Morgan Jones discovered that Node.js incorrectly handled certain inputs that leads to false positive errors during some cryptographic operations. If a user or an automated system were tricked into opening a specially crafted input file, a remote attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 23.10. (CVE-2023-23919)  It was discovered that Node.js incorrectly handled certain inputs leaded to a untrusted search path vulnerability. If a user or an automated system were tricked into opening a specially crafted input file, a remote attacker could possibly use this issue to perform a privilege escalation. (CVE-2023-23920)  Matt Caswell discovered that Node.js incorrectly handled certain inputs with specially crafted ASN.1 object identifiers or data containing them. If a user or an automated system were tricked into opening a specially crafted input file, a remote attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 22.04 LTS. (CVE-2023-2650)  Update Instructions:  Run `sudo pro fix USN-6672-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libnode-dev - 10.19.0~dfsg-3ubuntu1.5 nodejs-doc - 10.19.0~dfsg-3ubuntu1.5 libnode64 - 10.19.0~dfsg-3ubuntu1.5 nodejs - 10.19.0~dfsg-3ubuntu1.5 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6672-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6672-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2024-03-04"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:667210000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
