{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:44681000000",
	"version": "1",
	"metadata": {
		"title": "USN-4468-1 -- Bind vulnerabilities",
		"description": "Emanuel Almeida discovered that Bind incorrectly handled certain TCP payloads. A remote attacker could possibly use this issue to cause Bind to crash, resulting in a denial of service. This issue only affected Ubuntu 20.04 LTS. (CVE-2020-8620)  Joseph Gullo discovered that Bind incorrectly handled QNAME minimization when used in certain configurations. A remote attacker could possibly use this issue to cause Bind to crash, resulting in a denial of service. This issue only affected Ubuntu 20.04 LTS. (CVE-2020-8621)  Dave Feldman, Jeff Warren, and Joel Cunningham discovered that Bind incorrectly handled certain truncated responses to a TSIG-signed request. A remote attacker could possibly use this issue to cause Bind to crash, resulting in a denial of service. (CVE-2020-8622)  Lyu Chiy discovered that Bind incorrectly handled certain queries. A remote attacker could possibly use this issue to cause Bind to crash, resulting in a denial of service. (CVE-2020-8623)  Joop Boonen discovered that Bind incorrectly handled certain subdomain update-policy rules. A remote attacker granted privileges to change certain parts of a zone could use this issue to change other contents of the zone, contrary to expectations. This issue only affected Ubuntu 18.04 LTS and Ubuntu 20.04 LTS. (CVE-2020-8624)  Update Instructions:  Run `sudo pro fix USN-4468-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  dnsutils - 1:9.16.1-0ubuntu2.3 bind9-libs - 1:9.16.1-0ubuntu2.3 bind9utils - 1:9.16.1-0ubuntu2.3 bind9-doc - 1:9.16.1-0ubuntu2.3 bind9-utils - 1:9.16.1-0ubuntu2.3 bind9 - 1:9.16.1-0ubuntu2.3 bind9-dnsutils - 1:9.16.1-0ubuntu2.3 bind9-host - 1:9.16.1-0ubuntu2.3 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4468-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4468-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-08-21"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:446810000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
