{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:49452000000",
	"version": "1",
	"metadata": {
		"title": "USN-4945-2 -- Linux kernel (Raspberry Pi) vulnerabilities",
		"description": "USN-4945-1 fixed vulnerabilities in the Linux kernel for Ubuntu 20.04 LTS and Ubuntu 18.04 LTS. This update provides the corresponding Linux kernel updates targeted specifically for Raspberry Pi devices in those same Ubuntu Releases.  Original advisory details:  It was discovered that the Nouveau GPU driver in the Linux kernel did not properly handle error conditions in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2020-25639)  Jan Beulich discovered that the Xen netback backend in the Linux kernel did not properly handle certain error conditions under paravirtualization. An attacker in a guest VM could possibly use this to cause a denial of service (host domain crash). (CVE-2021-28038)  It was discovered that the fastrpc driver in the Linux kernel did not prevent user space applications from sending kernel RPC messages. A local attacker could possibly use this to gain elevated privileges. (CVE-2021-28375)  It was discovered that the Realtek RTL8188EU Wireless device driver in the Linux kernel did not properly validate ssid lengths in some situations. An attacker could use this to cause a denial of service (system crash). (CVE-2021-28660)  It was discovered that the USB/IP driver in the Linux kernel contained race conditions during the update of local and shared status. An attacker could use this to cause a denial of service (system crash). (CVE-2021-29265)  It was discovered that a race condition existed in the netfilter subsystem of the Linux kernel when replacing tables. A local attacker could use this to cause a denial of service (system crash). (CVE-2021-29650)  Arnd Bergmann discovered that the video4linux subsystem in the Linux kernel did not properly deallocate memory in some situations. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2021-30002)  Update Instructions:  Run `sudo pro fix USN-4945-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-5.4.0-1035-raspi - 5.4.0-1035.38 No subscription required  linux-image-raspi-hwe-18.04-edge - 5.4.0.1035.70 linux-image-raspi-hwe-18.04 - 5.4.0.1035.70 linux-image-raspi - 5.4.0.1035.70 linux-image-raspi2-hwe-18.04-edge - 5.4.0.1035.70 linux-image-raspi2 - 5.4.0.1035.70 linux-image-raspi2-hwe-18.04 - 5.4.0.1035.70 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4945-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-4945-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2021-05-19"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:494520000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
