{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:65281000000",
	"version": "1",
	"metadata": {
		"title": "USN-6528-1 -- OpenJDK 8 vulnerabilities",
		"description": "It was discovered that the HotSpot VM implementation in OpenJDK did not properly validate bytecode blocks in certain situations. An attacker could possibly use this to cause a denial of service. (CVE-2022-40433)  Carter Kozak discovered that OpenJDK, when compiling with AVX-512 instruction support enabled, could produce code that resulted in memory corruption in certain situations. An attacker targeting applications built in this way could possibly use this to cause a denial of service or execute arbitrary code. In Ubuntu, OpenJDK defaults to not using AVX-512 instructions. (CVE-2023-22025)  It was discovered that the CORBA implementation in OpenJDK did not properly perform deserialization of IOR string objects. An attacker could possibly use this to bypass Java sandbox restrictions. (CVE-2023-22067)  It was discovered that OpenJDK did not properly perform PKIX certification path validation in certain situations. An attacker could use this to cause a denial of service. (CVE-2023-22081)  Update Instructions:  Run `sudo pro fix USN-6528-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  openjdk-8-doc - 8u392-ga-1~20.04 openjdk-8-jdk - 8u392-ga-1~20.04 openjdk-8-jre-headless - 8u392-ga-1~20.04 openjdk-8-jre - 8u392-ga-1~20.04 openjdk-8-jdk-headless - 8u392-ga-1~20.04 openjdk-8-source - 8u392-ga-1~20.04 openjdk-8-jre-zero - 8u392-ga-1~20.04 openjdk-8-demo - 8u392-ga-1~20.04 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6528-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6528-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-11-29"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:652810000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
