{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:46982000000",
	"version": "1",
	"metadata": {
		"title": "USN-4698-2 -- Dnsmasq regression",
		"description": "USN-4698-1 fixed vulnerabilities in Dnsmasq. The updates introduced regressions in certain environments related to issues with multiple queries, and issues with retries. This update fixes the problem.  Original advisory details:   Moshe Kol and Shlomi Oberman discovered that Dnsmasq incorrectly handled  memory when sorting RRsets. A remote attacker could use this issue to cause  Dnsmasq to hang, resulting in a denial of service, or possibly execute  arbitrary code. (CVE-2020-25681, CVE-2020-25687)    Moshe Kol and Shlomi Oberman discovered that Dnsmasq incorrectly handled  extracting certain names. A remote attacker could use this issue to cause  Dnsmasq to hang, resulting in a denial of service, or possibly execute  arbitrary code. (CVE-2020-25682, CVE-2020-25683)    Moshe Kol and Shlomi Oberman discovered that Dnsmasq incorrectly  implemented address/port checks. A remote attacker could use this issue to  perform a cache poisoning attack. (CVE-2020-25684)    Moshe Kol and Shlomi Oberman discovered that Dnsmasq incorrectly  implemented query resource name checks. A remote attacker could use this  issue to perform a cache poisoning attack. (CVE-2020-25685)    Moshe Kol and Shlomi Oberman discovered that Dnsmasq incorrectly handled  multiple query requests for the same resource name. A remote attacker could  use this issue to perform a cache poisoning attack. (CVE-2020-25686)    It was discovered that Dnsmasq incorrectly handled memory during DHCP  response creation. A remote attacker could possibly use this issue to  cause Dnsmasq to consume resources, leading to a denial of service. This  issue only affected Ubuntu 16.04 LTS, Ubuntu 18.04 LTS, and Ubuntu 20.04  LTS. (CVE-2019-14834)  Update Instructions:  Run `sudo pro fix USN-4698-2` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  dnsmasq - 2.80-1.1ubuntu1.3 dnsmasq-base-lua - 2.80-1.1ubuntu1.3 dnsmasq-utils - 2.80-1.1ubuntu1.3 dnsmasq-base - 2.80-1.1ubuntu1.3 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4698-2",
				"ref_url": "https://ubuntu.com/security/notices/USN-4698-2"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2021-02-24"
			},
			"bug": [
				"https://launchpad.net/bugs/1916462"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:469820000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
