{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:66601000000",
	"version": "1",
	"metadata": {
		"title": "USN-6660-1 -- OpenJDK 11 vulnerabilities",
		"description": "Yi Yang discovered that the Hotspot component of OpenJDK 11 incorrectly handled array accesses in the C1 compiler. An attacker could possibly use this issue to cause a denial of service, execute arbitrary code or bypass Java sandbox restrictions. (CVE-2024-20918)  It was discovered that the Hotspot component of OpenJDK 11 did not properly verify bytecode in certain situations. An attacker could possibly use this issue to bypass Java sandbox restrictions. (CVE-2024-20919)  It was discovered that the Hotspot component of OpenJDK 11 had an optimization flaw when generating range check loop predicates. An attacker could possibly use this issue to cause a denial of service, execute arbitrary code or bypass Java sandbox restrictions. (CVE-2024-20921)  Valentin Eudeline discovered that OpenJDK 11 incorrectly handled certain options in the Nashorn JavaScript subcomponent. An attacker could possibly use this issue to execute arbitrary code. (CVE-2024-20926)  It was discovered that OpenJDK 11 could produce debug logs that contained private keys used for digital signatures. An attacker could possibly use this issue to obtain sensitive information. (CVE-2024-20945)  Hubert Kario discovered that the TLS implementation in OpenJDK 11 had a timing side-channel and incorrectly handled RSA padding. A remote attacker could possibly use this issue to recover sensitive information. (CVE-2024-20952)  Update Instructions:  Run `sudo pro fix USN-6660-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  openjdk-11-source - 11.0.22+7-0ubuntu2~20.04.1 openjdk-11-jre-zero - 11.0.22+7-0ubuntu2~20.04.1 openjdk-11-doc - 11.0.22+7-0ubuntu2~20.04.1 openjdk-11-jre-headless - 11.0.22+7-0ubuntu2~20.04.1 openjdk-11-jdk - 11.0.22+7-0ubuntu2~20.04.1 openjdk-11-jdk-headless - 11.0.22+7-0ubuntu2~20.04.1 openjdk-11-jre - 11.0.22+7-0ubuntu2~20.04.1 openjdk-11-demo - 11.0.22+7-0ubuntu2~20.04.1 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6660-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6660-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2024-02-27"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:666010000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
