{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:57641000000",
	"version": "1",
	"metadata": {
		"title": "USN-5764-1 -- U-Boot vulnerabilities",
		"description": "It was discovered that U-Boot incorrectly handled certain USB DFU download setup packets. A local attacker could use this issue to cause U-Boot to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2022-2347)  Nicolas Bidron and Nicolas Guigo discovered that U-Boot incorrectly handled certain fragmented IP packets. A local attacker could use this issue to cause U-Boot to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, and Ubuntu 22.04 LTS. (CVE-2022-30552, CVE-2022-30790)  It was discovered that U-Boot incorrectly handled certain NFS lookup replies. A remote attacker could use this issue to cause U-Boot to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, and Ubuntu 22.04 LTS. (CVE-2022-30767)  Jincheng Wang discovered that U-Boot incorrectly handled certain SquashFS structures. A local attacker could use this issue to cause U-Boot to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, and Ubuntu 22.04 LTS. (CVE-2022-33103)  Tatsuhiko Yasumatsu discovered that U-Boot incorrectly handled certain SquashFS structures. A local attacker could use this issue to cause U-Boot to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, and Ubuntu 22.04 LTS. (CVE-2022-33967)  It was discovered that U-Boot incorrectly handled the i2c command. A local attacker could use this issue to cause U-Boot to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, and Ubuntu 22.04 LTS. (CVE-2022-34835)  Update Instructions:  Run `sudo pro fix USN-5764-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  u-boot-tools - 2021.01+dfsg-3ubuntu0~20.04.5 u-boot-qemu - 2021.01+dfsg-3ubuntu0~20.04.5 u-boot-sunxi - 2021.01+dfsg-3ubuntu0~20.04.5 u-boot-amlogic - 2021.01+dfsg-3ubuntu0~20.04.5 u-boot - 2021.01+dfsg-3ubuntu0~20.04.5 u-boot-imx - 2021.01+dfsg-3ubuntu0~20.04.5 u-boot-tegra - 2021.01+dfsg-3ubuntu0~20.04.5 u-boot-sifive - 2021.01+dfsg-3ubuntu0~20.04.5 u-boot-qcom - 2021.01+dfsg-3ubuntu0~20.04.5 u-boot-rpi - 2021.01+dfsg-3ubuntu0~20.04.5 u-boot-omap - 2021.01+dfsg-3ubuntu0~20.04.5 u-boot-mvebu - 2021.01+dfsg-3ubuntu0~20.04.5 u-boot-rockchip - 2021.01+dfsg-3ubuntu0~20.04.5 u-boot-exynos - 2021.01+dfsg-3ubuntu0~20.04.5 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5764-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5764-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-12-06"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:576410000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
