{
	"class": "patch",
	"id": "oval:com.ubuntu.focal:def:49811000000",
	"version": "1",
	"metadata": {
		"title": "USN-4981-1 -- Squid vulnerabilities",
		"description": "Joshua Rogers discovered that Squid incorrectly handled requests with the urn: scheme. A remote attacker could possibly use this issue to cause Squid to consume resources, leading to a denial of service. (CVE-2021-28651)  Joshua Rogers discovered that Squid incorrectly handled requests to the Cache Manager API. A remote attacker with access privileges could possibly use this issue to cause Squid to consume resources, leading to a denial of service. This issue was only addressed in Ubuntu 20.04 LTS, Ubuntu 20.10, and Ubuntu 21.04. (CVE-2021-28652)  Joshua Rogers discovered that Squid incorrectly handled certain response headers. A remote attacker could possibly use this issue to cause Squid to crash, resulting in a denial of service. This issue was only affected Ubuntu 20.04 LTS, Ubuntu 20.10, and Ubuntu 21.04. (CVE-2021-28662)  Joshua Rogers discovered that Squid incorrectly handled range request processing. A remote attacker could possibly use this issue to cause Squid to crash, resulting in a denial of service. (CVE-2021-31806, CVE-2021-31807, CVE-2021-31808)  Joshua Rogers discovered that Squid incorrectly handled certain HTTP responses. A remote attacker could possibly use this issue to cause Squid to crash, resulting in a denial of service. (CVE-2021-33620)  Update Instructions:  Run `sudo pro fix USN-4981-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  squid-common - 4.10-1ubuntu1.4 squidclient - 4.10-1ubuntu1.4 squid - 4.10-1ubuntu1.4 squid-cgi - 4.10-1ubuntu1.4 squid-purge - 4.10-1ubuntu1.4 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 20.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4981-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4981-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2021-06-03"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.focal:tst:498110000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
