{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.hirsute:def:2021355610000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-35561 on Ubuntu 21.04 (hirsute) - medium.",
		"Description": "Vulnerability in the Java SE, Oracle GraalVM Enterprise Edition product of Oracle Java SE (component: Utility). Supported versions that are affected are Java SE: 7u311, 8u301, 11.0.12, 17; Oracle GraalVM Enterprise Edition: 20.3.3 and 21.2.0. Easily exploitable vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Java SE, Oracle GraalVM Enterprise Edition. Successful attacks of this vulnerability can result in unauthorized ability to cause a partial denial of service (partial DOS) of Java SE, Oracle GraalVM Enterprise Edition. Note: This vulnerability applies to Java deployments, typically in clients running sandboxed Java Web Start applications or sandboxed Java applets, that load and run untrusted code (e.g., code that comes from the internet) and rely on the Java sandbox for security. This vulnerability can also be exploited by using APIs in the specified Component, e.g., through a web service which supplies data to the APIs. CVSS 3.1 Base Score 5.3 (Availability impacts). CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L). Markus Loewe discovered that the HashMap and HashSet implementations in OpenJDK did not properly validate load factors during deserialization. An attacker could use this to cause a denial of service (excessive memory consumption).",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 21.04"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-35561",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-35561"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2021 Canonical Ltd.",
			"PublicDate": "2021-10-20 11:16:00 UTC",
			"Bug": null,
			"cve": {},
			"PublicDateAtUsn": "2021-10-20 11:16:00 UTC",
			"AssignedTo": "",
			"DiscoveredBy": "Markus Loewe",
			"Crd": "",
			"Ref": [
				"http://people.canonical.com/~ubuntu-security/cve/2021/CVE-2021-35561.html",
				"https://www.oracle.com/security-alerts/cpuoct2021.html",
				"https://ubuntu.com/security/notices/USN-5202-1"
			]
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.hirsute:tst:2020147790000010",
						"comment": "openjdk-15 package in hirsute is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.hirsute:tst:202123410000010",
						"comment": "openjdk-8 package in hirsute was vulnerable but has been fixed (note: '8u312-b07-0ubuntu1~21.04')."
					},
					{
						"test_ref": "oval:com.ubuntu.hirsute:tst:202123410000020",
						"comment": "openjdk-lts package in hirsute was vulnerable but has been fixed (note: '11.0.13+8-0ubuntu1~21.04')."
					}
				]
			}
		]
	}
}
