{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.hirsute:def:2017100780000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2017-10078 on Ubuntu 21.04 (hirsute) - medium.",
    "Description": "Vulnerability in the Java SE component of Oracle Java SE (subcomponent: Scripting). The supported version that is affected is Java SE: 8u131. Easily exploitable vulnerability allows low privileged attacker with network access via multiple protocols to compromise Java SE. Successful attacks of this vulnerability can result in unauthorized creation, deletion or modification access to critical data or all Java SE accessible data as well as unauthorized access to critical data or complete access to all Java SE accessible data. Note: This vulnerability can be exploited through sandboxed Java Web Start applications and sandboxed Java applets. It can also be exploited by supplying data to APIs in the specified Component without using sandboxed Java Web Start applications or sandboxed Java applets, such as through a web service. CVSS 3.0 Base Score 8.1 (Confidentiality and Integrity impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:N). It was discovered that the JavaScript Scripting component of OpenJDK incorrectly allowed access to Java APIs. An attacker could use this to specially craft JavaScript code to bypass access restrictions.",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 21.04"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2017-10078",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-10078"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2017 Canonical Ltd.",
      "PublicDate": "2017-07-20",
      "Bug": null,
      "cve": {},
      "PublicDateAtUsn": "2017-07-20",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": [
        "http://people.canonical.com/~ubuntu-security/cve/2017/CVE-2017-10078.html",
        "http://www.oracle.com/technetwork/security-advisory/cpujul2017verbose-3236625.html#JAVA",
        "https://ubuntu.com/security/notices/USN-3366-1"
      ]
    }
  },
  "notes": {
    "Note": ""
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.hirsute:tst:2017100530000000",
        "comment": "openjdk-8 package in hirsute, is related to the CVE in some way and has been fixed (note: '8u141-b15-1')."
      }
    ]
  }
}
