{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.hirsute:def:2020143720000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2020-14372 on Ubuntu 21.04 (hirsute) - medium.",
    "Description": "A flaw was found in grub2 in versions prior to 2.06, where it incorrectly enables the usage of the ACPI command when Secure Boot is enabled. This flaw allows an attacker with privileged access to craft a Secondary System Description Table (SSDT) containing code to overwrite the Linux kernel lockdown variable content directly into memory. The table is further loaded and executed by the kernel, defeating its Secure Boot lockdown and allowing the attacker to load unsigned code. The highest threat from this vulnerability is to data confidentiality and integrity, as well as system availability. Máté Kukri discovered that the acpi command in GRUB 2 allowed privileged users to load crafted ACPI tables when secure boot is enabled. An attacker could use this to bypass UEFI Secure Boot restrictions.",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 21.04"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2020-14372",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-14372"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2021 Canonical Ltd.",
      "PublicDate": "2021-03-02 18:00:00 UTC",
      "Bug": null,
      "cve": {},
      "PublicDateAtUsn": "2021-03-02 18:00:00 UTC",
      "AssignedTo": "",
      "DiscoveredBy": "Máté Kukri",
      "Crd": "2021-03-02 18:00:00 UTC",
      "Ref": [
        "http://people.canonical.com/~ubuntu-security/cve/2020/CVE-2020-14372.html",
        "https://ubuntu.com/security/notices/USN-4992-1"
      ]
    }
  },
  "notes": {
    "Note": "amurray> CVE title: \"grub2: acpi command allows privileged user to load crafted ACPI tables when secure boot is enabled\" sbeattie> grub2-unsigned will contain fixes and supersede grub2, which will contain only BIOS grub bits."
  },
  "criteria": {
    "criterias": [
      {
        "operator": "OR",
        "criterions": [
          {
            "test_ref": "oval:com.ubuntu.hirsute:tst:2020143720000000",
            "comment": "grub2-signed package in hirsute was vulnerable but has been fixed (note: '1.164')."
          },
          {
            "test_ref": "oval:com.ubuntu.hirsute:tst:2020143720000010",
            "comment": "grub2-unsigned package in hirsute was vulnerable but has been fixed (note: '2.04-1ubuntu42')."
          }
        ]
      }
    ]
  }
}
