{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.hirsute:def:2021411330000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-41133 on Ubuntu 21.04 (hirsute) - medium.",
		"description": "Flatpak is a system for building, distributing, and running sandboxed desktop applications on Linux. In versions prior to 1.10.4 and 1.12.0, Flatpak apps with direct access to AF_UNIX sockets such as those used by Wayland, Pipewire or pipewire-pulse can trick portals and other host-OS services into treating the Flatpak app as though it was an ordinary, non-sandboxed host-OS process. They can do this by manipulating the VFS using recent mount-related syscalls that are not blocked by Flatpak's denylist seccomp filter, in order to substitute a crafted `/.flatpak-info` or make that file disappear entirely. Flatpak apps that act as clients for AF_UNIX sockets such as those used by Wayland, Pipewire or pipewire-pulse can escalate the privileges that the corresponding services will believe the Flatpak app has. Note that protocols that operate entirely over the D-Bus session bus (user bus), system bus or accessibility bus are not affected by this. This is due to the use of a proxy process `xdg-dbus-proxy`, whose VFS cannot be manipulated by the Flatpak app, when interacting with these buses. Patches exist for versions 1.10.4 and 1.12.0, and as of time of publication, a patch for version 1.8.2 is being planned. There are no workarounds aside from upgrading to a patched version.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 21.04"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-41133",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-41133"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-10-08 14:15:00 UTC",
			"bug": [
				"https://bugs.launchpad.net/ubuntu/+source/flatpak/+bug/1946578",
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=995935"
			],
			"cve": {},
			"public_date_at_usn": "2021-10-08 14:15:00 UTC",
			"ref": [
				"http://people.canonical.com/~ubuntu-security/cve/2021/CVE-2021-41133.html",
				"https://github.com/flatpak/flatpak/security/advisories/GHSA-67h7-w3jq-vh4q",
				"https://ubuntu.com/security/notices/USN-5191-1"
			]
		}
	},
	"notes": {
		"note": "amurray> Requires libseccomp>=2.5.0 - this is only in the updates pocket in focal and bionic so libseccomp needs to be published to the security pocket in those releases as well to ensure this vulnerability is properly mitigated."
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.hirsute:tst:2021411330000000",
				"comment": "flatpak package in hirsute was vulnerable but has been fixed (note: '1.10.2-1ubuntu1.1')."
			}
		]
	}
}
