{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.hirsute:def:2020255980000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2020-25598 on Ubuntu 21.04 (hirsute) - medium.",
		"Description": "An issue was discovered in Xen 4.14.x. There is a missing unlock in the XENMEM_acquire_resource error path. The RCU (Read, Copy, Update) mechanism is a synchronisation primitive. A buggy error path in the XENMEM_acquire_resource exits without releasing an RCU reference, which is conceptually similar to forgetting to unlock a spinlock. A buggy or malicious HVM stubdomain can cause an RCU reference to be leaked. This causes subsequent administration operations, (e.g., CPU offline) to livelock, resulting in a host Denial of Service. The buggy codepath has been present since Xen 4.12. Xen 4.14 and later are vulnerable to the DoS. The side effects are believed to be benign on Xen 4.12 and 4.13, but patches are provided nevertheless. The vulnerability can generally only be exploited by x86 HVM VMs, as these are generally the only type of VM that have a Qemu stubdomain. x86 PV and PVH domains, as well as ARM VMs, typically don't use a stubdomain. Only VMs using HVM stubdomains can exploit the vulnerability. VMs using PV stubdomains, or with emulators running in dom0, cannot exploit the vulnerability.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 21.04"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-25598",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-25598"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2020 Canonical Ltd.",
			"PublicDate": "2020-09-23 22:15:00 UTC",
			"Bug": null,
			"cve": {},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": [
				"http://people.canonical.com/~ubuntu-security/cve/2020/CVE-2020-25598.html",
				"https://xenbits.xen.org/xsa/advisory-334.html"
			]
		}
	},
	"notes": {
		"Note": "mdeslaur> hypervisor packages are in universe. For issues in the hypervisor, add appropriate tags to each section, ex: Tags_xen: universe-binary"
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.hirsute:tst:2018104710000000",
				"comment": "xen package in hirsute is affected and may need fixing."
			}
		]
	}
}
