{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.hirsute:def:202019380000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2020-1938 on Ubuntu 21.04 (hirsute) - low.",
		"description": "When using the Apache JServ Protocol (AJP), care must be taken when trusting incoming connections to Apache Tomcat. Tomcat treats AJP connections as having higher trust than, for example, a similar HTTP connection. If such connections are available to an attacker, they can be exploited in ways that may be surprising. In Apache Tomcat 9.0.0.M1 to 9.0.0.30, 8.5.0 to 8.5.50 and 7.0.0 to 7.0.99, Tomcat shipped with an AJP Connector enabled by default that listened on all configured IP addresses. It was expected (and recommended in the security guide) that this Connector would be disabled if not required. This vulnerability report identified a mechanism that allowed: - returning arbitrary files from anywhere in the web application - processing any file in the web application as a JSP Further, if the web application allowed file upload and stored those files within the web application (or the attacker was able to control the content of the web application by some other means) then this, along with the ability to process a file as a JSP, made remote code execution possible. It is important to note that mitigation is only required if an AJP port is accessible to untrusted users. Users wishing to take a defence-in-depth approach and block the vector that permits returning arbitrary files and execution as JSP may upgrade to Apache Tomcat 9.0.31, 8.5.51 or 7.0.100 or later. A number of changes were made to the default AJP Connector configuration in 9.0.31 to harden the default configuration. It is likely that users upgrading to 9.0.31, 8.5.51 or 7.0.100 or later will need to make small changes to their configurations.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 21.04"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-1938",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-1938"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2020 Canonical Ltd.",
			"public_date": "2020-02-24 22:15:00 UTC",
			"bug": [
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=952437",
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=952438",
				"http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=952436",
				"https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=959747 (apache support)",
				"https://bugs.launchpad.net/bugs/1865904"
			],
			"cve": {},
			"ref": [
				"http://people.canonical.com/~ubuntu-security/cve/2020/CVE-2020-1938.html",
				"https://www.tenable.com/blog/cve-2020-1938-ghostcat-apache-tomcat-ajp-file-readinclusion-vulnerability-cnvd-2020-10487",
				"https://lists.apache.org/thread.html/r75113652e46c4dee687236510649acfb70d2c63e074152049c3f399d@%3Cnotifications.ofbiz.apache.org%3E",
				"https://lists.apache.org/thread.html/r7c6f492fbd39af34a68681dbbba0468490ff1a97a1bd79c6a53610ef%40%3Cannounce.tomcat.apache.org%3E",
				"https://lists.apache.org/thread.html/r856cdd87eda7af40b50278d6de80ee4b42d63adeb433a34a7bdaf9db@%3Cnotifications.ofbiz.apache.org%3E",
				"https://security.netapp.com/advisory/ntap-20200226-0002/"
			]
		}
	},
	"notes": {
		"note": "mdeslaur> In Ubuntu packages, the AJP connector is disabled by default, so unless specifically enabled by an admin, deployments made using the package are not vulnerable to this issue.  One of the upstream fixes for this issue renames the requiredSecret parameter to secret and adds a secretRequired parameter that defaults to \"true\". Adding this change to stable releases will result in servers failing to start until the administrator either changes secretRequired to \"false\", or configures an adequate secret. Apache starting supporting a secret in mod_proxy_ajp starting with 2.4.42, which means to enable a secret we will have to issue Apache updates with the backported secret support."
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.hirsute:tst:2019124180000000",
				"comment": "tomcat9 package in hirsute, is related to the CVE in some way and has been fixed (note: '9.0.31-1')."
			}
		]
	}
}
