{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.hirsute:def:2021411360000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-41136 on Ubuntu 21.04 (hirsute) - medium.",
		"description": "Puma is a HTTP 1.1 server for Ruby/Rack applications. Prior to versions 5.5.1 and 4.3.9, using `puma` with a proxy which forwards HTTP header values which contain the LF character could allow HTTP request smugggling. A client could smuggle a request through a proxy, causing the proxy to send a response back to another unknown client. The only proxy which has this behavior, as far as the Puma team is aware of, is Apache Traffic Server. If the proxy uses persistent connections and the client adds another request in via HTTP pipelining, the proxy may mistake it as the first request's body. Puma, however, would see it as two requests, and when processing the second request, send back a response that the proxy does not expect. If the proxy has reused the persistent connection to Puma to send another request for a different client, the second response from the first client will be sent to the second client. This vulnerability was patched in Puma 5.5.1 and 4.3.9. As a workaround, do not use Apache Traffic Server with `puma`.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 21.04"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-41136",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-41136"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-10-12 16:15:00 UTC",
			"cve": {},
			"ref": [
				"http://people.canonical.com/~ubuntu-security/cve/2021/CVE-2021-41136.html",
				"https://github.com/puma/puma/security/advisories/GHSA-48w2-rm65-62xx",
				"https://github.com/puma/puma/commit/acdc3ae571dfae0e045cf09a295280127db65c7f"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.hirsute:tst:2020110760000000",
				"comment": "puma package in hirsute is affected and needs fixing."
			}
		]
	}
}
