{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.oracular:def:2024437880000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-43788 on Ubuntu 24.10 (oracular) - medium",
		"description": "Webpack is a module bundler. Its main purpose is to bundle JavaScript filesfor usage in a browser, yet it is also capable of transforming, bundling,or packaging just about any resource or asset. The webpack developers havediscovered a DOM Clobbering vulnerability in Webpack’s`AutoPublicPathRuntimeModule`. The DOM Clobbering gadget in the module canlead to cross-site scripting (XSS) in web pages where scriptlessattacker-controlled HTML elements (e.g., an `img` tag with an unsanitized`name` attribute) are present. Real-world exploitation of this gadget hasbeen observed in the Canvas LMS which allows a XSS attack to happen througha javascript code compiled by Webpack (the vulnerable part is fromWebpack). DOM Clobbering is a type of code-reuse attack where the attackerfirst embeds a piece of non-script, seemingly benign HTML markups in thewebpage (e.g. through a post or comment) and leverages the gadgets (piecesof js code) living in the existing javascript code to transform it intoexecutable code. This vulnerability can lead to cross-site scripting (XSS)on websites that include Webpack-generated files and allow users to injectcertain scriptless HTML tags with improperly sanitized name or idattributes. This issue has been addressed in release version 5.94.0. Allusers are advised to upgrade. There are no known workarounds for thisissue.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-43788",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-43788"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-08-27 17:15:00 UTC",
			"cve": {
				"text": "CVE-2024-43788",
				"href": "https://ubuntu.com/security/CVE-2024-43788",
				"public": "20240827",
				"cvss_score": "6.1",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.oracular:tst:2023281540000000",
						"comment": "node-webpack package in oracular is affected and may need fixing."
					}
				]
			}
		]
	}
}
