{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.oracular:def:202220530000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-2053 on Ubuntu 24.10 (oracular) - medium",
		"description": "When a POST request comes through AJP and the request exceeds themax-post-size limit (maxEntitySize), Undertow's AjpServerRequestConduitimplementation closes a connection without sending any response to theclient/proxy. This behavior results in that a front-end proxy marking thebackend worker (application server) as an error state and not forwardrequests to the worker for a while. In mod_cluster, this continues untilthe next STATUS request (10 seconds intervals) from the application serverupdates the server state. So, in the worst case, it can result in \"Allworkers are in error state\" and mod_cluster responds \"503 ServiceUnavailable\" for a while (up to 10 seconds). In mod_proxy_balancer, it doesnot forward requests to the worker until the \"retry\" timeout passes.However, luckily, mod_proxy_balancer has \"forcerecovery\" setting (On bydefault; this parameter can force the immediate recovery of all workerswithout considering the retry parameter of the workers if all workers of abalancer are in error state.). So, unlike mod_cluster, mod_proxy_balancerdoes not result in responding \"503 Service Unavailable\". An attacker coulduse this behavior to send a malicious request and trigger server errors,resulting in DoS (denial of service). This flaw was fixed in Undertow2.2.19.Final, Undertow 2.3.0.Alpha2.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-2053",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2022-2053"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-08-05 16:15:00 UTC",
			"cve": {
				"text": "CVE-2022-2053",
				"href": "https://ubuntu.com/security/CVE-2022-2053",
				"public": "20220805",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.oracular:tst:201670460000000",
						"comment": "undertow package in oracular is affected and may need fixing."
					}
				]
			}
		]
	}
}
