{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.oracular:def:2021474650000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-47465 on Ubuntu 24.10 (oracular) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: KVM:PPC: Book3S HV: Fix stack handling in idle_kvm_start_guest() In commit10d91611f426 (\"powerpc/64s: Reimplement book3s idle code in C\")kvm_start_guest() became idle_kvm_start_guest(). The old code allocated astack frame on the emergency stack, but didn't use the frame to storeanything, and also didn't store anything in its caller's frame.idle_kvm_start_guest() on the other hand is written more like a normal Cfunction, it creates a frame on entry, and also stores CR/LR into itscallers frame (per the ABI). The problem is that there is no caller frameon the emergency stack. The emergency stack for a given CPU is allocatedwith: paca_ptrs[i]->emergency_sp = alloc_stack(limit, i) + THREAD_SIZE; Soemergency_sp actually points to the first address above the emergency stackallocation for a given CPU, we must not store above it without firstdecrementing it to create a frame. This is different to the regular kernelstack, paca->kstack, which is initialised to point at an initial frame thatis ready to use. idle_kvm_start_guest() stores the backchain, CR and LR allof which write outside the allocation for the emergency stack. It thencreates a stack frame and saves the non-volatile registers. Unfortunatelythe frame it creates is not large enough to fit the non-volatiles, and sothe saving of the non-volatile registers also writes outside the emergencystack allocation. The end result is that we corrupt whatever is at 0-24bytes, and 112-248 bytes above the emergency stack allocation. In practicethis has gone unnoticed because the memory immediately above the emergencystack happens to be used for other stack allocations, either another CPUsmc_emergency_sp or an IRQ stack. See the order of calls toirqstack_early_init() and emergency_stack_init(). The low addresses ofanother stack are the top of that stack, and so are only used if that stackis under extreme pressue, which essentially never happens in practice - andif it did there's a high likelyhood we'd crash due to that stackoverflowing. Still, we shouldn't be corrupting someone else's stack, and itis purely luck that we aren't corrupting something else. To fix it we saveCR/LR into the caller's frame using the existing r1 on entry, we thencreate a SWITCH_FRAME_SIZE frame (which has space for pt_regs) on theemergency stack with the backchain pointing to the existing stack, and thenfinally we switch to the new frame on the emergency stack.\n\n    Update Instructions:\n\n    Run `sudo pro fix CVE-2021-47465` to fix the vulnerability. The problem can be corrected\n    by updating your system to the following package versions:\n\nlinux-image-6.8.0-31-generic - 6.8.0-31.31\nlinux-image-unsigned-6.8.0-31-generic - 6.8.0-31.31\nlinux-image-unsigned-6.8.0-31-generic-64k - 6.8.0-31.31\nNo subscription required\n\nlinux-image-unsigned-6.8.0-1008-aws - 6.8.0-1008.8\nNo subscription required\n\nlinux-image-unsigned-6.8.0-1007-azure - 6.8.0-1007.7\nNo subscription required\n\nlinux-image-unsigned-6.8.0-1007-gcp - 6.8.0-1007.7\nNo subscription required\n\nlinux-image-unsigned-6.8.0-31-lowlatency - 6.8.0-31.31.1\nlinux-image-unsigned-6.8.0-31-lowlatency-64k - 6.8.0-31.31.1\nNo subscription required\n\nlinux-image-unsigned-6.8.0-1005-oracle - 6.8.0-1005.5\nlinux-image-unsigned-6.8.0-1005-oracle-64k - 6.8.0-1005.5\nNo subscription required\n\nlinux-image-6.8.0-1004-raspi - 6.8.0-1004.4\nNo subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-47465",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-47465"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-22 07:15:00 UTC",
			"cve": {
				"text": "CVE-2021-47465",
				"href": "https://ubuntu.com/security/CVE-2021-47465",
				"public": "20240522"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.oracular:tst:201499000000000",
						"comment": "linux package in oracular, is related to the CVE in some way and has been fixed (note: '6.8.0-31.31')."
					},
					{
						"test_ref": "oval:com.ubuntu.oracular:tst:201499000000010",
						"comment": "linux-aws package in oracular, is related to the CVE in some way and has been fixed (note: '6.8.0-1008.8')."
					},
					{
						"test_ref": "oval:com.ubuntu.oracular:tst:201499000000020",
						"comment": "linux-azure package in oracular, is related to the CVE in some way and has been fixed (note: '6.8.0-1007.7')."
					},
					{
						"test_ref": "oval:com.ubuntu.oracular:tst:201499000000020",
						"comment": "linux-gcp package in oracular, is related to the CVE in some way and has been fixed (note: '6.8.0-1007.7')."
					},
					{
						"test_ref": "oval:com.ubuntu.oracular:tst:201499000000030",
						"comment": "linux-lowlatency package in oracular, is related to the CVE in some way and has been fixed (note: '6.8.0-31.31.1')."
					},
					{
						"test_ref": "oval:com.ubuntu.oracular:tst:201499000000040",
						"comment": "linux-oracle package in oracular, is related to the CVE in some way and has been fixed (note: '6.8.0-1005.5')."
					},
					{
						"test_ref": "oval:com.ubuntu.oracular:tst:201499000000050",
						"comment": "linux-raspi package in oracular, is related to the CVE in some way and has been fixed (note: '6.8.0-1004.4')."
					}
				]
			}
		]
	}
}
