{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.oracular:def:2025216470000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2025-21647 on Ubuntu 24.10 (oracular) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:sched: sch_cake: add bounds checks to host bulk flow fairness countsEven though we fixed a logic error in the commit cited below, syzbotstill managed to trigger an underflow of the per-host bulk flowcounters, leading to an out of bounds memory access.To avoid any such logic errors causing out of bounds memory accesses,this commit factors out all accesses to the per-host bulk flow countersto a series of helpers that perform bounds-checking before anyincrements and decrements. This also has the benefit of improvingreadability by moving the conditional checks for the flow mode intothese helpers, instead of having them spread out throughout thecode (which was the cause of the original logic error).As part of this change, the flow quantum calculation is consolidatedinto a helper function, which means that the dithering applied to theost load scaling is now applied both in the DRR rotation and when asparse flow's quantum is first initiated. The only user-visible effectof this is that the maximum packet size that can be sent while a flowstays sparse will now vary with +/- one byte in some cases. This shouldnot make a noticeable difference in practice, and thus it's not worthcomplicating the code to preserve the old behaviour.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2025-21647",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2025-21647"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2025 Canonical Ltd.",
			"public_date": "2025-01-19 11:15:00 UTC",
			"cve": {
				"text": "CVE-2025-21647",
				"href": "https://ubuntu.com/security/CVE-2025-21647",
				"public": "20250119"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.oracular:tst:201245420000000",
						"comment": "linux package in oracular is affected. An update containing the fix has been completed and is pending publication (note: '6.11.0-20.20')."
					},
					{
						"test_ref": "oval:com.ubuntu.oracular:tst:201245420000010",
						"comment": "linux-aws package in oracular is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.oracular:tst:201245420000020",
						"comment": "linux-azure package in oracular is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.oracular:tst:201245420000030",
						"comment": "linux-gcp package in oracular is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.oracular:tst:201245420000060",
						"comment": "linux-lowlatency package in oracular is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.oracular:tst:201245420000040",
						"comment": "linux-oracle package in oracular is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.oracular:tst:201245420000050",
						"comment": "linux-raspi package in oracular is affected and needs fixing."
					}
				]
			}
		]
	}
}
