{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2021327430000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-32743 on Ubuntu Pro FIPS-updates 22.04 LTS (jammy) - medium",
		"description": "Icinga is a monitoring system which checks the availability of networkresources, notifies users of outages, and generates performance data forreporting. In versions prior to 2.11.10 and from version 2.12.0 throughversion 2.12.4, some of the Icinga 2 features that require credentials forexternal services expose those credentials through the API to authenticatedAPI users with read permissions for the corresponding object types.IdoMysqlConnection and IdoPgsqlConnection (every released version) exposesthe password of the user used to connect to the database. IcingaDB (addedin 2.12.0) exposes the password used to connect to the Redis server.ElasticsearchWriter (added in 2.8.0)exposes the password used to connect tothe Elasticsearch server. An attacker who obtains these credentials canimpersonate Icinga to these services and add, modify and delete informationthere. If credentials with more permissions are in use, this increases theimpact accordingly. Starting with the 2.11.10 and 2.12.5 releases, thesepasswords are no longer exposed via the API. As a workaround, API userpermissions can be restricted to not allow querying of any affectedobjects, either by explicitly listing only the required object types forobject query permissions, or by applying a filter rule.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu Pro FIPS-updates 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-32743",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-32743"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-07-15 16:15:00 UTC",
			"cve": {
				"text": "CVE-2021-32743",
				"href": "https://ubuntu.com/security/CVE-2021-32743",
				"public": "20210715",
				"cvss_score": "8.8",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:201865360000000",
						"comment": "icinga2 package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
