{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.mantic:def:202207780000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2022-0778 on Ubuntu 23.10 (mantic) - high.",
    "Description": "The BN_mod_sqrt() function, which computes a modular square root, contains a bug that can cause it to loop forever for non-prime moduli. Internally this function is used when parsing certificates that contain elliptic curve public keys in compressed form or explicit elliptic curve parameters with a base point encoded in compressed form. It is possible to trigger the infinite loop by crafting a certificate that has invalid explicit curve parameters. Since certificate parsing happens prior to verification of the certificate signature, any process that parses an externally supplied certificate may thus be subject to a denial of service attack. The infinite loop can also be reached when parsing crafted private keys as they can contain explicit elliptic curve parameters. Thus vulnerable situations include: - TLS clients consuming server certificates - TLS servers consuming client certificates - Hosting providers taking certificates or private keys from customers - Certificate authorities parsing certification requests from subscribers - Anything else which parses ASN.1 elliptic curve parameters Also any other applications that use the BN_mod_sqrt() where the attacker can control the parameter values are vulnerable to this DoS issue. In the OpenSSL 1.0.2 version the public key is not parsed during initial parsing of the certificate which makes it slightly harder to trigger the infinite loop. However any operation which requires the public key from the certificate will trigger the infinite loop. In particular the attacker can use a self-signed certificate to trigger the loop during verification of the certificate signature. This issue affects OpenSSL versions 1.0.2, 1.1.1 and 3.0. It was addressed in the releases of 1.1.1n and 3.0.2 on the 15th March 2022. Fixed in OpenSSL 3.0.2 (Affected 3.0.0,3.0.1). Fixed in OpenSSL 1.1.1n (Affected 1.1.1-1.1.1m). Fixed in OpenSSL 1.0.2zd (Affected 1.0.2-1.0.2zc).\n\nUpdate Instructions:\n\nRun `sudo pro fix CVE-2022-0778` to fix the vulnerability. The problem can be corrected\nby updating your system to the following package versions:\n\nefi-shell-aa64 - 2022.11-2\nefi-shell-arm - 2022.11-2\nefi-shell-ia32 - 2022.11-2\nefi-shell-x64 - 2022.11-2\novmf - 2022.11-2\novmf-ia32 - 2022.11-2\nqemu-efi-aarch64 - 2022.11-2\nqemu-efi-arm - 2022.11-2\nNo subscription required\n\nlibssl3 - 3.0.2-0ubuntu1\nopenssl - 3.0.2-0ubuntu1\nNo subscription required",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 23.10"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2022-0778",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-0778"
    },
    "advisory": {
      "Severity": "High",
      "Rights": "Copyright (C) 2022 Canonical Ltd.",
      "PublicDate": "2022-03-15",
      "Bug": null,
      "cve": {
        "text": "CVE-2022-0778",
        "href": "https://ubuntu.com/security/CVE-2022-0778",
        "public": "20220315",
        "cvss_score": "7.5",
        "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
        "usns": "5328-1,5328-2,6457-1"
      },
      "PublicDateAtUsn": "2022-03-15",
      "AssignedTo": "",
      "DiscoveredBy": "Tavis Ormandy",
      "Crd": "2022-03-15",
      "Ref": null
    }
  },
  "notes": {
    "Note": ""
  },
  "criteria": {
    "criterias": [
      {
        "operator": "OR",
        "criterions": [
          {
            "test_ref": "oval:com.ubuntu.mantic:tst:202137120000000",
            "comment": "edk2 package in mantic, is related to the CVE in some way and has been fixed (note: '2022.11-2')."
          },
          {
            "test_ref": "oval:com.ubuntu.mantic:tst:202207780000010",
            "comment": "openssl package in mantic was vulnerable but has been fixed (note: '3.0.2-0ubuntu1')."
          }
        ]
      }
    ]
  }
}
