{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.mantic:def:2021474600000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-47460 on Ubuntu 23.10 (mantic) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: ocfs2:fix data corruption after conversion from inline format Commit 6dbf7bb55598(\"fs: Don't invalidate page buffers in block_write_full_page()\") uncovereda latent bug in ocfs2 conversion from inline inode format to a normal inodeformat. The code in ocfs2_convert_inline_data_to_extents() attempts to zeroout the whole cluster allocated for file data by grabbing, zeroing, anddirtying all pages covering this cluster. However these pages are beyondi_size, thus writeback code generally ignores these dirty pages and noblocks were ever actually zeroed on the disk. This oversight was fixed bycommit 693c241a5f6a (\"ocfs2: No need to zero pages past i_size.\") forstandard ocfs2 write path, inline conversion path was apparently forgotten;the commit log also has a reasoning why the zeroing actually is not needed.After commit 6dbf7bb55598, things became worse as writeback code stoppedinvalidating buffers on pages beyond i_size and thus these pages end upwith clean PageDirty bit but with buffers attached to these pages beingstill dirty. So when a file is converted from inline format, then writebacktriggers, and then the file is grown so that these pages become valid, theinvalid dirtiness state is preserved, mark_buffer_dirty() does nothing onthese pages (buffers are already dirty) but page is never written backbecause it is clean. So data written to these pages is lost once pages arereclaimed. Simple reproducer for the problem is: xfs_io -f -c \"pwrite 02000\" -c \"pwrite 2000 2000\" -c \"fsync\" \\ -c \"pwrite 4000 2000\" ocfs2_fileAfter unmounting and mounting the fs again, you can observe that end of'ocfs2_file' has lost its contents. Fix the problem by not doing thepointless zeroing during conversion from inline format similarly as in thestandard write path. [akpm@linux-foundation.org: fix whitespace, perJoseph]",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 23.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-47460",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-47460"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-22 07:15:00 UTC",
			"cve": {
				"text": "CVE-2021-47460",
				"href": "https://ubuntu.com/security/CVE-2021-47460",
				"public": "20240522"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000000",
						"comment": "linux package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000010",
						"comment": "linux-aws package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000020",
						"comment": "linux-azure package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000030",
						"comment": "linux-gcp package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000060",
						"comment": "linux-ibm: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of kernel support')."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000090",
						"comment": "linux-laptop package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000070",
						"comment": "linux-lowlatency package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000040",
						"comment": "linux-oracle package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000050",
						"comment": "linux-raspi package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000080",
						"comment": "linux-starfive package in mantic is affected and may need fixing."
					}
				]
			}
		]
	}
}
