{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.mantic:def:2021327510000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-32751 on Ubuntu 23.10 (mantic) - medium",
		"description": "Gradle is a build tool with a focus on build automation. In versions priorto 7.2, start scripts generated by the `application` plugin and the`gradlew` script are both vulnerable to arbitrary code execution when anattacker is able to change environment variables for the user running thescript. This may impact those who use `gradlew` on Unix-like systems or usethe scripts generated by Gradle in thieir application on Unix-like systems.For this vulnerability to be exploitable, an attacker needs to be able toset the value of particular environment variables and have thoseenvironment variables be seen by the vulnerable scripts. This issue hasbeen patched in Gradle 7.2 by removing the use of `eval` and requiring theuse of the `bash` shell. There are a few workarounds available. For CI/CDsystems using the Gradle build tool, one may ensure that untrusted usersare unable to change environment variables for the user that executes`gradlew`. If one is unable to upgrade to Gradle 7.2, one may generate anew `gradlew` script with Gradle 7.2 and use it for older versions ofGradle. Fpplications using start scripts generated by Gradle, one mayensure that untrusted users are unable to change environment variables forthe user that executes the start script. A vulnerable start script could bemanually patched to remove the use of `eval` or the use of environmentvariables that affect the application's command-line. If the application issimple enough, one may be able to avoid the use of the start scripts byrunning the application directly with Java command.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 23.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-32751",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-32751"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-07-20 23:15:00 UTC",
			"cve": {
				"text": "CVE-2021-32751",
				"href": "https://ubuntu.com/security/CVE-2021-32751",
				"public": "20210720",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:2019150520000000",
						"comment": "gradle package in mantic is affected and may need fixing."
					}
				]
			}
		]
	}
}
