{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.mantic:def:2021201100000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-20110 on Ubuntu 23.10 (mantic) - medium",
		"Description": "Due to Manage Engine Asset Explorer Agent 1.0.34 not validating HTTPScertificates, an attacker on the network can statically configure their IPaddress to match the Asset Explorer's Server IP address. This will allow anattacker to send a NEWSCAN request to a listening agent on the network aswell as receive the agent's HTTP request verifying its authtoken. Inhttphandler.cpp, the agent reaching out over HTTP is vulnerable to anInteger Overflow, which can be turned into a Heap Overflow allowing forremote code execution as NT AUTHORITY/SYSTEM on the agent machine. TheInteger Overflow occurs when receiving POST response from the Manage Engineserver, and the agent calling \"HttpQueryInfoW\" in order to get the\"Content-Length\" size from the incoming POST request. This size is taken,but multiplied to a larger amount. If an attacker specifies aContent-Length size of 1073741823 or larger, this integer arithmetic willwrap the value back around to smaller integer, then calls \"calloc\" withthis size to allocate memory. The following API \"InternetReadFile\" willcopy the POST data into this buffer, which will be too small for thecontents, and cause heap overflow.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 23.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-20110",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-20110"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2021 Canonical Ltd.",
			"PublicDate": "2021-07-19 15:15:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2021-20110",
				"href": "https://ubuntu.com/security/CVE-2021-20110",
				"public": "20210719",
				"cvss_score": "9.8",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:2021201090000000",
						"comment": "due package in mantic is affected and may need fixing."
					}
				]
			}
		]
	}
}
