{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.mantic:def:2022310420000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2022-31042 on Ubuntu 23.10 (mantic) - low",
		"description": "Guzzle is an open source PHP HTTP client. In affected versions the `Cookie`headers on requests are sensitive information. On making a request usingthe `https` scheme to a server which responds with a redirect to a URI withthe `http` scheme, or on making a request to a server which responds with aredirect to a a URI to a different host, we should not forward the `Cookie`header on. Prior to this fix, only cookies that were managed by our cookiemiddleware would be safely removed, and any `Cookie` header manually addedto the initial request would not be stripped. We now always strip it, andallow the cookie middleware to re-add any cookies that it deems should bethere. Affected Guzzle 7 users should upgrade to Guzzle 7.4.4 as soon aspossible. Affected users using any earlier series of Guzzle should upgradeto Guzzle 6.5.7 or 7.4.4. Users unable to upgrade may consider analternative approach to use your own redirect middleware, rather than ours.If you do not require or expect redirects to be followed, one should simplydisable redirects all together.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 23.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-31042",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2022-31042"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2022 Canonical Ltd.",
			"public_date": "2022-06-10 00:15:00 UTC",
			"cve": {
				"text": "CVE-2022-31042",
				"href": "https://ubuntu.com/security/CVE-2022-31042",
				"public": "20220610",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:2022292480000000",
						"comment": "guzzle package in mantic is affected and may need fixing."
					}
				]
			}
		]
	}
}
