{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.mantic:def:2024385580000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-38558 on Ubuntu 23.10 (mantic) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: net:openvswitch: fix overwriting ct original tuple for ICMPv6OVS_PACKET_CMD_EXECUTE has 3 main attributes: - OVS_PACKET_ATTR_KEY -Packet metadata in a netlink format. - OVS_PACKET_ATTR_PACKET - Binarypacket content. - OVS_PACKET_ATTR_ACTIONS - Actions to execute on thepacket. OVS_PACKET_ATTR_KEY is parsed first to populate sw_flow_keystructure with the metadata like conntrack state, input port, recirculationid, etc. Then the packet itself gets parsed to populate the rest of thekeys from the packet headers. Whenever the packet parsing code startsparsing the ICMPv6 header, it first zeroes out fields in the keycorresponding to Neighbor Discovery information even if it is not an NDpacket. It is an 'ipv6.nd' field. However, the 'ipv6' is a union thatshares the space between 'nd' and 'ct_orig' that holds the original tupleconntrack metadata parsed from the OVS_PACKET_ATTR_KEY. ND packets shouldnot normally have conntrack state, so it's fine to share the space, butnormal ICMPv6 Echo packets or maybe other types of ICMPv6 can have thestate attached and it should not be overwritten. The issue results in allbut the last 4 bytes of the destination address being wiped from theoriginal conntrack tuple leading to incorrect packet matching andpotentially executing wrong actions in case this packet recirculates withinthe datapath or goes back to userspace. ND fields should not be accessed innon-ND packets, so not clearing them should be fine. Executing memset()only for actual ND packets to avoid the issue. Initializing the whole thingbefore parsing is needed because ND packet may not contain all the options.The issue only affects the OVS_PACKET_CMD_EXECUTE path and doesn't affectpackets entering OVS datapath from network interfaces, because in this caseCT metadata is populated from skb after the packet is already parsed.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 23.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-38558",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-38558"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-06-19 14:15:00 UTC",
			"cve": {
				"text": "CVE-2024-38558",
				"href": "https://ubuntu.com/security/CVE-2024-38558",
				"public": "20240619"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000000",
						"comment": "linux package in mantic is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000010",
						"comment": "linux-aws package in mantic is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000020",
						"comment": "linux-azure package in mantic is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000030",
						"comment": "linux-gcp package in mantic is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000060",
						"comment": "linux-ibm: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of kernel support')."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000090",
						"comment": "linux-laptop package in mantic is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000070",
						"comment": "linux-lowlatency package in mantic is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000040",
						"comment": "linux-oracle package in mantic is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000050",
						"comment": "linux-raspi package in mantic is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000080",
						"comment": "linux-starfive package in mantic is affected and needs fixing."
					}
				]
			}
		]
	}
}
