{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.mantic:def:2023528280000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-52828 on Ubuntu 23.10 (mantic) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:bpf: Detect IP == ksym.end as part of BPF programNow that bpf_throw kfunc is the first such call instruction that hasnoreturn semantics within the verifier, this also kicks in dead codeelimination in unprecedented ways. For one, any instruction followinga bpf_throw call will never be marked as seen. Moreover, if a callchainends up throwing, any instructions after the call instruction to theeventually throwing subprog in callers will also never be marked asseen.The tempting way to fix this would be to emit extra 'int3' instructionswhich bump the jited_len of a program, and ensure that during runtimewhen a program throws, we can discover its boundaries even if the callinstruction to bpf_throw (or to subprogs that always throw) is emittedas the final instruction in the program.An example of such a program would be this:do_something():\t...\tr0 = 0\texitfoo():\tr1 = 0\tcall bpf_throw\tr0 = 0\texitbar(cond):\tif r1 != 0 goto pc+2\tcall do_something\texit\tcall foo\tr0 = 0  // Never seen by verifier\texit\t//main(ctx):\tr1 = ...\tcall bar\tr0 = 0\texitHere, if we do end up throwing, the stacktrace would be the following:bpf_throwfoobarmainIn bar, the final instruction emitted will be the call to foo, as such,the return address will be the subsequent instruction (which the JITemits as int3 on x86). This will end up lying outside the jited_len ofthe program, thus, when unwinding, we will fail to discover the returnaddress as belonging to any program and end up in a panic due to theunreliable stack unwinding of BPF programs that we never expect.To remedy this case, make bpf_prog_ksym_find treat IP == ksym.end aspart of the BPF program, so that is_bpf_text_address returns true whensuch a case occurs, and we are able to unwind reliably when the finalinstruction ends up being a call instruction.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 23.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-52828",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-52828"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-21 16:15:00 UTC",
			"cve": {
				"text": "CVE-2023-52828",
				"href": "https://ubuntu.com/security/CVE-2023-52828",
				"public": "20240521"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000000",
						"comment": "linux package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000010",
						"comment": "linux-aws package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000020",
						"comment": "linux-azure package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000030",
						"comment": "linux-gcp package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000060",
						"comment": "linux-ibm: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of kernel support')."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000090",
						"comment": "linux-laptop package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000070",
						"comment": "linux-lowlatency package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000040",
						"comment": "linux-oracle package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000050",
						"comment": "linux-raspi package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000080",
						"comment": "linux-starfive package in mantic is affected and may need fixing."
					}
				]
			}
		]
	}
}
