{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.mantic:def:202141040000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2021-4104 on Ubuntu 23.10 (mantic) - medium.",
		"Description": "JMSAppender in Log4j 1.2 is vulnerable to deserialization of untrusted data when the attacker has write access to the Log4j configuration. The attacker can provide TopicBindingName and TopicConnectionFactoryBindingName configurations causing JMSAppender to perform JNDI requests that result in remote code execution in a similar fashion to CVE-2021-44228. Note this issue only affects Log4j 1.2 when specifically configured to use JMSAppender, which is not the default. Apache Log4j 1.2 reached end of life in August 2015. Users should upgrade to Log4j 2 as it addresses numerous other issues from the previous versions.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 23.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-4104",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-4104"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2021 Canonical Ltd.",
			"PublicDate": "2021-12-14 12:15:00 UTC",
			"Bug": [
				"https://bugzilla.redhat.com/show_bug.cgi?id=2031667"
			],
			"cve": {
				"text": "CVE-2021-4104",
				"href": "https://ubuntu.com/security/CVE-2021-4104",
				"public": "20211214",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
				"usns": "5223-1,5223-2"
			},
			"PublicDateAtUsn": "2021-12-14 12:15:00 UTC",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": "mdeslaur> This issue is similar to CVE-2021-44228, but for log2j < 2.0 and is only vulnerable if configured to use JMSAppender. For an environment to be vulnerable, an attacker would need write access to the log4j.properties configuration file to specifically enable the JMS Appender and configure it with a JNDI lookup to a third party server. If an attacker has write access to the log4j.properties configuration file, there are also other configuration options that can be used to perform code execution attacks. We therefore recommend configuration files be set with appropriate permissions to only permit being modified by trusted individuals."
	},
	"criteria": {
		"criterions": [
			{
				"test_ref": "oval:com.ubuntu.mantic:tst:202141040000000",
				"comment": "apache-log4j1.2 package in mantic is affected and needs fixing."
			}
		]
	}
}
