{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.mantic:def:2024266430000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26643 on Ubuntu 23.10 (mantic) - high",
		"description": "In the Linux kernel, the following vulnerability has been resolved:netfilter: nf_tables: mark set as dead when unbinding anonymous set withtimeout While the rhashtable set gc runs asynchronously, a race allows itto collect elements from anonymous sets with timeouts while it is beingreleased from the commit path. Mingi Cho originally reported this issue ina different path in 6.1.x with a pipapo set with low timeouts which is notpossible upstream since 7395dfacfff6 (\"netfilter: nf_tables: use timestampto check for set element timeout\"). Fix this by setting on the dead flagfor anonymous sets to skip async gc in this case. According to 08e4c8c5919f(\"netfilter: nf_tables: mark newset as dead on transaction abort\"), Florianplans to accelerate abort path by releasing objects via workqueue,therefore, this sets on the dead flag for abort path too.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 23.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26643",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-26643"
		},
		"advisory": {
			"severity": "High",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-03-21 11:15:00 UTC",
			"cve": {
				"text": "CVE-2024-26643",
				"href": "https://ubuntu.com/security/CVE-2024-26643",
				"public": "20240321"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000000",
						"comment": "linux package in mantic is affected. An update containing the fix has been completed and is pending publication (note: '6.5.0-42.42')."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000010",
						"comment": "linux-aws package in mantic is affected. An update containing the fix has been completed and is pending publication (note: '6.5.0-1022.22')."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000020",
						"comment": "linux-azure package in mantic is affected. An update containing the fix has been completed and is pending publication (note: '6.5.0-1023.24')."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000030",
						"comment": "linux-gcp package in mantic is affected. An update containing the fix has been completed and is pending publication (note: '6.5.0-1023.25')."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000060",
						"comment": "linux-ibm: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of kernel support')."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000090",
						"comment": "linux-laptop package in mantic is affected. An update containing the fix has been completed and is pending publication (note: '6.5.0-1018.21')."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000070",
						"comment": "linux-lowlatency package in mantic is affected. An update containing the fix has been completed and is pending publication."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000040",
						"comment": "linux-oracle package in mantic is affected. An update containing the fix has been completed and is pending publication (note: '6.5.0-1025.25')."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000050",
						"comment": "linux-raspi package in mantic is affected. An update containing the fix has been completed and is pending publication (note: '6.5.0-1019.22')."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000080",
						"comment": "linux-starfive package in mantic is affected. An update containing the fix has been completed and is pending publication (note: '6.5.0-1016.17')."
					}
				]
			}
		]
	}
}
