{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.mantic:def:2021472770000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-47277 on Ubuntu 23.10 (mantic) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: kvm:avoid speculation-based attacks from out-of-range memslot accesses KVM'smechanism for accessing guest memory translates a guest physical address(gpa) to a host virtual address using the right-shifted gpa (also known asgfn) and a struct kvm_memory_slot. The translation is performed in__gfn_to_hva_memslot using the following formula: hva =slot->userspace_addr + (gfn - slot->base_gfn) * PAGE_SIZE It is expectedthat gfn falls within the boundaries of the guest's physical memory.However, a guest can access invalid physical addresses in such a way thatthe gfn is invalid. __gfn_to_hva_memslot is called fromkvm_vcpu_gfn_to_hva_prot, which first retrieves a memslot through__gfn_to_memslot. While __gfn_to_memslot does check that the gfn fallswithin the boundaries of the guest's physical memory or not, a CPU canspeculate the result of the check and continue execution speculativelyusing an illegal gfn. The speculation can result in calculating anout-of-bounds hva. If the resulting host virtual address is used to loadanother guest physical address, this is effectively a Spectre gadgetconsisting of two consecutive reads, the second of which is data dependenton the first. Right now it's not clear if there are any cases in which thisis exploitable. One interesting case was reported by the original author ofthis patch, and involves visiting guest page tables on x86. Right now theseare not vulnerable because the hva read goes through get_user(), whichcontains an LFENCE speculation barrier. However, there are patches inprogress for x86 uaccess.h to mask kernel addresses instead of usingLFENCE; once these land, a guest could use speculation to read from theVMM's ring 3 address space. Other architectures such as ARM already use theaddress masking method, and would be susceptible to this same kind ofdata-dependent access gadgets. Therefore, this patch proactively protectsfrom these attacks by masking out-of-bounds gfns in __gfn_to_hva_memslot,which blocks speculation of invalid hvas. Sean Christopherson noted thatthis patch does not cover kvm_read_guest_offset_cached. This however islimited to a few bytes past the end of the cache, and therefore it isunlikely to be useful in the context of building a chain of data dependentaccesses.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 23.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-47277",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-47277"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-21 15:15:00 UTC",
			"cve": {
				"text": "CVE-2021-47277",
				"href": "https://ubuntu.com/security/CVE-2021-47277",
				"public": "20240521"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000000",
						"comment": "linux package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000010",
						"comment": "linux-aws package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000020",
						"comment": "linux-azure package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000030",
						"comment": "linux-gcp package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000060",
						"comment": "linux-ibm: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of kernel support')."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000090",
						"comment": "linux-laptop package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000070",
						"comment": "linux-lowlatency package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000040",
						"comment": "linux-oracle package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000050",
						"comment": "linux-raspi package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000080",
						"comment": "linux-starfive package in mantic is affected and may need fixing."
					}
				]
			}
		]
	}
}
