{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.mantic:def:2021476170000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-47617 on Ubuntu 23.10 (mantic) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:PCI: pciehp: Fix infinite loop in IRQ handler upon power faultThe Power Fault Detected bit in the Slot Status register differs fromall other hotplug events in that it is sticky:  It can only be clearedafter turning off slot power.  Per PCIe r5.0, sec. 6.7.1.8:  If a power controller detects a main power fault on the hot-plug slot,  it must automatically set its internal main power fault latch [...].  The main power fault latch is cleared when software turns off power to  the hot-plug slot.The stickiness used to cause interrupt storms and infinite loops whichwere fixed in 2009 by commits 5651c48cfafe (\"PCI pciehp: fix power faultinterrupt storm problem\") and 99f0169c17f3 (\"PCI: pciehp: enablesoftware notification on empty slots\").Unfortunately in 2020 the infinite loop issue was inadvertentlyreintroduced by commit 8edf5332c393 (\"PCI: pciehp: Fix MSI interruptrace\"):  The hardirq handler pciehp_isr() clears the PFD bit untilpciehp's power_fault_detected flag is set.  That happens in the IRQthread pciehp_ist(), which never learns of the event because the hardirqhandler is stuck in an infinite loop.  Fix by setting thepower_fault_detected flag already in the hardirq handler.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 23.10"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-47617",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-47617"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-06-20",
			"cve": {
				"text": "CVE-2021-47617",
				"href": "https://ubuntu.com/security/CVE-2021-47617",
				"public": "20240620"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000000",
						"comment": "linux package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000010",
						"comment": "linux-aws package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000020",
						"comment": "linux-azure package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000030",
						"comment": "linux-gcp package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000060",
						"comment": "linux-ibm: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of kernel support')."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000090",
						"comment": "linux-laptop package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000070",
						"comment": "linux-lowlatency package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000040",
						"comment": "linux-oracle package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000050",
						"comment": "linux-raspi package in mantic is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.mantic:tst:201245420000080",
						"comment": "linux-starfive package in mantic is affected and may need fixing."
					}
				]
			}
		]
	}
}
