{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2024314970000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-31497 on Ubuntu 22.04 LTS (jammy) - medium",
		"description": "In PuTTY 0.68 through 0.80 before 0.81, biased ECDSA nonce generationallows an attacker to recover a user's NIST P-521 secret key via a quickattack in approximately 60 signatures. This is especially important in ascenario where an adversary is able to read messages signed by PuTTY orPageant. The required set of signed messages may be publicly readablebecause they are stored in a public Git service that supports use of SSHfor commit signing, and the signatures were made by Pageant through anagent-forwarding mechanism. In other words, an adversary may already haveenough signature information to compromise a victim's private key, even ifthere is no further use of vulnerable PuTTY versions. After a keycompromise, an adversary may be able to conduct supply-chain attacks onsoftware maintained in Git. A second, independent scenario is that theadversary is an operator of an SSH server to which the victim authenticates(for remote login or file copy), even though this server is not fullytrusted by the victim, and the victim uses the same private key for SSHconnections to other services operated by other entities. Here, the rogueserver operator (who would otherwise have no way to determine the victim'sprivate key) can derive the victim's private key, and then use it forunauthorized access to those other services. If the other services includeGit services, then again it may be possible to conduct supply-chain attackson software maintained in Git. This also affects, for example, FileZillabefore 3.67.0, WinSCP before 6.3.3, TortoiseGit before 2.15.0.1, andTortoiseSVN through 1.14.6.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-31497",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-31497"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-04-15 20:15:00 UTC",
			"cve": {
				"text": "CVE-2024-31497",
				"href": "https://ubuntu.com/security/CVE-2024-31497",
				"public": "20240415",
				"cvss_score": "5.9",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2024314970000000",
						"comment": "filezilla package in jammy is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2019170670000000",
						"comment": "putty package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
