{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.jammy:def:2024378910000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-37891 on Ubuntu 22.04 LTS (jammy) - low",
		"description": "urllib3 is a user-friendly HTTP client library for Python. When usingurllib3's proxy support with `ProxyManager`, the `Proxy-Authorization`header is only sent to the configured proxy, as expected. However, whensending HTTP requests *without* using urllib3's proxy support, it'spossible to accidentally configure the `Proxy-Authorization` header eventhough it won't have any effect as the request is not using a forwardingproxy or a tunneling proxy. In those cases, urllib3 doesn't treat the`Proxy-Authorization` HTTP header as one carrying authentication materialand thus doesn't strip the header on cross-origin redirects. Because thisis a highly unlikely scenario, we believe the severity of thisvulnerability is low for almost all users. Out of an abundance of cautionurllib3 will automatically strip the `Proxy-Authorization` header duringcross-origin redirects to avoid the small chance that users are doing thison accident. Users should use urllib3's proxy support or disable automaticredirects to achieve safe processing of the `Proxy-Authorization` header,but we still decided to strip the header by default in order to furtherprotect users who aren't using the correct approach. We believe the numberof usages affected by this advisory is low. It requires all of thefollowing to be true to be exploited: 1. Setting the `Proxy-Authorization`header without using urllib3's built-in proxy support. 2. Not disablingHTTP redirects. 3. Either not using an HTTPS origin server or for the proxyor target origin to redirect to a malicious origin. Users are advised toupdate to either version 1.26.19 or version 2.2.2. Users unable to upgrademay use the `Proxy-Authorization` header with urllib3's `ProxyManager`,disable HTTP redirects using `redirects=False` when sending requests, ornot user the `Proxy-Authorization` header as mitigations.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 22.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-37891",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-37891"
		},
		"advisory": {
			"severity": "Low",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-06-17 20:15:00 UTC",
			"cve": {
				"text": "CVE-2024-37891",
				"href": "https://ubuntu.com/security/CVE-2024-37891",
				"public": "20240617"
			},
			"assigned_to": "rodrigo-zaiden"
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2024378910000000",
						"comment": "python-urllib3 package in jammy is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.jammy:tst:2023326810000010",
						"comment": "python-pip package in jammy is affected and may need fixing."
					}
				]
			}
		]
	}
}
