{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:60391000000",
	"version": "1",
	"metadata": {
		"title": "USN-6039-1 -- OpenSSL vulnerabilities",
		"description": "It was discovered that OpenSSL was not properly managing file locks when processing policy constraints. If a user or automated system were tricked into processing a certificate chain with specially crafted policy constraints, a remote attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 22.04 LTS and Ubuntu 22.10. (CVE-2022-3996)  David Benjamin discovered that OpenSSL was not properly performing the verification of X.509 certificate chains that include policy constraints, which could lead to excessive resource consumption. If a user or automated system were tricked into processing a specially crafted X.509 certificate chain that includes policy constraints, a remote attacker could possibly use this issue to cause a denial of service. (CVE-2023-0464)  David Benjamin discovered that OpenSSL was not properly handling invalid certificate policies in leaf certificates, which would result in certain policy checks being skipped for the certificate. If a user or automated system were tricked into processing a specially crafted certificate, a remote attacker could possibly use this issue to assert invalid certificate policies and circumvent policy checking. (CVE-2023-0465)  David Benjamin discovered that OpenSSL incorrectly documented the functionalities of function X509_VERIFY_PARAM_add0_policy, stating that it would implicitly enable certificate policy checks when doing certificate verifications, contrary to its implementation. This could cause users and applications to not perform certificate policy checks even when expected to do so. (CVE-2023-0466)  Update Instructions:  Run `sudo pro fix USN-6039-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libssl1.0.0 - 1.0.2n-1ubuntu5.12 libssl1.0-dev - 1.0.2n-1ubuntu5.12 openssl1.0 - 1.0.2n-1ubuntu5.12 No subscription required  libssl-dev - 1.1.1-1ubuntu2.1~18.04.22 openssl - 1.1.1-1ubuntu2.1~18.04.22 libssl-doc - 1.1.1-1ubuntu2.1~18.04.22 libssl1.1 - 1.1.1-1ubuntu2.1~18.04.22 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-6039-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-6039-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-04-25"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:603910000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:603910000010",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
