{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:38783000000",
	"version": "1",
	"metadata": {
		"title": "USN-3878-3 -- Linux kernel regression",
		"description": "USN-3878-1 fixed vulnerabilities in the Linux kernel. Unfortunately, that update introduced a regression that could prevent systems with certain graphics chipsets from booting. This update fixes the problem.  We apologize for the inconvenience.  Original advisory details:   It was discovered that a race condition existed in the vsock address family  implementation of the Linux kernel that could lead to a use-after-free  condition. A local attacker in a guest virtual machine could use this to  expose sensitive information (host machine kernel memory). (CVE-2018-14625)   Cfir Cohen discovered that a use-after-free vulnerability existed in the  KVM implementation of the Linux kernel, when handling interrupts in  environments where nested virtualization is in use (nested KVM  virtualization is not enabled by default in Ubuntu kernels). A local  attacker in a guest VM could possibly use this to gain administrative  privileges in a host machine. (CVE-2018-16882)   Wei Wu discovered that the KVM implementation in the Linux kernel did not  properly ensure that ioapics were initialized. A local attacker could use  this to cause a denial of service (system crash). (CVE-2018-19407)   It was discovered that the crypto subsystem of the Linux kernel leaked  uninitialized memory to user space in some situations. A local attacker  could use this to expose sensitive information (kernel memory).  (CVE-2018-19854)  Update Instructions:  Run `sudo pro fix USN-3878-3` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.18.0-15-lowlatency - 4.18.0-15.16~18.04.1 linux-image-4.18.0-15-snapdragon - 4.18.0-15.16~18.04.1 linux-image-4.18.0-15-generic-lpae - 4.18.0-15.16~18.04.1 linux-image-4.18.0-15-generic - 4.18.0-15.16~18.04.1 No subscription required  linux-image-snapdragon-hwe-18.04 - 4.18.0.15.65 linux-image-lowlatency-hwe-18.04 - 4.18.0.15.65 linux-image-virtual-hwe-18.04 - 4.18.0.15.65 linux-image-generic-lpae-hwe-18.04 - 4.18.0.15.65 linux-image-generic-hwe-18.04 - 4.18.0.15.65 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3878-3",
				"ref_url": "https://ubuntu.com/security/notices/USN-3878-3"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2019-02-08"
			},
			"bug": [
				"https://launchpad.net/bugs/1814555"
			]
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:387830000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
