{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:59271000000",
	"version": "1",
	"metadata": {
		"title": "USN-5927-1 -- Linux kernel (Azure) vulnerabilities",
		"description": "It was discovered that the Upper Level Protocol (ULP) subsystem in the Linux kernel did not properly handle sockets entering the LISTEN state in certain protocols, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-0461)  It was discovered that the System V IPC implementation in the Linux kernel did not properly handle large shared memory counts. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2021-3669)  It was discovered that a use-after-free vulnerability existed in the SGI GRU driver in the Linux kernel. A local attacker could possibly use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3424)  It was discovered that a race condition existed in the Kernel Connection Multiplexor (KCM) socket implementation in the Linux kernel when releasing sockets in certain situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-3521)  It was discovered that the Netronome Ethernet driver in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3545)  It was discovered that the Broadcom FullMAC USB WiFi driver in the Linux kernel did not properly perform bounds checking in some situations. A physically proximate attacker could use this to craft a malicious USB device that when inserted, could cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3628)  Ziming Zhang discovered that the VMware Virtual GPU DRM driver in the Linux kernel contained an out-of-bounds write vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-36280)  It was discovered that a use-after-free vulnerability existed in the Bluetooth stack in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3640)  Hyunwoo Kim discovered that the DVB Core driver in the Linux kernel did not properly perform reference counting in some situations, leading to a use- after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-41218)  It was discovered that a race condition existed in the Xen network backend driver in the Linux kernel when handling dropped packets in certain circumstances. An attacker could use this to cause a denial of service (kernel deadlock). (CVE-2022-42328, CVE-2022-42329)  Tamás Koczka discovered that the Bluetooth L2CAP implementation in the Linux kernel did not properly initialize memory in some situations. A physically proximate attacker could possibly use this to expose sensitive information (kernel memory). (CVE-2022-42895)  It was discovered that the network queuing discipline implementation in the Linux kernel contained a null pointer dereference in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-47929)  José Oliveira and Rodrigo Branco discovered that the prctl syscall implementation in the Linux kernel did not properly protect against indirect branch prediction attacks in some situations. A local attacker could possibly use this to expose sensitive information. (CVE-2023-0045)  It was discovered that a use-after-free vulnerability existed in the Advanced Linux Sound Architecture (ALSA) subsystem. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-0266)  Kyle Zeng discovered that the IPv6 implementation in the Linux kernel contained a NULL pointer dereference vulnerability in certain situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-0394)  Kyle Zeng discovered that the ATM VC queuing discipline implementation in the Linux kernel contained a type confusion vulnerability in some situations. An attacker could use this to cause a denial of service (system crash). (CVE-2023-23455)  It was discovered that the RNDIS USB driver in the Linux kernel contained an integer overflow vulnerability. A local attacker with physical access could plug in a malicious USB device to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-23559)  Update Instructions:  Run `sudo pro fix USN-5927-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-azure-4.15-tools-4.15.0-1162 - 4.15.0-1162.177 linux-modules-extra-4.15.0-1162-azure - 4.15.0-1162.177 linux-tools-4.15.0-1162-azure - 4.15.0-1162.177 linux-modules-4.15.0-1162-azure - 4.15.0-1162.177 linux-headers-4.15.0-1162-azure - 4.15.0-1162.177 linux-azure-4.15-cloud-tools-4.15.0-1162 - 4.15.0-1162.177 linux-azure-4.15-headers-4.15.0-1162 - 4.15.0-1162.177 linux-image-4.15.0-1162-azure - 4.15.0-1162.177 linux-image-unsigned-4.15.0-1162-azure - 4.15.0-1162.177 linux-cloud-tools-4.15.0-1162-azure - 4.15.0-1162.177 linux-buildinfo-4.15.0-1162-azure - 4.15.0-1162.177 No subscription required  linux-headers-azure-lts-18.04 - 4.15.0.1162.130 linux-azure-lts-18.04 - 4.15.0.1162.130 linux-signed-image-azure-lts-18.04 - 4.15.0.1162.130 linux-modules-extra-azure-lts-18.04 - 4.15.0.1162.130 linux-signed-azure-lts-18.04 - 4.15.0.1162.130 linux-cloud-tools-azure-lts-18.04 - 4.15.0.1162.130 linux-tools-azure-lts-18.04 - 4.15.0.1162.130 linux-image-azure-lts-18.04 - 4.15.0.1162.130 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5927-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5927-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-03-07"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:592710000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
