{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:39311000000",
	"version": "1",
	"metadata": {
		"title": "USN-3931-1 -- Linux kernel vulnerabilities",
		"description": "M. Vefa Bicakci and Andy Lutomirski discovered that the kernel did not properly set up all arguments to an error handler callback used when running as a paravirtualized guest. An unprivileged attacker in a paravirtualized guest VM could use this to cause a denial of service (guest VM crash). (CVE-2018-14678)  It was discovered that the KVM implementation in the Linux kernel on ARM 64bit processors did not properly handle some ioctls. An attacker with the privilege to create KVM-based virtual machines could use this to cause a denial of service (host system crash) or execute arbitrary code in the host. (CVE-2018-18021)  Mathias Payer and Hui Peng discovered a use-after-free vulnerability in the Advanced Linux Sound Architecture (ALSA) subsystem. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2018-19824)  Shlomi Oberman, Yuli Shapiro, and Ran Menscher discovered an information leak in the Bluetooth implementation of the Linux kernel. An attacker within Bluetooth range could use this to expose sensitive information (kernel memory). (CVE-2019-3459, CVE-2019-3460)  Jann Horn discovered that the KVM implementation in the Linux kernel contained a use-after-free vulnerability. An attacker in a guest VM with access to /dev/kvm could use this to cause a denial of service (guest VM crash). (CVE-2019-6974)  Jim Mattson and Felix Wilhelm discovered a use-after-free vulnerability in the KVM subsystem of the Linux kernel, when using nested virtual machines. A local attacker in a guest VM could use this to cause a denial of service (system crash) or possibly execute arbitrary code in the host system. (CVE-2019-7221)  Felix Wilhelm discovered that an information leak vulnerability existed in the KVM subsystem of the Linux kernel, when nested virtualization is used. A local attacker could use this to expose sensitive information (host system memory to a guest VM). (CVE-2019-7222)  Jann Horn discovered that the eBPF implementation in the Linux kernel was insufficiently hardened against Spectre V1 attacks. A local attacker could use this to expose sensitive information. (CVE-2019-7308)  It was discovered that a use-after-free vulnerability existed in the user- space API for crypto (af_alg) implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-8912)  It was discovered that the Linux kernel did not properly deallocate memory when handling certain errors while reading files. A local attacker could use this to cause a denial of service (excessive memory consumption). (CVE-2019-8980)  Jann Horn discovered that the mmap implementation in the Linux kernel did not properly check for the mmap minimum address in some situations. A local attacker could use this to assist exploiting a kernel NULL pointer dereference vulnerability. (CVE-2019-9213)  Update Instructions:  Run `sudo pro fix USN-3931-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-4.15.0-1010-oracle - 4.15.0-1010.12 No subscription required  linux-image-4.15.0-1029-gcp - 4.15.0-1029.31 No subscription required  linux-image-4.15.0-1031-kvm - 4.15.0-1031.31 No subscription required  linux-image-4.15.0-1033-raspi2 - 4.15.0-1033.35 No subscription required  linux-image-4.15.0-1035-aws - 4.15.0-1035.37 No subscription required  linux-image-4.15.0-1035-oem - 4.15.0-1035.40 No subscription required  linux-image-4.15.0-47-snapdragon - 4.15.0-47.50 linux-image-4.15.0-47-generic-lpae - 4.15.0-47.50 linux-image-4.15.0-47-lowlatency - 4.15.0-47.50 linux-image-4.15.0-47-generic - 4.15.0-47.50 No subscription required  linux-image-oracle - 4.15.0.1010.13 No subscription required  linux-image-gke - 4.15.0.1029.31 linux-image-gcp - 4.15.0.1029.31 No subscription required  linux-image-kvm - 4.15.0.1031.31 No subscription required  linux-image-raspi2 - 4.15.0.1033.31 No subscription required  linux-image-aws - 4.15.0.1035.34 No subscription required  linux-image-oem - 4.15.0.1035.40 No subscription required  linux-image-virtual-hwe-16.04-edge - 4.15.0.47.49 linux-image-lowlatency-hwe-16.04 - 4.15.0.47.49 linux-image-generic-hwe-16.04-edge - 4.15.0.47.49 linux-image-generic-lpae-hwe-16.04 - 4.15.0.47.49 linux-image-virtual - 4.15.0.47.49 linux-image-snapdragon - 4.15.0.47.49 linux-image-virtual-hwe-16.04 - 4.15.0.47.49 linux-image-generic-lpae-hwe-16.04-edge - 4.15.0.47.49 linux-image-generic - 4.15.0.47.49 linux-image-lowlatency-hwe-16.04-edge - 4.15.0.47.49 linux-image-generic-hwe-16.04 - 4.15.0.47.49 linux-image-generic-lpae - 4.15.0.47.49 linux-image-lowlatency - 4.15.0.47.49 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-3931-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-3931-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2019-04-02"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:393110000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:393110000010",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:393110000020",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:393110000030",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:393110000040",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:393110000050",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:393110000060",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
