{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:59641000000",
	"version": "1",
	"metadata": {
		"title": "USN-5964-1 -- curl vulnerabilities",
		"description": "Harry Sintonen discovered that curl incorrectly handled certain TELNET connection options. Due to lack of proper input scrubbing, curl could pass on user name and telnet options to the server as provided, contrary to expectations. (CVE-2023-27533)  Harry Sintonen discovered that curl incorrectly handled special tilde characters when used with SFTP paths. A remote attacker could possibly use this issue to circumvent filtering. (CVE-2023-27534)  Harry Sintonen discovered that curl incorrectly reused certain FTP connections. This could lead to the wrong credentials being reused, contrary to expectations. (CVE-2023-27535)  Harry Sintonen discovered that curl incorrectly reused connections when the GSS delegation option had been changed. This could lead to the option being reused, contrary to expectations. (CVE-2023-27536)  Harry Sintonen discovered that curl incorrectly reused certain SSH connections. This could lead to the wrong credentials being reused, contrary to expectations. (CVE-2023-27538)  Update Instructions:  Run `sudo pro fix USN-5964-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libcurl4-gnutls-dev - 7.58.0-2ubuntu3.24 libcurl4-openssl-dev - 7.58.0-2ubuntu3.24 libcurl3-gnutls - 7.58.0-2ubuntu3.24 libcurl4-doc - 7.58.0-2ubuntu3.24 libcurl3-nss - 7.58.0-2ubuntu3.24 libcurl4-nss-dev - 7.58.0-2ubuntu3.24 libcurl4 - 7.58.0-2ubuntu3.24 curl - 7.58.0-2ubuntu3.24 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5964-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5964-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-03-20"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:596410000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
