{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:56601000000",
	"version": "1",
	"metadata": {
		"title": "USN-5660-1 -- Linux kernel (GCP) vulnerabilities",
		"description": "It was discovered that the framebuffer driver on the Linux kernel did not verify size limits when changing font or screen size, leading to an out-of- bounds write. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-33655)  Moshe Kol, Amit Klein and Yossi Gilad discovered that the IP implementation in the Linux kernel did not provide sufficient randomization when calculating port offsets. An attacker could possibly use this to expose sensitive information. (CVE-2022-1012, CVE-2022-32296)  Norbert Slusarek discovered that a race condition existed in the perf subsystem in the Linux kernel, resulting in a use-after-free vulnerability. A privileged local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-1729)  It was discovered that the device-mapper verity (dm-verity) driver in the Linux kernel did not properly verify targets being loaded into the device- mapper table. A privileged attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-2503)  Domingo Dirutigliano and Nicola Guerrera discovered that the netfilter subsystem in the Linux kernel did not properly handle rules that truncated packets below the packet header size. When such rules are in place, a remote attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-36946)  Update Instructions:  Run `sudo pro fix USN-5660-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-tools-5.4.0-1089-gcp - 5.4.0-1089.97~18.04.1 linux-gcp-5.4-headers-5.4.0-1089 - 5.4.0-1089.97~18.04.1 linux-image-5.4.0-1089-gcp - 5.4.0-1089.97~18.04.1 linux-headers-5.4.0-1089-gcp - 5.4.0-1089.97~18.04.1 linux-image-unsigned-5.4.0-1089-gcp - 5.4.0-1089.97~18.04.1 linux-modules-extra-5.4.0-1089-gcp - 5.4.0-1089.97~18.04.1 linux-buildinfo-5.4.0-1089-gcp - 5.4.0-1089.97~18.04.1 linux-modules-5.4.0-1089-gcp - 5.4.0-1089.97~18.04.1 linux-gcp-5.4-tools-5.4.0-1089 - 5.4.0-1089.97~18.04.1 No subscription required  linux-tools-gcp - 5.4.0.1089.68 linux-modules-extra-gcp-edge - 5.4.0.1089.68 linux-tools-gcp-edge - 5.4.0.1089.68 linux-modules-extra-gcp - 5.4.0.1089.68 linux-gcp-edge - 5.4.0.1089.68 linux-headers-gcp-edge - 5.4.0.1089.68 linux-image-gcp - 5.4.0.1089.68 linux-headers-gcp - 5.4.0.1089.68 linux-gcp - 5.4.0.1089.68 linux-image-gcp-edge - 5.4.0.1089.68 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5660-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5660-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-10-06"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:566010000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
