{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:43001000000",
	"version": "1",
	"metadata": {
		"title": "USN-4300-1 -- Linux kernel vulnerabilities",
		"description": "It was discovered that the KVM implementation in the Linux kernel, when paravirtual TLB flushes are enabled in guests, the hypervisor in some situations could miss deferred TLB flushes or otherwise mishandle them. An attacker in a guest VM could use this to expose sensitive information (read memory from another guest VM). (CVE-2019-3016)  Paulo Bonzini discovered that the KVM hypervisor implementation in the Linux kernel could improperly let a nested (level 2) guest access the resources of a parent (level 1) guest in certain situations. An attacker could use this to expose sensitive information. (CVE-2020-2732)  It was discovered that the Afatech AF9005 DVB-T USB device driver in the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker could possibly use this to cause a denial of service (kernel memory exhaustion). (CVE-2019-18809)  It was discovered that the Intel(R) XL710 Ethernet Controller device driver in the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker could possibly use this to cause a denial of service (kernel memory exhaustion). (CVE-2019-19043)  It was discovered that the RPMSG character device interface in the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker could possibly use this to cause a denial of service (kernel memory exhaustion). (CVE-2019-19053)  It was discovered that the Marvell Wi-Fi device driver in the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker could use this to possibly cause a denial of service (kernel memory exhaustion). (CVE-2019-19056)  It was discovered that the Intel(R) Wi-Fi device driver in the Linux kernel device driver in the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker could possibly use this to cause a denial of service (kernel memory exhaustion). (CVE-2019-19058, CVE-2019-19059)  It was discovered that the Serial Peripheral Interface (SPI) driver in the Linux kernel device driver in the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker could possibly use this to cause a denial of service (kernel memory exhaustion). (CVE-2019-19064)  It was discovered that the Brocade BFA Fibre Channel device driver in the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker could possibly use this to cause a denial of service (kernel memory exhaustion). (CVE-2019-19066)  It was discovered that the Realtek RTL8xxx USB Wi-Fi device driver in the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker could possibly use this to cause a denial of service (kernel memory exhaustion). (CVE-2019-19068)  Update Instructions:  Run `sudo pro fix USN-4300-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-5.3.0-1014-gcp - 5.3.0-1014.15~18.04.1 linux-image-5.3.0-1014-gke - 5.3.0-1014.15~18.04.1 No subscription required  linux-image-5.3.0-1016-azure - 5.3.0-1016.17~18.04.1 No subscription required  linux-image-5.3.0-1019-raspi2 - 5.3.0-1019.21~18.04.1 No subscription required  linux-image-5.3.0-42-generic - 5.3.0-42.34~18.04.1 linux-image-5.3.0-42-generic-lpae - 5.3.0-42.34~18.04.1 linux-image-5.3.0-42-lowlatency - 5.3.0-42.34~18.04.1 No subscription required  linux-image-gcp-edge - 5.3.0.1014.13 No subscription required  linux-image-gke-5.3 - 5.3.0.1014.4 No subscription required  linux-image-azure-edge - 5.3.0.1016.16 No subscription required  linux-image-raspi2-hwe-18.04 - 5.3.0.1019.8 No subscription required  linux-image-snapdragon-hwe-18.04-edge - 5.3.0.42.99 linux-image-lowlatency-hwe-18.04-edge - 5.3.0.42.99 linux-image-snapdragon-hwe-18.04 - 5.3.0.42.99 linux-image-lowlatency-hwe-18.04 - 5.3.0.42.99 linux-image-generic-hwe-18.04 - 5.3.0.42.99 linux-image-generic-lpae-hwe-18.04 - 5.3.0.42.99 linux-image-virtual-hwe-18.04-edge - 5.3.0.42.99 linux-image-generic-hwe-18.04-edge - 5.3.0.42.99 linux-image-generic-lpae-hwe-18.04-edge - 5.3.0.42.99 linux-image-virtual-hwe-18.04 - 5.3.0.42.99 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4300-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4300-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-03-25"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:430010000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:430010000010",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:430010000020",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:430010000030",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
