{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:46971000000",
	"version": "1",
	"metadata": {
		"title": "USN-4697-1 -- Pillow vulnerabilities",
		"description": "It was discovered that Pillow incorrectly handled certain PCX image files. If a user or automated system were tricked into opening a specially-crafted PCX file, a remote attacker could possibly cause Pillow to crash, resulting in a denial of service. (CVE-2020-35653)  It was discovered that Pillow incorrectly handled certain Tiff image files. If a user or automated system were tricked into opening a specially-crafted Tiff file, a remote attacker could cause Pillow to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 20.04 LTS and Ubuntu 20.10. (CVE-2020-35654)  It was discovered that Pillow incorrectly handled certain SGI image files. If a user or automated system were tricked into opening a specially-crafted SGI file, a remote attacker could possibly cause Pillow to crash, resulting in a denial of service. This issue only affected Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, and Ubuntu 20.10. (CVE-2020-35655)  Update Instructions:  Run `sudo pro fix USN-4697-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  python3-pil.imagetk - 5.1.0-1ubuntu0.4 python-pil-doc - 5.1.0-1ubuntu0.4 python3-pil - 5.1.0-1ubuntu0.4 python-pil - 5.1.0-1ubuntu0.4 python-pil.imagetk - 5.1.0-1ubuntu0.4 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4697-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4697-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2021-01-18"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:469710000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
