{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:59491000000",
	"version": "1",
	"metadata": {
		"title": "USN-5949-1 -- Chromium vulnerabilities",
		"description": "It was discovered that Chromium could be made to write out of bounds in several components. A remote attacker could possibly use this issue to corrupt memory via a crafted HTML page, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2023-0930, CVE-2023-1219, CVE-2023-1220, CVE-2023-1222)  It was discovered that Chromium contained an integer overflow in the PDF component. A remote attacker could possibly use this issue to corrupt memory via a crafted PDF file, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2023-0933)  It was discovered that Chromium did not properly manage memory in several components. A remote attacker could possibly use this issue to corrupt memory via a crafted HTML page, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2023-0941, CVE-2023-0928, CVE-2023-0929, CVE-2023-0931, CVE-2023-1213, CVE-2023-1216, CVE-2023-1218)  It was discovered that Chromium did not correctly distinguish data types in several components. A remote attacker could possibly use this issue to corrupt memory via a crafted HTML page, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2023-1214, CVE-2023-1215, CVE-2023-1235)  It was discovered that Chromium insufficiently enforced policies. An attacker could possibly use this issue to bypass navigation restrictions. (CVE-2023-1221, CVE-2023-1224)  It was discovered that Chromium insufficiently enforced policies in Web Payments API. A remote attacker could possibly use this issue to bypass content security policy via a crafted HTML page. (CVE-2023-1226)  It was discovered that Chromium contained an inappropriate implementation in the Permission prompts component. A remote attacker could possibly use this issue to bypass navigation restrictions via a crafted HTML page. (CVE-2023-1229)  It was discovered that Chromium insufficiently enforced policies in Resource Timing component. A remote attacker could possibly use this issue to obtain sensitive information. (CVE-2023-1232, CVE-2023-1233)  It was discovered that Chromium contained an inappropriate implementation in the Internals component. A remote attacker could possibly use this issue to spoof the origin of an iframe via a crafted HTML page. (CVE-2023-1236)  Update Instructions:  Run `sudo pro fix USN-5949-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  chromium-chromedriver - 111.0.5563.64-0ubuntu0.18.04.5 chromium-browser-l10n - 111.0.5563.64-0ubuntu0.18.04.5 chromium-codecs-ffmpeg-extra - 111.0.5563.64-0ubuntu0.18.04.5 chromium-codecs-ffmpeg - 111.0.5563.64-0ubuntu0.18.04.5 chromium-browser - 111.0.5563.64-0ubuntu0.18.04.5 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5949-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5949-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2023-03-13"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:594910000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
