{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:56131000000",
	"version": "1",
	"metadata": {
		"title": "USN-5613-1 -- Vim vulnerabilities",
		"description": "It was discovered that Vim was not properly performing bounds checks when executing spell suggestion commands. An attacker could possibly use this issue to cause a denial of service or execute arbitrary code. (CVE-2022-0943)  It was discovered that Vim was using freed memory when dealing with regular expressions through its old regular expression engine. If a user were tricked into opening a specially crafted file, an attacker could crash the application, leading to a denial of service, or possibly achieve code execution. (CVE-2022-1154)  It was discovered that Vim was not properly performing checks on name of lambda functions. An attacker could possibly use this issue to cause a denial of service. This issue affected only Ubuntu 22.04 LTS. (CVE-2022-1420)  It was discovered that Vim was incorrectly performing bounds checks when processing invalid commands with composing characters in Ex mode. An attacker could possibly use this issue to cause a denial of service or execute arbitrary code. (CVE-2022-1616)  It was discovered that Vim was not properly processing latin1 data when issuing Ex commands. An attacker could possibly use this issue to cause a denial of service or execute arbitrary code. (CVE-2022-1619)  It was discovered that Vim was not properly performing memory management when dealing with invalid regular expression patterns in buffers. An attacker could possibly use this issue to cause a denial of service. (CVE-2022-1620)  It was discovered that Vim was not properly processing invalid bytes when performing spell check operations. An attacker could possibly use this issue to cause a denial of service or execute arbitrary code. (CVE-2022-1621)  Update Instructions:  Run `sudo pro fix USN-5613-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  vim-common - 2:8.0.1453-1ubuntu1.9 vim-gnome - 2:8.0.1453-1ubuntu1.9 vim-athena - 2:8.0.1453-1ubuntu1.9 xxd - 2:8.0.1453-1ubuntu1.9 vim-gtk - 2:8.0.1453-1ubuntu1.9 vim-gui-common - 2:8.0.1453-1ubuntu1.9 vim - 2:8.0.1453-1ubuntu1.9 vim-doc - 2:8.0.1453-1ubuntu1.9 vim-tiny - 2:8.0.1453-1ubuntu1.9 vim-runtime - 2:8.0.1453-1ubuntu1.9 vim-gtk3 - 2:8.0.1453-1ubuntu1.9 vim-nox - 2:8.0.1453-1ubuntu1.9 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5613-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5613-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-09-15"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:561310000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
