{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:41711000000",
	"version": "1",
	"metadata": {
		"title": "USN-4171-1 -- Apport vulnerabilities",
		"description": "Kevin Backhouse discovered Apport would read its user-controlled settings file as the root user. This could be used by a local attacker to possibly crash Apport or have other unspecified consequences. (CVE-2019-11481)  Sander Bos discovered a race-condition in Apport during core dump creation. This could be used by a local attacker to generate a crash report for a privileged process that is readable by an unprivileged user. (CVE-2019-11482)  Sander Bos discovered Apport mishandled crash dumps originating from containers. This could be used by a local attacker to generate a crash report for a privileged process that is readable by an unprivileged user. (CVE-2019-11483)  Sander Bos discovered Apport mishandled lock-file creation. This could be used by a local attacker to cause a denial of service against Apport. (CVE-2019-11485)  Kevin Backhouse discovered Apport read various process-specific files with elevated privileges during crash dump generation. This could could be used by a local attacker to generate a crash report for a privileged process that is readable by an unprivileged user. (CVE-2019-15790)  Update Instructions:  Run `sudo pro fix USN-4171-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  apport - 2.20.9-0ubuntu7.8 python3-problem-report - 2.20.9-0ubuntu7.8 apport-kde - 2.20.9-0ubuntu7.8 apport-retrace - 2.20.9-0ubuntu7.8 apport-valgrind - 2.20.9-0ubuntu7.8 python3-apport - 2.20.9-0ubuntu7.8 dh-apport - 2.20.9-0ubuntu7.8 apport-gtk - 2.20.9-0ubuntu7.8 python-apport - 2.20.9-0ubuntu7.8 python-problem-report - 2.20.9-0ubuntu7.8 apport-noui - 2.20.9-0ubuntu7.8 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4171-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4171-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2019-10-30"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:417110000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
