{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:52921000000",
	"version": "1",
	"metadata": {
		"title": "USN-5292-1 -- snapd vulnerabilities",
		"description": "James Troup discovered that snap did not properly manage the permissions for the snap directories. A local attacker could possibly use this issue to expose sensitive information. (CVE-2021-3155)  Ian Johnson discovered that snapd did not properly validate content interfaces and layout paths. A local attacker could possibly use this issue to inject arbitrary AppArmor policy rules, resulting in a bypass of intended access restrictions. (CVE-2021-4120)  The Qualys Research Team discovered that snapd did not properly validate the location of the snap-confine binary. A local attacker could possibly use this issue to execute other arbitrary binaries and escalate privileges. (CVE-2021-44730)  The Qualys Research Team discovered that a race condition existed in the snapd snap-confine binary when preparing a private mount namespace for a snap. A local attacker could possibly use this issue to escalate privileges and execute arbitrary code. (CVE-2021-44731)  Update Instructions:  Run `sudo pro fix USN-5292-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  ubuntu-core-snapd-units - 2.54.3+18.04 ubuntu-core-launcher - 2.54.3+18.04 snap-confine - 2.54.3+18.04 ubuntu-snappy-cli - 2.54.3+18.04 golang-github-snapcore-snapd-dev - 2.54.3+18.04 snapd-xdg-open - 2.54.3+18.04 snapd - 2.54.3+18.04 golang-github-ubuntu-core-snappy-dev - 2.54.3+18.04 ubuntu-snappy - 2.54.3+18.04 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5292-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-5292-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-02-17"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:529210000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
