{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:44831000000",
	"version": "1",
	"metadata": {
		"title": "USN-4483-1 -- Linux kernel vulnerabilities",
		"description": "Chuhong Yuan discovered that go7007 USB audio device driver in the Linux kernel did not properly deallocate memory in some failure conditions. A physically proximate attacker could use this to cause a denial of service (memory exhaustion). (CVE-2019-20810)  Fan Yang discovered that the mremap implementation in the Linux kernel did not properly handle DAX Huge Pages. A local attacker with access to DAX storage could use this to gain administrative privileges. (CVE-2020-10757)  It was discovered that the Linux kernel did not correctly apply Speculative Store Bypass Disable (SSBD) mitigations in certain situations. A local attacker could possibly use this to expose sensitive information. (CVE-2020-10766)  It was discovered that the Linux kernel did not correctly apply Indirect Branch Predictor Barrier (IBPB) mitigations in certain situations. A local attacker could possibly use this to expose sensitive information. (CVE-2020-10767)  It was discovered that the Linux kernel could incorrectly enable Indirect Branch Speculation after it has been disabled for a process via a prctl() call. A local attacker could possibly use this to expose sensitive information. (CVE-2020-10768)  Luca Bruno discovered that the zram module in the Linux kernel did not properly restrict unprivileged users from accessing the hot_add sysfs file. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2020-10781)  It was discovered that the XFS file system implementation in the Linux kernel did not properly validate meta data in some circumstances. An attacker could use this to construct a malicious XFS image that, when mounted, could cause a denial of service. (CVE-2020-12655)  It was discovered that the bcache subsystem in the Linux kernel did not properly release a lock in some error conditions. A local attacker could possibly use this to cause a denial of service. (CVE-2020-12771)  It was discovered that the Virtual Terminal keyboard driver in the Linux kernel contained an integer overflow. A local attacker could possibly use this to have an unspecified impact. (CVE-2020-13974)  It was discovered that the cgroup v2 subsystem in the Linux kernel did not properly perform reference counting in some situations, leading to a NULL pointer dereference. A local attacker could use this to cause a denial of service or possibly gain administrative privileges. (CVE-2020-14356)  Kyungtae Kim discovered that the USB testing driver in the Linux kernel did not properly deallocate memory on disconnect events. A physically proximate attacker could use this to cause a denial of service (memory exhaustion). (CVE-2020-15393)  It was discovered that the NFS server implementation in the Linux kernel did not properly honor umask settings when setting permissions while creating file system objects if the underlying file system did not support ACLs. An attacker could possibly use this to expose sensitive information or violate system integrity. (CVE-2020-24394)  It was discovered that the Kerberos SUNRPC GSS implementation in the Linux kernel did not properly deallocate memory on module unload. A local privileged attacker could possibly use this to cause a denial of service (memory exhaustion). (CVE-2020-12656)  Update Instructions:  Run `sudo pro fix USN-4483-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-5.4.0-1016-raspi - 5.4.0-1016.17~18.04.1 No subscription required  linux-image-5.4.0-1022-oracle - 5.4.0-1022.22~18.04.1 linux-image-5.4.0-1022-gcp - 5.4.0-1022.22~18.04.1 linux-image-5.4.0-1022-aws - 5.4.0-1022.22~18.04.1 No subscription required  linux-image-5.4.0-1023-azure - 5.4.0-1023.23~18.04.1 No subscription required  linux-image-5.4.0-45-generic - 5.4.0-45.49~18.04.2 linux-image-5.4.0-45-lowlatency - 5.4.0-45.49~18.04.2 linux-image-5.4.0-45-generic-lpae - 5.4.0-45.49~18.04.2 No subscription required  linux-image-raspi-hwe-18.04-edge - 5.4.0.1016.20 linux-image-raspi-hwe-18.04 - 5.4.0.1016.20 No subscription required  linux-image-oracle - 5.4.0.1022.7 linux-image-oracle-edge - 5.4.0.1022.7 No subscription required  linux-image-aws-edge - 5.4.0.1022.8 No subscription required  linux-image-gke-5.4 - 5.4.0.1022.9 linux-image-gcp-edge - 5.4.0.1022.9 linux-image-gcp - 5.4.0.1022.9 No subscription required  linux-image-azure - 5.4.0.1023.7 linux-image-azure-edge - 5.4.0.1023.7 No subscription required  linux-image-gkeop-5.4 - 5.4.0.45.49~18.04.38 linux-image-generic-hwe-18.04 - 5.4.0.45.49~18.04.38 linux-image-snapdragon-hwe-18.04 - 5.4.0.45.49~18.04.38 linux-image-generic-lpae-hwe-18.04 - 5.4.0.45.49~18.04.38 linux-image-generic-lpae-hwe-18.04-edge - 5.4.0.45.49~18.04.38 linux-image-snapdragon-hwe-18.04-edge - 5.4.0.45.49~18.04.38 linux-image-lowlatency-hwe-18.04 - 5.4.0.45.49~18.04.38 linux-image-virtual-hwe-18.04 - 5.4.0.45.49~18.04.38 linux-image-lowlatency-hwe-18.04-edge - 5.4.0.45.49~18.04.38 linux-image-generic-hwe-18.04-edge - 5.4.0.45.49~18.04.38 linux-image-virtual-hwe-18.04-edge - 5.4.0.45.49~18.04.38 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4483-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4483-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-09-03"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:448310000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:448310000010",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:448310000020",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:448310000030",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
