{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:45921000000",
	"version": "1",
	"metadata": {
		"title": "USN-4592-1 -- Linux kernel vulnerabilities",
		"description": "Andy Nguyen discovered that the Bluetooth L2CAP implementation in the Linux kernel contained a type-confusion error. A physically proximate remote attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2020-12351)  Andy Nguyen discovered that the Bluetooth A2MP implementation in the Linux kernel did not properly initialize memory in some situations. A physically proximate remote attacker could use this to expose sensitive information (kernel memory). (CVE-2020-12352)  Andy Nguyen discovered that the Bluetooth HCI event packet parser in the Linux kernel did not properly handle event advertisements of certain sizes, leading to a heap-based buffer overflow. A physically proximate remote attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2020-24490)  Update Instructions:  Run `sudo pro fix USN-4592-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-5.0.0-1070-oem-osp1 - 5.0.0-1070.76 No subscription required  linux-image-oem-osp1 - 5.0.0.1070.68 No subscription required  linux-image-5.3.0-1036-raspi2 - 5.3.0-1036.38 No subscription required  linux-image-raspi2-hwe-18.04 - 5.3.0.1036.25 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4592-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4592-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-10-20"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:459210000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:459210000010",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
