{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:43761000000",
	"version": "1",
	"metadata": {
		"title": "USN-4376-1 -- OpenSSL vulnerabilities",
		"description": "Cesar Pereida García, Sohaib ul Hassan, Nicola Tuveri, Iaroslav Gridin, Alejandro Cabrera Aldaya, and Billy Brumley discovered that OpenSSL incorrectly handled ECDSA signatures. An attacker could possibly use this issue to perform a timing side-channel attack and recover private ECDSA keys. (CVE-2019-1547)  Matt Caswell discovered that OpenSSL incorrectly handled the random number generator (RNG). This may result in applications that use the fork() system call sharing the same RNG state between the parent and the child, contrary to expectations. This issue only affected Ubuntu 18.04 LTS and Ubuntu 19.10. (CVE-2019-1549)  Guido Vranken discovered that OpenSSL incorrectly performed the x86_64 Montgomery squaring procedure. While unlikely, a remote attacker could possibly use this issue to recover private keys. (CVE-2019-1551)  Bernd Edlinger discovered that OpenSSL incorrectly handled certain decryption functions. In certain scenarios, a remote attacker could possibly use this issue to perform a padding oracle attack and decrypt traffic. (CVE-2019-1563)  Update Instructions:  Run `sudo pro fix USN-4376-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  libcrypto1.1-udeb - 1.1.1-1ubuntu2.1~18.04.6 libssl-dev - 1.1.1-1ubuntu2.1~18.04.6 openssl - 1.1.1-1ubuntu2.1~18.04.6 libssl-doc - 1.1.1-1ubuntu2.1~18.04.6 libssl1.1-udeb - 1.1.1-1ubuntu2.1~18.04.6 libssl1.1 - 1.1.1-1ubuntu2.1~18.04.6 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4376-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4376-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2020-05-28"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:437610000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
