{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:40931000000",
	"version": "1",
	"metadata": {
		"title": "USN-4093-1 -- Linux kernel vulnerabilities",
		"description": "It was discovered that a heap buffer overflow existed in the Marvell Wireless LAN device driver for the Linux kernel. An attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-10126)  Andrei Vlad Lutas and Dan Lutas discovered that some x86 processors incorrectly handle SWAPGS instructions during speculative execution. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2019-1125)  It was discovered that the PowerPC dlpar implementation in the Linux kernel did not properly check for allocation errors in some situations. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2019-12614)  It was discovered that a NULL pointer dereference vulnerability existed in the Near-field communication (NFC) implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash). (CVE-2019-12984)  Jann Horn discovered a use-after-free vulnerability in the Linux kernel when accessing LDT entries in some situations. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-13233)  Jann Horn discovered that the ptrace implementation in the Linux kernel did not properly record credentials in some situations. A local attacker could use this to cause a denial of service (system crash) or possibly gain administrative privileges. (CVE-2019-13272)  It was discovered that the Marvell Wireless LAN device driver in the Linux kernel did not properly validate the BSS descriptor. A local attacker could possibly use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-3846)  Update Instructions:  Run `sudo pro fix USN-4093-1` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  linux-image-5.0.0-1014-azure - 5.0.0-1014.14~18.04.1 No subscription required  linux-image-5.0.0-25-lowlatency - 5.0.0-25.26~18.04.1 linux-image-5.0.0-25-generic-lpae - 5.0.0-25.26~18.04.1 linux-image-5.0.0-25-generic - 5.0.0-25.26~18.04.1 No subscription required  linux-image-azure - 5.0.0.1014.25 No subscription required  linux-image-snapdragon-hwe-18.04 - 5.0.0.25.82 linux-image-virtual-hwe-18.04 - 5.0.0.25.82 linux-image-generic-lpae-hwe-18.04 - 5.0.0.25.82 linux-image-lowlatency-hwe-18.04 - 5.0.0.25.82 linux-image-generic-hwe-18.04 - 5.0.0.25.82 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-4093-1",
				"ref_url": "https://ubuntu.com/security/notices/USN-4093-1"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2019-08-13"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:409310000000",
						"comment": "Long Term Support"
					},
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:409310000010",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
