{
	"class": "patch",
	"id": "oval:com.ubuntu.bionic:def:52273000000",
	"version": "1",
	"metadata": {
		"title": "USN-5227-3 -- Pillow vulnerability",
		"description": "USN-5227-1 fixed vulnerabilities in Pillow. It was discovered that the fix for CVE-2022-22817 was incomplete. This update fixes the problem.  Original advisory details:   It was discovered that Pillow incorrectly handled certain image files. If a  user or automated system were tricked into opening a specially-crafted  file, a remote attacker could cause Pillow to hang, resulting in a denial  of service. (CVE-2021-23437)    It was discovered that Pillow incorrectly handled certain image files. If a  user or automated system were tricked into opening a specially-crafted  file, a remote attacker could cause Pillow to crash, resulting in a denial  of service. This issue ony affected Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, and  Ubuntu 21.04. (CVE-2021-34552)    It was discovered that Pillow incorrectly handled certain image files. If a  user or automated system were tricked into opening a specially-crafted  file, a remote attacker could cause Pillow to crash, resulting in a denial  of service, or possibly execute arbitrary code. (CVE-2022-22815)    It was discovered that Pillow incorrectly handled certain image files. If a  user or automated system were tricked into opening a specially-crafted  file, a remote attacker could cause Pillow to crash, resulting in a denial  of service. (CVE-2022-22816)    It was discovered that Pillow incorrectly handled certain image files. If a  user or automated system were tricked into opening a specially-crafted  file, a remote attacker could cause Pillow to crash, resulting in a denial  of service, or possibly execute arbitrary code. (CVE-2022-22817)  Update Instructions:  Run `sudo pro fix USN-5227-3` to fix the vulnerability. The problem can be corrected by updating your system to the following package versions:  python3-pil.imagetk - 5.1.0-1ubuntu0.8 python-pil-doc - 5.1.0-1ubuntu0.8 python3-pil - 5.1.0-1ubuntu0.8 python-pil - 5.1.0-1ubuntu0.8 python-pil.imagetk - 5.1.0-1ubuntu0.8 No subscription required",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 18.04 LTS"
		},
		"reference": [
			{
				"source": "USN",
				"ref_id": "USN-5227-3",
				"ref_url": "https://ubuntu.com/security/notices/USN-5227-3"
			}
		],
		"advisory": {
			"from": "security@ubuntu.com",
			"severity": "None",
			"issued": {
				"date": "2022-10-24"
			}
		}
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.bionic:tst:522730000000",
						"comment": "Long Term Support"
					}
				]
			}
		]
	}
}
