{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:202140440000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-4044 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "Internally libssl in OpenSSL calls X509_verify_cert() on the client side toverify a certificate supplied by a server. That function may return anegative return value to indicate an internal error (for example out ofmemory). Such a negative return value is mishandled by OpenSSL and willcause an IO function (such as SSL_connect() or SSL_do_handshake()) to notindicate success and a subsequent call to SSL_get_error() to return thevalue SSL_ERROR_WANT_RETRY_VERIFY. This return value is only supposed to bereturned by OpenSSL if the application has previously calledSSL_CTX_set_cert_verify_callback(). Since most applications do not do thisthe SSL_ERROR_WANT_RETRY_VERIFY return value from SSL_get_error() will betotally unexpected and applications may not behave correctly as a result.The exact behaviour will depend on the application but it could result incrashes, infinite loops or other similar incorrect responses. This issue ismade more serious in combination with a separate bug in OpenSSL 3.0 thatwill cause X509_verify_cert() to indicate an internal error when processinga certificate chain. This will occur where a certificate does not includethe Subject Alternative Name extension but where a Certificate Authorityhas enforced name constraints. This issue can occur even with valid chains.By combining the two issues an attacker could induce incorrect, applicationdependent behaviour. Fixed in OpenSSL 3.0.1 (Affected 3.0.0).",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-4044",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-4044"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-12-14 19:15:00 UTC",
			"cve": {
				"text": "CVE-2021-4044",
				"href": "https://ubuntu.com/security/CVE-2021-4044",
				"public": "20211214",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201915470000000",
						"comment": "openssl: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201620860000000",
						"comment": "nodejs: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201757310000000",
						"comment": "edk2: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
