{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2023260540000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-26054 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "BuildKit is a toolkit for converting source code to build artifacts in anefficient, expressive and repeatable manner. In affected versions when theuser sends a build request that contains a Git URL that containscredentials and the build creates a provenance attestation describing thatbuild, these credentials could be visible from the provenance attestation.Git URL can be passed in two ways: 1) Invoking build directly from a URLwith credentials. 2) If the client sends additional version control system(VCS) info hint parameters on builds from a local source. Usually, thatwould mean reading the origin URL from `.git/config` file. When a build isperformed under specific conditions where credentials were passed toBuildKit they may be visible to everyone who has access to provenanceattestation. Provenance attestations and VCS info hints were added inversion v0.11.0. Previous versions are not vulnerable. In v0.10, whenbuilding directly from Git URL, the same URL could be visible in`BuildInfo` structure that is a predecessor of Provenance attestations.Previous versions are not vulnerable. This bug has been fixed in v0.11.4.Users are advised to upgrade. Users unable to upgrade may disable VCS infohints by setting `BUILDX_GIT_INFO=0`. `buildctl` does not set VCS hintsbased on `.git` directory, and values would need to be passed manually with`--opt`.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-26054",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26054"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-03-06 19:15:00 UTC",
			"cve": {
				"text": "CVE-2023-26054",
				"href": "https://ubuntu.com/security/CVE-2023-26054",
				"public": "20230306",
				"cvss_score": "6.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201452780000000",
						"comment": "docker.io: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
