{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:201930160000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2019-3016 on Ubuntu 14.04 LTS (trusty) - medium.",
		"Description": "In a Linux KVM guest that has PV TLB enabled, a process in the guest kernel may be able to read memory locations from another process in the same guest. This problem is limit to the host running linux kernel 4.10 with a guest running linux kernel 4.16 or later. The problem mainly affects AMD processors but Intel CPUs cannot be ruled out. It was discovered that the KVM implementation in the Linux kernel, when paravirtual TLB flushes are enabled in guests, the hypervisor in some situations could miss deferred TLB flushes or otherwise mishandle them. An attacker in a guest VM could use this to expose sensitive information (read memory from another guest VM).",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2019-3016",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-3016"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2020 Canonical Ltd.",
			"PublicDate": "2020-01-30 18:00:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2019-3016",
				"href": "https://ubuntu.com/security/CVE-2019-3016",
				"public": "20200130",
				"cvss_score": "4.7",
				"cvss_vector": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:N/A:N",
				"usns": "4300-1,4301-1"
			},
			"PublicDateAtUsn": "2020-01-30 18:00:00 UTC",
			"AssignedTo": "cascardo",
			"DiscoveredBy": "",
			"Crd": "2020-01-30 18:00:00 UTC",
			"Ref": null
		}
	},
	"notes": {
		"Note": "tyhicks> This issue does not affect default installations of Ubuntu as the paravirtual TLB flush feature in KVM is not enabled by default. The QEMU CPU feature \"kvm-pv-tlb-flush\" is used to enable paravirtual TLB flush. cascardo> It is thought that issue does not affect Intel processors *not* supporting Process-Context Identifiers (PCIDs). You can check support for PCIDs on systems with Intel processors by running \"grep pcid /proc/cpuinfo\" and verifying that \"pcid\" shows as one of the flags. it was mentioned that it was only easily reproducible on AMD CPUs."
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201245420000000",
						"comment": "linux: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201245420000010",
						"comment": "linux-aws: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201245420000020",
						"comment": "linux-azure: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201245420000090",
						"comment": "linux-lts-xenial: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201245420000130",
						"comment": "linux-signed: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201245420000140",
						"comment": "linux-signed-azure: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201245420000150",
						"comment": "linux-signed-lts-xenial: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
