{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2021286870000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-28687 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "HVM soft-reset crashes toolstack libxl requires all data structures passedacross its public interface to be initialized before use and disposed ofafterwards by calling a specific set of functions. Many internal datastructures also require this initialize / dispose discipline, but not allof them. When the \"soft reset\" feature was implemented, thelibxl__domain_suspend_state structure didn't require any initialization ordisposal. At some point later, an initialization function was introducedfor the structure; but the \"soft reset\" path wasn't refactored to call theinitialization function. When a guest nwo initiates a \"soft reboot\",uninitialized data structure leads to an assert() when later code finds thestructure in an unexpected state. The effect of this is to crash theprocess monitoring the guest. How this affects the system depends on thestructure of the toolstack. For xl, this will have no security-relevanteffect: every VM has its own independent monitoring process, which containsno state. The domain in question will hang in a crashed state, but can bedestroyed by `xl destroy` just like any other non-cooperating domain. Fordaemon-based toolstacks linked against libxl, such as libvirt, this willcrash the toolstack, losing the state of any in-progress operations(localized DoS), and preventing further administrator operations unless thedaemon is configured to restart automatically (system-wide DoS). If crashes\"leak\" resources, then repeated crashes could use up resources, alsocausing a system-wide DoS.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-28687",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-28687"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-06-11 15:15:00 UTC",
			"cve": {
				"text": "CVE-2021-28687",
				"href": "https://ubuntu.com/security/CVE-2021-28687",
				"public": "20210611",
				"cvss_score": "5.5",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:2017155880000000",
						"comment": "xen: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
