{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:201964750000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2019-6475 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "Mirror zones are a BIND feature allowing recursive servers to pre-cachezone data provided by other servers. A mirror zone is similar to a zone oftype secondary, except that its data is subject to DNSSEC validation beforebeing used in answers, as if it had been looked up via traditionalrecursion, and when mirror zone data cannot be validated, BIND falls backto using traditional recursion instead of the mirror zone. However, anerror in the validity checks for the incoming zone data can allow anon-path attacker to replace zone data that was validated with a configuredtrust anchor with forged data of the attacker's choosing. The mirror zonefeature is most often used to serve a local copy of the root zone. If anattacker was able to insert themselves into the network path between arecursive server using a mirror zone and a root name server, thisvulnerability could then be used to cause the recursive server to accept acopy of falsified root zone data. This affects BIND versions 9.14.0 up to9.14.6, and 9.15.0 up to 9.15.4.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2019-6475",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-6475"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2019 Canonical Ltd.",
			"public_date": "2019-10-16",
			"cve": {
				"text": "CVE-2019-6475",
				"href": "https://ubuntu.com/security/CVE-2019-6475",
				"public": "20191016",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201627750000000",
						"comment": "bind9: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
