{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2020367870000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2020-36787 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: media:aspeed: fix clock handling logic Video engine uses eclk and vclk for itsclock sources and its reset control is coupled with eclk so the currentclock enabling sequence works like below. Enable eclk De-assert VideoEngine reset 10ms delay Enable vclk It introduces improper reset on theVideo Engine hardware and eventually the hardware generates unexpected DMAmemory transfers that can corrupt memory region in random and sporadicpatterns. This issue is observed very rarely on some specific AST2500 SoCsbut it causes a critical kernel panic with making a various shape ofsignature so it's extremely hard to debug. Moreover, the issue is observedeven when the video engine is not actively used because udevd turns on thevideo engine hardware for a short time to make a query in every boot. Tofix this issue, this commit changes the clock handling logic to make thereset de-assertion triggered after enabling both eclk and vclk. Also, itadds clk_unprepare call for a case when probe fails. clk: ast2600: fixreset settings for eclk and vclk Video engine reset setting should becoupled with eclk to match it with the setting for previous Aspeed SoCswhich is defined in clk-aspeed.c since all Aspeed SoCs are sharing a singlevideo engine driver. Also, reset bit 6 is defined as 'Video Engine' resetin datasheet so it should be de-asserted when eclk is enabled. This commitfixes the setting.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-36787",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-36787"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-02-28 09:15:00 UTC",
			"cve": {
				"text": "CVE-2020-36787",
				"href": "https://ubuntu.com/security/CVE-2020-36787",
				"public": "20240228"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000000",
						"comment": "linux package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000010",
						"comment": "linux-lts-xenial package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000020",
						"comment": "linux-aws package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000030",
						"comment": "linux-azure package in trusty is affected and may need fixing."
					}
				]
			}
		]
	}
}
