{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2023351690000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-35169 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "PHP-IMAP is a wrapper for common IMAP communication without the need tohave the php-imap module installed / enabled. Prior to version 5.3.0, anunsanitized attachment filename allows any unauthenticated user to leveragea directory traversal vulnerability, which results in a remote codeexecution vulnerability. Every application that stores attachments with`Attachment::save()` without providing a `$filename` or passing unsanitizeduser input is affected by this attack. An attacker can send an email with amalicious attachment to the inbox, which gets crawled with`webklex/php-imap` or `webklex/laravel-imap`. Prerequisite for thevulnerability is that the script stores the attachments without providing a`$filename`, or providing an unsanitized `$filename`, in`src/Attachment::save(string $path, string $filename = null)`. In thiscase, where no `$filename` gets passed into the `Attachment::save()`method, the package would use a series of unsanitized and insecure inputvalues from the mail as fallback. Even if a developer passes a `$filename`into the `Attachment::save()` method, e.g. by passing the name or filenameof the mail attachment itself (from email headers), the input values neverget sanitized by the package. There is also no restriction about the fileextension (e.g. \".php\") or the contents of a file. This allows an attackerto upload malicious code of any type and content at any location where theunderlying user has write permissions. The attacker can also overwriteexisting files and inject malicious code into files that, e.g. get executedby the system via cron or requests. Version 5.3.0 contains a patch for thisissue.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-35169",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-35169"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-06-23 21:15:00 UTC",
			"cve": {
				"text": "CVE-2023-35169",
				"href": "https://ubuntu.com/security/CVE-2023-35169",
				"public": "20230623",
				"cvss_score": "9.8",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:2023351690000000",
						"comment": "php-imap package in trusty is affected and may need fixing."
					}
				]
			}
		]
	}
}
