{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:201929330000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2019-2933 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "Vulnerability in the Java SE, Java SE Embedded product of Oracle Java SE(component: Libraries). Supported versions that are affected are Java SE:7u231, 8u221, 11.0.4 and 13; Java SE Embedded: 8u221. Difficult to exploitvulnerability allows unauthenticated attacker with network access viamultiple protocols to compromise Java SE, Java SE Embedded. Successfulattacks require human interaction from a person other than the attacker.Successful attacks of this vulnerability can result in unauthorized readaccess to a subset of Java SE, Java SE Embedded accessible data. Note: Thisvulnerability applies to Java deployments, typically in clients runningsandboxed Java Web Start applications or sandboxed Java applets (in Java SE8), that load and run untrusted code (e.g., code that comes from theinternet) and rely on the Java sandbox for security. This vulnerability canalso be exploited by using APIs in the specified Component, e.g., through aweb service which supplies data to the APIs. CVSS 3.0 Base Score 3.1(Confidentiality impacts). CVSS Vector:(CVSS:3.0/AV:N/AC:H/PR:N/UI:R/S:U/C:L/I:N/A:N).",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2019-2933",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2019-2933"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2019 Canonical Ltd.",
			"public_date": "2019-10-16 18:15:00 UTC",
			"cve": {
				"text": "CVE-2019-2933",
				"href": "https://ubuntu.com/security/CVE-2019-2933",
				"public": "20191016",
				"cvss_score": "3.1",
				"cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:R/S:U/C:L/I:N/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201366290000000",
						"comment": "openjdk-7: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
