{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2020255980000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2020-25598 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "An issue was discovered in Xen 4.14.x. There is a missing unlock in theXENMEM_acquire_resource error path. The RCU (Read, Copy, Update) mechanismis a synchronisation primitive. A buggy error path in theXENMEM_acquire_resource exits without releasing an RCU reference, which isconceptually similar to forgetting to unlock a spinlock. A buggy ormalicious HVM stubdomain can cause an RCU reference to be leaked. Thiscauses subsequent administration operations, (e.g., CPU offline) tolivelock, resulting in a host Denial of Service. The buggy codepath hasbeen present since Xen 4.12. Xen 4.14 and later are vulnerable to the DoS.The side effects are believed to be benign on Xen 4.12 and 4.13, butpatches are provided nevertheless. The vulnerability can generally only beexploited by x86 HVM VMs, as these are generally the only type of VM thathave a Qemu stubdomain. x86 PV and PVH domains, as well as ARM VMs,typically don't use a stubdomain. Only VMs using HVM stubdomains canexploit the vulnerability. VMs using PV stubdomains, or with emulatorsrunning in dom0, cannot exploit the vulnerability.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-25598",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2020-25598"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2020 Canonical Ltd.",
			"public_date": "2020-09-23 22:15:00 UTC",
			"cve": {
				"text": "CVE-2020-25598",
				"href": "https://ubuntu.com/security/CVE-2020-25598",
				"public": "20200923",
				"cvss_score": "5.5",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:2017155880000000",
						"comment": "xen: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
