{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.trusty:def:201737380000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2017-3738 on Ubuntu 14.04 LTS (trusty) - low.",
    "Description": "There is an overflow bug in the AVX2 Montgomery multiplication procedure used in exponentiation with 1024-bit moduli. No EC algorithms are affected. Analysis suggests that attacks against RSA and DSA as a result of this defect would be very difficult to perform and are not believed likely. Attacks against DH1024 are considered just feasible, because most of the work necessary to deduce information about a private key may be performed offline. The amount of resources required for such an attack would be significant. However, for an attack on TLS to be meaningful, the server would have to share the DH1024 private key among multiple clients, which is no longer an option since CVE-2016-0701. This only affects processors that support the AVX2 but not ADX extensions like Intel Haswell (4th generation). Note: The impact from this issue is similar to CVE-2017-3736, CVE-2017-3732 and CVE-2015-3193. OpenSSL version 1.0.2-1.0.2m and 1.1.0-1.1.0g are affected. Fixed in OpenSSL 1.0.2n. Due to the low severity of this issue we are not issuing a new release of OpenSSL 1.1.0 at this time. The fix will be included in OpenSSL 1.1.0h when it becomes available. The fix is also available in commit e502cc86d in the OpenSSL git repository.",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 14.04 LTS"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2017-3738",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-3738"
    },
    "advisory": {
      "Severity": "Low",
      "Rights": "Copyright (C) 2017 Canonical Ltd.",
      "PublicDate": "2017-12-07",
      "Bug": null,
      "cve": {
        "text": "CVE-2017-3738",
        "href": "https://ubuntu.com/security/CVE-2017-3738",
        "public": "20171207",
        "cvss_score": "5.9",
        "cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N",
        "usns": "3512-1"
      },
      "PublicDateAtUsn": "2017-12-07",
      "AssignedTo": "mdeslaur",
      "DiscoveredBy": "David Benjamin",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": "leosilva> \"This only affects processors that support the AVX2 but not ADX extensions like Intel Haswell (4th generation).\""
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.trusty:tst:201435660000040",
        "comment": "openssl098: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
      }
    ]
  }
}
