{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2023248140000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-24814 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "TYPO3 is a free and open source Content Management Framework released underthe GNU General Public License. In affected versions the TYPO3 corecomponent `GeneralUtility::getIndpEnv()` uses the unfiltered serverenvironment variable `PATH_INFO`, which allows attackers to injectmalicious content. In combination with the TypoScript setting`config.absRefPrefix=auto`, attackers can inject malicious HTML code topages that have not been rendered and cached, yet. As a result, injectedvalues would be cached and delivered to other website visitors (persistedcross-site scripting). Individual code which relies on the resolved valueof `GeneralUtility::getIndpEnv('SCRIPT_NAME')` and corresponding usages (asshown below) are vulnerable as well. Additional investigations confirmedthat at least Apache web server deployments using CGI (FPM, FCGI/FastCGI,and similar) are affected. However, there still might be the risk thatother scenarios like nginx, IIS, or Apache/mod_php are vulnerable. Theusage of server environment variable `PATH_INFO` has been removed fromcorresponding processings in `GeneralUtility::getIndpEnv()`. Besides that,the public property `TypoScriptFrontendController::$absRefPrefix` isencoded for both being used as a URI component and for being used as aprefix in an HTML context. This mitigates the cross-site scriptingvulnerability. Users are advised to update to TYPO3 versions 8.7.51 ELTS,9.5.40 ELTS, 10.4.35 LTS, 11.5.23 LTS and 12.2.0 which fix this problem.For users who are unable to patch in a timely manner the TypoScript setting`config.absRefPrefix` should at least be set to a static path value,instead of using auto - e.g. `config.absRefPrefix=/`. This workaround**does not fix all aspects of the vulnerability**, and is just consideredto be an intermediate mitigation to the most prominent manifestation.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-24814",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-24814"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-02-07 19:15:00 UTC",
			"cve": {
				"text": "CVE-2023-24814",
				"href": "https://ubuntu.com/security/CVE-2023-24814",
				"public": "20230207",
				"cvss_score": "6.1",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200948550000000",
						"comment": "typo3-src: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
