{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2024266920000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26692 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:smb: Fix regression in writes when non-standard maximum write sizenegotiatedThe conversion to netfs in the 6.3 kernel caused a regression whenmaximum write size is set by the server to an unexpected value which isnot a multiple of 4096 (similarly if the user overrides the maximumwrite size by setting mount parm \"wsize\", but sets it to a value thatis not a multiple of 4096).  When negotiated write size is not amultiple of 4096 the netfs code can skip the end of the finalpage when doing large sequential writes, causing data corruption.This section of code is being rewritten/removed due to a largenetfs change, but until that point (ie for the 6.3 kernel until now)we can not support non-standard maximum write sizes.Add a warning if a user specifies a wsize on mount that is nota multiple of 4096 (and round down), also add a change where weround down the maximum write size if the server negotiates a valuethat is not a multiple of 4096 (we also have to check to make sure thatwe do not round it down to zero).",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26692",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-26692"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-04-04",
			"cve": {
				"text": "CVE-2024-26692",
				"href": "https://ubuntu.com/security/CVE-2024-26692",
				"public": "20240404"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000000",
						"comment": "linux package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000010",
						"comment": "linux-lts-xenial package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000020",
						"comment": "linux-aws package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000030",
						"comment": "linux-azure package in trusty is affected and may need fixing."
					}
				]
			}
		]
	}
}
