{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2021294290000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-29429 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "In Gradle before version 7.0, files created with open permissions in thesystem temporary directory can allow an attacker to access informationdownloaded by Gradle. Some builds could be vulnerable to a localinformation disclosure. Remote files accessed through TextResourceFactoryare downloaded into the system temporary directory first. Sensitiveinformation contained in these files can be exposed to other local users onthe same system. If you do not use the `TextResourceFactory` API, you arenot vulnerable. As of Gradle 7.0, uses of the system temporary directoryhave been moved to the Gradle User Home directory. By default, thisdirectory is restricted to the user running the build. As a workaround, seta more restrictive umask that removes read access to other users. Whenfiles are created in the system temporary directory, they will not beaccessible to other users. If you are unable to change your system's umask,you can move the Java temporary directory by setting the System Property`java.io.tmpdir`. The new path needs to limit permissions to the build useronly.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-29429",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-29429"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2021 Canonical Ltd.",
			"public_date": "2021-04-12 22:15:00 UTC",
			"cve": {
				"text": "CVE-2021-29429",
				"href": "https://ubuntu.com/security/CVE-2021-29429",
				"public": "20210412",
				"cvss_score": "5.5",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201661990000000",
						"comment": "gradle: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
