{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2024266900000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26690 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: net:stmmac: protect updates of 64-bit statistics counters As explained by acomment in <linux/u64_stats_sync.h>, write side of struct u64_stats_syncmust ensure mutual exclusion, or one seqcount update could be lost on32-bit platforms, thus blocking readers forever. Such lockups have beenobserved in real world after stmmac_xmit() on one CPU raced withstmmac_napi_poll_tx() on another CPU. To fix the issue without introducinga new lock, split the statics into three parts: 1. fields updated onlyunder the tx queue lock, 2. fields updated only during NAPI poll, 3. fieldsupdated only from interrupt context, Updates to fields in the first twogroups are already serialized through other locks. It is sufficient tosplit the existing struct u64_stats_sync so that each group has its own.Note that tx_set_ic_bit is updated from both contexts. Split this counterso that each context gets its own, and calculate their sum to get the totalvalue in stmmac_get_ethtool_stats(). For the third group, multipleinterrupts may be processed by different CPUs at the same time, butinterrupts on the same CPU will not nest. Move fields from this group to anewly created per-cpu struct stmmac_pcpu_stats.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26690",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-26690"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-04-03 15:15:00 UTC",
			"cve": {
				"text": "CVE-2024-26690",
				"href": "https://ubuntu.com/security/CVE-2024-26690",
				"public": "20240403"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000000",
						"comment": "linux package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000010",
						"comment": "linux-lts-xenial package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000020",
						"comment": "linux-aws package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000030",
						"comment": "linux-azure package in trusty is affected and may need fixing."
					}
				]
			}
		]
	}
}
