{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2024266460000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26646 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:thermal: intel: hfi: Add syscore callbacks for system-wide PM The kernelallocates a memory buffer and provides its location to the hardware, whichuses it to update the HFI table. This allocation occurs during boot andremains constant throughout runtime. When resuming from hibernation, therestore kernel allocates a second memory buffer and reprograms the HFIhardware with the new location as part of a normal boot. The location ofthe second memory buffer may differ from the one allocated by the imagekernel. When the restore kernel transfers control to the image kernel, itsHFI buffer becomes invalid, potentially leading to memory corruption if thehardware writes to it (the hardware continues to use the buffer from therestore kernel). It is also possible that the hardware \"forgets\" theaddress of the memory buffer when resuming from \"deep\" suspend. Memorycorruption may also occur in such a scenario. To prevent the describedmemory corruption, disable HFI when preparing to suspend or hibernate.Enable it when resuming. Add syscore callbacks to handle the package of theboot CPU (packages of non-boot CPUs are handled via CPU offline). Syscoreops always run on the boot CPU. Additionally, HFI only needs to be disabledduring \"deep\" suspend and hibernation. Syscore ops only run in these cases.[ rjw: Comment adjustment, subject and changelog edits ]",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26646",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-26646"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-03-26 18:15:00 UTC",
			"cve": {
				"text": "CVE-2024-26646",
				"href": "https://ubuntu.com/security/CVE-2024-26646",
				"public": "20240326"
			},
			"public_date_at_usn": "2024-03-26 18:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-6818-1",
				"https://ubuntu.com/security/notices/USN-6819-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000000",
						"comment": "linux package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000010",
						"comment": "linux-lts-xenial package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000020",
						"comment": "linux-aws package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000030",
						"comment": "linux-azure package in trusty is affected and may need fixing."
					}
				]
			}
		]
	}
}
