{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2022247130000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2022-24713 on Ubuntu 14.04 LTS (trusty) - medium",
		"Description": "regex is an implementation of regular expressions for the Rust language.The regex crate features built-in mitigations to prevent denial of serviceattacks caused by untrusted regexes, or untrusted input matched by trustedregexes. Those (tunable) mitigations already provide sane defaults toprevent attacks. This guarantee is documented and it's considered part ofthe crate's API. Unfortunately a bug was discovered in the mitigationsdesigned to prevent untrusted regexes to take an arbitrary amount of timeduring parsing, and it's possible to craft regexes that bypass suchmitigations. This makes it possible to perform denial of service attacks bysending specially crafted regexes to services accepting user-controlled,untrusted regexes. All versions of the regex crate before or equal to 1.5.4are affected by this issue. The fix is include starting from regex 1.5.5.All users accepting user-controlled regexes are recommended to upgradeimmediately to the latest version of the regex crate. Unfortunately thereis no fixed set of problematic regexes, as there are practically infiniteregexes that could be crafted to exploit this vulnerability. Because ofthis, it us not recommend to deny known problematic regexes.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2022-24713",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-24713"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2022 Canonical Ltd.",
			"PublicDate": "2022-03-08 19:15:00 UTC",
			"Bug": [
				"https://bugs.launchpad.net/ubuntu/+source/rust-regex/+bug/1977694"
			],
			"cve": {
				"text": "CVE-2022-24713",
				"href": "https://ubuntu.com/security/CVE-2022-24713",
				"public": "20220308",
				"cvss_score": "7.5",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
				"usns": "5370-1,5610-1"
			},
			"PublicDateAtUsn": "2022-03-08 19:15:00 UTC",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": [
				"https://ubuntu.com/security/notices/USN-5370-1",
				"https://ubuntu.com/security/notices/USN-5610-1"
			]
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201126680000000",
						"comment": "firefox: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
