{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2024269920000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26992 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: KVM:x86/pmu: Disable support for adaptive PEBS Drop support for virtualizingadaptive PEBS, as KVM's implementation is architecturally broken without anobvious/easy path forward, and because exposing adaptive PEBS can leak hostLBRs to the guest, i.e. can leak host kernel addresses to the guest. Bug #1is that KVM doesn't account for the upper 32 bits of IA32_FIXED_CTR_CTRLwhen (re)programming fixed counters, e.g fixed_ctrl_field() drops the upperbits, reprogram_fixed_counters() stores local variables as u8s andtruncates the upper bits too, etc. Bug #2 is that, because KVM _always_sets precise_ip to a non-zero value for PEBS events, perf will _always_generate an adaptive record, even if the guest requested a basic record.Note, KVM will also enable adaptive PEBS in individual *counter*, even ifadaptive PEBS isn't exposed to the guest, but this is benign asMSR_PEBS_DATA_CFG is guaranteed to be zero, i.e. the guest will only eversee Basic records. Bug #3 is in perf. intel_pmu_disable_fixed() doesn'tclear the upper bits either, i.e. leaves ICL_FIXED_0_ADAPTIVE set, andintel_pmu_enable_fixed() effectively doesn't clear ICL_FIXED_0_ADAPTIVEeither. I.e. perf _always_ enables ADAPTIVE counters, regardless of whatKVM requests. Bug #4 is that adaptive PEBS *might* effectively bypass eventfilters set by the host, as \"Updated Memory Access Info Group\" recordsinformation that might be disallowed by userspace viaKVM_SET_PMU_EVENT_FILTER. Bug #5 is that KVM doesn't ensure LBR MSRs holdguest values (or at least zeros) when entering a vCPU with adaptive PEBS,which allows the guest to read host LBRs, i.e. host RIPs/addresses, byenabling \"LBR Entries\" records. Disable adaptive PEBS support as animmediate fix due to the severity of the LBR leak in particular, andbecause fixing all of the bugs will be non-trivial, e.g. not suitable forbackporting to stable kernels. Note! This will break live migration, buttrying to make KVM play nice with live migration would be quitecomplicated, wouldn't be guaranteed to work (i.e. KVM might stillkill/confuse the guest), and it's not clear that there are any publiclyavailable VMMs that support adaptive PEBS, let alone live migrate VMs thatsupport adaptive PEBS, e.g. QEMU doesn't support PEBS in any capacity.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26992",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-26992"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-01 06:15:00 UTC",
			"cve": {
				"text": "CVE-2024-26992",
				"href": "https://ubuntu.com/security/CVE-2024-26992",
				"public": "20240501"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000000",
						"comment": "linux package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000010",
						"comment": "linux-lts-xenial package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000020",
						"comment": "linux-aws package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000030",
						"comment": "linux-azure package in trusty is affected and may need fixing."
					}
				]
			}
		]
	}
}
