{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.trusty:def:201929880000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2019-2988 on Ubuntu 14.04 LTS (trusty) - medium.",
    "Description": "Vulnerability in the Java SE, Java SE Embedded product of Oracle Java SE (component: 2D). Supported versions that are affected are Java SE: 7u231, 8u221, 11.0.4 and 13; Java SE Embedded: 8u221. Difficult to exploit vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Java SE, Java SE Embedded. Successful attacks of this vulnerability can result in unauthorized ability to cause a partial denial of service (partial DOS) of Java SE, Java SE Embedded. Note: This vulnerability applies to Java deployments, typically in clients running sandboxed Java Web Start applications or sandboxed Java applets (in Java SE 8), that load and run untrusted code (e.g., code that comes from the internet) and rely on the Java sandbox for security. This vulnerability does not apply to Java deployments, typically in servers, that load and run only trusted code (e.g., code installed by an administrator). CVSS 3.0 Base Score 3.7 (Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:L). It was discovered that a buffer overflow existed in the SunGraphics2D class in OpenJDK. An attacker could possibly use this to cause a denial of service (excessive memory consumption or application crash).",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 14.04 LTS"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2019-2988",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-2988"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2019 Canonical Ltd.",
      "PublicDate": "2019-10-16 18:15:00 UTC",
      "Bug": null,
      "cve": {
        "text": "CVE-2019-2988",
        "href": "https://ubuntu.com/security/CVE-2019-2988",
        "public": "20191016",
        "cvss_score": "3.7",
        "cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:L",
        "usns": "4223-1"
      },
      "PublicDateAtUsn": "2019-10-16 18:15:00 UTC",
      "AssignedTo": "",
      "DiscoveredBy": "",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": ""
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.trusty:tst:201548520000030",
        "comment": "openjdk-7: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
      }
    ]
  }
}
