{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2020161200000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2020-16120 on Ubuntu 14.04 LTS (trusty) - medium.",
		"Description": "Overlayfs did not properly perform permission checking when copying up files in an overlayfs and could be exploited from within a user namespace, if, for example, unprivileged user namespaces were allowed. It was possible to have a file not readable by an unprivileged user to be copied to a mountpoint controlled by the user, like a removable device. This was introduced in kernel version 4.19 by commit d1d04ef (\"ovl: stack file ops\"). This was fixed in kernel version 5.8 by commits 56230d9 (\"ovl: verify permissions in ovl_path_open()\"), 48bd024 (\"ovl: switch to mounter creds in readdir\") and 05acefb (\"ovl: check permission to open real file\"). Additionally, commits 130fdbc (\"ovl: pass correct flags for opening real directory\") and 292f902 (\"ovl: call secutiry hook in ovl_real_ioctl()\") in kernel 5.8 might also be desired or necessary. These additional commits introduced a regression in overlay mounts within user namespaces which prevented access to files with ownership outside of the user namespace. This regression was mitigated by subsequent commit b6650da (\"ovl: do not fail because of O_NOATIMEi\") in kernel 5.11. Giuseppe Scrivano discovered that the overlay file system in the Linux kernel did not properly perform permission checks in some situations. A local attacker could possibly use this to bypass intended restrictions and gain read access to restricted files.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2020-16120",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-16120"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2020 Canonical Ltd.",
			"PublicDate": "2020-10-13 17:00:00 UTC",
			"Bug": [
				"https://bugs.launchpad.net/bugs/1894980",
				"https://bugs.launchpad.net/bugs/1900141"
			],
			"cve": {
				"text": "CVE-2020-16120",
				"href": "https://ubuntu.com/security/CVE-2020-16120",
				"public": "20201013",
				"cvss_score": "4.4",
				"cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N",
				"usns": "4578-1,4577-1,4576-1"
			},
			"PublicDateAtUsn": "2020-10-13 17:00:00 UTC",
			"AssignedTo": "cascardo",
			"DiscoveredBy": "Giuseppe Scrivano",
			"Crd": "2020-10-13 17:00:00 UTC",
			"Ref": null
		}
	},
	"notes": {
		"Note": "sbeattie> this issue most likely only has an impact on Ubuntu systems as it is dependent on both unprivileged user namespaces being enabled as well as a non-upstream patch that allows overlayfs mounts in user namespaces. the backport of this issue introduced a regression, LP: #1900141"
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201245420000000",
						"comment": "linux: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201245420000010",
						"comment": "linux-aws: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201245420000020",
						"comment": "linux-azure: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201245420000090",
						"comment": "linux-lts-xenial: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201245420000130",
						"comment": "linux-signed: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201245420000140",
						"comment": "linux-signed-azure: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201245420000150",
						"comment": "linux-signed-lts-xenial: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
