{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2024267890000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26789 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:crypto: arm64/neonbs - fix out-of-bounds access on short inputThe bit-sliced implementation of AES-CTR operates on blocks of 128bytes, and will fall back to the plain NEON version for tail blocks orinputs that are shorter than 128 bytes to begin with.It will call straight into the plain NEON asm helper, which performs allmemory accesses in granules of 16 bytes (the size of a NEON register).For this reason, the associated plain NEON glue code will copy inputsshorter than 16 bytes into a temporary buffer, given that this is a rareoccurrence and it is not worth the effort to work around this in the asmcode.The fallback from the bit-sliced NEON version fails to take this intoaccount, potentially resulting in out-of-bounds accesses. So clone thesame workaround, and use a temp buffer for short in/outputs.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26789",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-26789"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-04-04 09:15:00 UTC",
			"cve": {
				"text": "CVE-2024-26789",
				"href": "https://ubuntu.com/security/CVE-2024-26789",
				"public": "20240404"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000000",
						"comment": "linux package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000010",
						"comment": "linux-lts-xenial package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000020",
						"comment": "linux-aws package in trusty is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:200747740000030",
						"comment": "linux-azure package in trusty is affected and may need fixing."
					}
				]
			}
		]
	}
}
