{
  "class": "vulnerability",
  "id": "oval:com.ubuntu.trusty:def:201710002540000000",
  "version": "1",
  "metadata": {
    "Title": "CVE-2017-1000254 on Ubuntu 14.04 LTS (trusty) - medium.",
    "Description": "libcurl may read outside of a heap allocated buffer when doing FTP. When libcurl connects to an FTP server and successfully logs in (anonymous or not), it asks the server for the current directory with the `PWD` command. The server then responds with a 257 response containing the path, inside double quotes. The returned path name is then kept by libcurl for subsequent uses. Due to a flaw in the string parser for this directory name, a directory name passed like this but without a closing double quote would lead to libcurl not adding a trailing NUL byte to the buffer holding the name. When libcurl would then later access the string, it could read beyond the allocated heap buffer and crash or wrongly access data beyond the buffer, thinking it was part of the path. A malicious server could abuse this fact and effectively prevent libcurl-based clients to work with it - the PWD command is always issued on new FTP connections and the mistake has a high chance of causing a segfault. The simple fact that this has issue remained undiscovered for this long could suggest that malformed PWD responses are rare in benign servers. We are not aware of any exploit of this flaw. This bug was introduced in commit [415d2e7cb7](https://github.com/curl/curl/commit/415d2e7cb7), March 2005. In libcurl version 7.56.0, the parser always zero terminates the string but also rejects it if not terminated properly with a final double quote.\n\nUpdate Instructions:\n\nRun `sudo pro fix CVE-2017-1000254` to fix the vulnerability. The problem can be corrected\nby updating your system to the following package versions:\n\ncurl - 7.35.0-1ubuntu2.11\nlibcurl3 - 7.35.0-1ubuntu2.11\nlibcurl3-gnutls - 7.35.0-1ubuntu2.11\nlibcurl3-nss - 7.35.0-1ubuntu2.11\nNo subscription required",
    "affected": {
      "family": "unix",
      "Platform": "Ubuntu 14.04 LTS"
    },
    "reference": {
      "source": "CVE",
      "ref_id": "CVE-2017-1000254",
      "ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-1000254"
    },
    "advisory": {
      "Severity": "Medium",
      "Rights": "Copyright (C) 2017 Canonical Ltd.",
      "PublicDate": "2017-10-04",
      "Bug": [
        "https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=877671"
      ],
      "cve": {
        "text": "CVE-2017-1000254",
        "href": "https://ubuntu.com/security/CVE-2017-1000254",
        "public": "20171004",
        "cvss_score": "7.5",
        "cvss_vector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
        "usns": "3441-1,3441-2"
      },
      "PublicDateAtUsn": "2017-10-04",
      "AssignedTo": "mdeslaur",
      "DiscoveredBy": "Max Dymond",
      "Crd": "",
      "Ref": null
    }
  },
  "notes": {
    "Note": ""
  },
  "criteria": {
    "criterions": [
      {
        "test_ref": "oval:com.ubuntu.trusty:tst:201695860000000",
        "comment": "curl package in trusty was vulnerable but has been fixed (note: '7.35.0-1ubuntu2.11')."
      }
    ]
  }
}
