{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2023294530000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-29453 on Ubuntu 14.04 LTS (trusty) - medium",
		"description": "Templates do not properly consider backticks (`) as Javascript stringdelimiters, and do not escape them as expected. Backticks are used, sinceES6, for JS template literals. If a template contains a Go template actionwithin a Javascript template literal, the contents of the action can beused to terminate the literal, injecting arbitrary Javascript code into theGo template. As ES6 template literals are rather complex, and themselvescan do string interpolation, the decision was made to simply disallow Gotemplate actions from being used inside of them (e.g., \"var a = {{.}}\"),since there is no obviously safe way to allow this behavior. This takes thesame approach as github.com/google/safehtml. With fix, Template. Parsereturns an Error when it encounters templates like this, with an ErrorCodeof value 12. This ErrorCode is currently unexported but will be exported inthe release of Go 1.21. Users who rely on the previous behavior canre-enable it using the GODEBUG flag jstmpllitinterp=1, with the caveat thatbackticks will now be escaped. This should be used with caution.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-29453",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-29453"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2023 Canonical Ltd.",
			"public_date": "2023-10-12 06:15:00 UTC",
			"cve": {
				"text": "CVE-2023-29453",
				"href": "https://ubuntu.com/security/CVE-2023-29453",
				"public": "20231012",
				"cvss_score": "9.8",
				"cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:201337380000000",
						"comment": "zabbix: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
