{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.trusty:def:2018128920000000",
	"version": "1",
	"metadata": {
		"Title": "CVE-2018-12892 on Ubuntu 14.04 LTS (trusty) - medium",
		"Description": "An issue was discovered in Xen 4.7 through 4.10.x. libxl fails to pass thereadonly flag to qemu when setting up a SCSI disk, due to what was probablyan erroneous merge conflict resolution. Malicious guest administrators or(in some situations) users may be able to write to supposedly read-onlydisk images. Only emulated SCSI disks (specified as \"sd\" in the libxl diskconfiguration, or an equivalent) are affected. IDE disks (\"hd\") are notaffected (because attempts to make them readonly are rejected).Additionally, CDROM devices (that is, devices specified to be presented tothe guest as CDROMs, regardless of the nature of the backing storage on thehost) are not affected; they are always read only. Only systems usingqemu-xen (rather than qemu-xen-traditional) as the device model version arevulnerable. Only systems using libxl or libxl-based toolstacks arevulnerable. (This includes xl, and libvirt with the libxl driver.) Thevulnerability is present in Xen versions 4.7 and later. (In earlierversions, provided that the patch for XSA-142 has been applied, attempts tocreate read only disks are rejected.) If the host and guest togetherusually support PVHVM, the issue is exploitable only if the malicious guestadministrator has control of the guest kernel or guest kernel command line.",
		"affected": {
			"family": "unix",
			"Platform": "Ubuntu 14.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2018-12892",
			"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-12892"
		},
		"advisory": {
			"Severity": "Medium",
			"Rights": "Copyright (C) 2018 Canonical Ltd.",
			"PublicDate": "2018-07-02 17:29:00 UTC",
			"Bug": null,
			"cve": {
				"text": "CVE-2018-12892",
				"href": "https://ubuntu.com/security/CVE-2018-12892",
				"public": "20180702",
				"cvss_score": "9.9",
				"cvss_vector": "CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H"
			},
			"PublicDateAtUsn": "",
			"AssignedTo": "",
			"DiscoveredBy": "",
			"Crd": "",
			"Ref": null
		}
	},
	"notes": {
		"Note": ""
	},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.trusty:tst:2017155880000000",
						"comment": "xen: while related to the CVE in some way, a decision has been made to ignore this issue (note: 'end of standard support')."
					}
				]
			}
		]
	}
}
