{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.noble:def:2024270060000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-27006 on Ubuntu 24.04 LTS (noble) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:thermal/debugfs: Add missing count increment to thermal_debug_tz_trip_up()The count field in struct trip_stats, representing the number of times thezone temperature was above the trip point, needs to be incremented inthermal_debug_tz_trip_up(), for two reasons. First, if a trip point iscrossed on the way up for the first time, thermal_debug_update_temp()called from update_temperature() does not see it because it has not beenadded to trips_crossed[] array in the thermal zone's struct tz_debugfsobject yet. Therefore, when thermal_debug_tz_trip_up() is called afterthat, the trip point's count value is 0, and the attempt to divide by itduring the average temperature computation leads to a divide error whichcauses the kernel to crash. Setting the count to 1 before the division byincrementing it fixes this problem. Second, if a trip point is crossed onthe way up, but it has been crossed on the way up already before, its countvalue needs to be incremented to make a record of the fact that the zonetemperature is above the trip now. Without doing that, if the mitigationsapplied after crossing the trip cause the zone temperature to drop belowits threshold, the count will not be updated for this episode at all andthe average temperature in the trip statistics record will be somewhathigher than it should be. Cc :6.8+ <stable@vger.kernel.org> # 6.8+",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-27006",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-27006"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-01 06:15:00 UTC",
			"cve": {
				"text": "CVE-2024-27006",
				"href": "https://ubuntu.com/security/CVE-2024-27006",
				"public": "20240501"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000000",
						"comment": "linux package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000010",
						"comment": "linux-aws package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000030",
						"comment": "linux-azure package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000040",
						"comment": "linux-gcp package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000020",
						"comment": "linux-gke package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000070",
						"comment": "linux-ibm package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000080",
						"comment": "linux-lowlatency package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000050",
						"comment": "linux-oracle package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000060",
						"comment": "linux-raspi package in noble is affected and may need fixing."
					}
				]
			}
		]
	}
}
