{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.noble:def:2024358750000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-35875 on Ubuntu 24.04 LTS (noble) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:x86/coco: Require seeding RNG with RDRAND on CoCo systems There are fewuses of CoCo that don't rely on working cryptography and hence a workingRNG. Unfortunately, the CoCo threat model means that the VM host cannot betrusted and may actively work against guests to extract secrets ormanipulate computation. Since a malicious host can modify or observe nearlyall inputs to guests, the only remaining source of entropy for CoCo guestsis RDRAND. If RDRAND is broken -- due to CPU hardware fault -- the RNG as awhole is meant to gracefully continue on gathering entropy from othersources, but since there aren't other sources on CoCo, this iscatastrophic. This is mostly a concern at boot time when initially seedingthe RNG, as after that the consequences of a broken RDRAND are much moretheoretical. So, try at boot to seed the RNG using 256 bits of RDRANDoutput. If this fails, panic(). This will also trigger if the system isbooted without RDRAND, as RDRAND is essential for a safe CoCo boot. Addthis deliberately to be \"just a CoCo x86 driver feature\" and not part ofthe RNG itself. Many device drivers and platforms have some desire tocontribute something to the RNG, and add_device_randomness() isspecifically meant for this purpose. Any driver can call it with seed dataof any quality, or even garbage quality, and it can only possibly make thequality of the RNG better or have no effect, but can never make it worse.Rather than trying to build something into the core of the RNG, considerthe particular CoCo issue just a CoCo issue, and therefore separate it allout into driver (well, arch/platform) code. [ bp: Massage commit message. ]",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-35875",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-35875"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-19 09:15:00 UTC",
			"cve": {
				"text": "CVE-2024-35875",
				"href": "https://ubuntu.com/security/CVE-2024-35875",
				"public": "20240519"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000000",
						"comment": "linux package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-38.38')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000010",
						"comment": "linux-aws package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1011.12')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000030",
						"comment": "linux-azure package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1010.10')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000040",
						"comment": "linux-gcp package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1010.11')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000020",
						"comment": "linux-gke package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1006.9')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000070",
						"comment": "linux-ibm package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1008.8')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000080",
						"comment": "linux-lowlatency package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-38.38.1')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000050",
						"comment": "linux-oracle package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1008.8')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000060",
						"comment": "linux-raspi package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1007.7')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000090",
						"comment": "linux-oem-6.8 package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1008.8')."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000100",
						"comment": "linux-intel package in noble is affected. An update containing the fix has been completed and is pending publication (note: '6.8.0-1007.14')."
					}
				]
			}
		]
	}
}
