{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.noble:def:2021474360000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-47436 on Ubuntu 24.04 LTS (noble) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: usb:musb: dsps: Fix the probe error path Commit 7c75bde329d7 (\"usb: musb:musb_dsps: request_irq() after initializing musb\") has inverted the callsto dsps_setup_optional_vbus_irq() and dsps_create_musb_pdev() withoutupdating correctly the error path. dsps_create_musb_pdev() allocates andregisters a new platform device which must be unregistered and freed withplatform_device_unregister(), and this is missing upondsps_setup_optional_vbus_irq() error. While on the master branch it seemsnot to trigger any issue, I observed a kernel crash because of a NULLpointer dereference with a v5.10.70 stable kernel where the patch mentionedabove was backported. With this kernel version, -EPROBE_DEFER is returnedthe first time dsps_setup_optional_vbus_irq() is called which triggers theprobe to error out without unregistering the platform device.Unfortunately, on the Beagle Bone Black Wireless, the platform device stillliving in the system is being used by the USB Ethernet gadget driver, whichduring the boot phase triggers the crash. My limited knowledge of the musbworld prevents me to revert this commit which was sent to silence a robotwarning which, as far as I understand, does not make sense. The goal ofthis patch was to prevent an IRQ to fire before the platform device beingregistered. I think this cannot ever happen due to the fact that enablingthe interrupts is done by the ->enable() callback of the platform musbdevice, and this platform device must be already registered in order forthe core or any other user to use this callback. Hence, I decided to fixthe error path, which might prevent future errors on mainline kernels whilealso fixing older ones.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-47436",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-47436"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-22 07:15:00 UTC",
			"cve": {
				"text": "CVE-2021-47436",
				"href": "https://ubuntu.com/security/CVE-2021-47436",
				"public": "20240522"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000000",
						"comment": "linux package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000010",
						"comment": "linux-aws package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000030",
						"comment": "linux-azure package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000040",
						"comment": "linux-gcp package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000020",
						"comment": "linux-gke package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000070",
						"comment": "linux-ibm package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000080",
						"comment": "linux-lowlatency package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000050",
						"comment": "linux-oracle package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000060",
						"comment": "linux-raspi package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000090",
						"comment": "linux-oem-6.8 package in noble is affected and may need fixing."
					}
				]
			}
		]
	}
}
