{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.noble:def:2023527650000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-52765 on Ubuntu 24.04 LTS (noble) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: mfd:qcom-spmi-pmic: Fix revid implementation The Qualcomm SPMI PMIC revidimplementation is broken in multiple ways. First, it assumes that justbecause the sibling base device has been registered that means that it isalso bound to a driver, which may not be the case (e.g. due to probedeferral or asynchronous probe). This could trigger a NULL-pointerdereference when attempting to access the driver data of the unbounddevice. Second, it accesses driver data of a sibling device directly andwithout any locking, which means that the driver data may be freed while itis being accessed (e.g. on driver unbind). Third, it leaks a struct devicereference to the sibling device which is looked up using thespmi_device_from_of() every time a function (child) device is calling therevid function (e.g. on probe). Fix this mess by reimplementing the revidlookup so that it is done only at probe of the PMIC device; the base devicefetches the revid info from the hardware, while any secondary SPMI devicefetches the information from the base device and caches it so that it canbe accessed safely from its children. If the base device has not beenprobed yet then probe of a secondary device is deferred.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-52765",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-52765"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-21 16:15:00 UTC",
			"cve": {
				"text": "CVE-2023-52765",
				"href": "https://ubuntu.com/security/CVE-2023-52765",
				"public": "20240521"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000000",
						"comment": "linux package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000010",
						"comment": "linux-aws package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000030",
						"comment": "linux-azure package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000040",
						"comment": "linux-gcp package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000020",
						"comment": "linux-gke package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000070",
						"comment": "linux-ibm package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000080",
						"comment": "linux-lowlatency package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000050",
						"comment": "linux-oracle package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000060",
						"comment": "linux-raspi package in noble is affected and may need fixing."
					}
				]
			}
		]
	}
}
