{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.noble:def:2023528360000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-52836 on Ubuntu 24.04 LTS (noble) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:locking/ww_mutex/test: Fix potential workqueue corruption In some casesrunning with the test-ww_mutex code, I was seeing odd behavior wheresometimes it seemed flush_workqueue was returning before all the workthreads were finished. Often this would cause strange crashes as themutexes would be freed while they were being used. Looking at the code,there is a lifetime problem as the controlling thread that spawns the workallocates the \"struct stress\" structures that are passed to the workqueuethreads. Then when the workqueue threads are finished, they free the stressstruct that was passed to them. Unfortunately the workqueue work_structnode is in the stress struct. Which means the work_struct is freed beforethe work thread returns and while flush_workqueue is waiting. It seems likea better idea to have the controlling thread both allocate and free thestress structures, so that we can be sure we don't corrupt the workqueue byfreeing the structure prematurely. So this patch reworks the test to do so,and with this change I no longer see the early flush_workqueue returns.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-52836",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-52836"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-21 16:15:00 UTC",
			"cve": {
				"text": "CVE-2023-52836",
				"href": "https://ubuntu.com/security/CVE-2023-52836",
				"public": "20240521"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000000",
						"comment": "linux package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000010",
						"comment": "linux-aws package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000030",
						"comment": "linux-azure package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000040",
						"comment": "linux-gcp package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000020",
						"comment": "linux-gke package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000070",
						"comment": "linux-ibm package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000080",
						"comment": "linux-lowlatency package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000050",
						"comment": "linux-oracle package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000060",
						"comment": "linux-raspi package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000090",
						"comment": "linux-oem-6.8 package in noble is affected and may need fixing."
					}
				]
			}
		]
	}
}
