{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.noble:def:2023526080000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-52608 on Ubuntu 24.04 LTS (noble) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:firmware: arm_scmi: Check mailbox/SMT channel for consistency On receptionof a completion interrupt the shared memory area is accessed to retrievethe message header at first and then, if the message sequence numberidentifies a transaction which is still pending, the related payload isfetched too. When an SCMI command times out the channel ownership remainswith the platform until eventually a late reply is received and, as aconsequence, any further transmission attempt remains pending, waiting forthe channel to be relinquished by the platform. Once that late reply isreceived the channel ownership is given back to the agent and any pendingrequest is then allowed to proceed and overwrite the SMT area of the justdelivered late reply; then the wait for the reply to the new requeststarts. It has been observed that the spurious IRQ related to the latereply can be wrongly associated with the freshly enqueued request: whenthat happens the SCMI stack in-flight lookup procedure is fooled by thefact that the message header now present in the SMT area is related to thenew pending transaction, even though the real reply has still to arrive.This race-condition on the A2P channel can be detected by looking at thechannel status bits: a genuine reply from the platform will have set thechannel free bit before triggering the completion IRQ. Add a consistencycheck to validate such condition in the A2P ISR.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-52608",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-52608"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-03-13 14:15:00 UTC",
			"cve": {
				"text": "CVE-2023-52608",
				"href": "https://ubuntu.com/security/CVE-2023-52608",
				"public": "20240313"
			},
			"public_date_at_usn": "2024-03-13 14:15:00 UTC",
			"ref": [
				"https://ubuntu.com/security/notices/USN-6766-1",
				"https://ubuntu.com/security/notices/USN-6766-2",
				"https://ubuntu.com/security/notices/USN-6766-3",
				"https://ubuntu.com/security/notices/USN-6795-1"
			]
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000000",
						"comment": "linux package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000010",
						"comment": "linux-aws package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000030",
						"comment": "linux-azure package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000040",
						"comment": "linux-gcp package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000020",
						"comment": "linux-gke package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000070",
						"comment": "linux-ibm package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000080",
						"comment": "linux-lowlatency package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000050",
						"comment": "linux-oracle package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000060",
						"comment": "linux-raspi package in noble is affected and may need fixing."
					}
				]
			}
		]
	}
}
