{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.noble:def:2023524810000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2023-52481 on Ubuntu 24.04 LTS. (noble) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: arm64:errata: Add Cortex-A520 speculative unprivileged load workaround Implementthe workaround for ARM Cortex-A520 erratum 2966298. On an affectedCortex-A520 core, a speculatively executed unprivileged load might leakdata from a privileged load via a cache side channel. The issue only existsfor loads within a translation regime with the same translation (e.g. sameASID and VMID). Therefore, the issue only affects the return to EL0. Theworkaround is to execute a TLBI before returning to EL0 after all loads ofprivileged data. A non-shareable TLBI to any address is sufficient. Theworkaround isn't necessary if page table isolation (KPTI) is enabled, butfor simplicity it will be. Page table isolation should normally be disabledfor Cortex-A520 as it supports the CSV3 feature and the E0PD feature (usedwhen KASLR is enabled).",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.04 LTS."
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2023-52481",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2023-52481"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-02-29 06:15:00 UTC",
			"cve": {
				"text": "CVE-2023-52481",
				"href": "https://ubuntu.com/security/CVE-2023-52481",
				"public": "20240229"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000000",
						"comment": "linux package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000010",
						"comment": "linux-aws package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000020",
						"comment": "linux-azure package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000030",
						"comment": "linux-gcp package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000060",
						"comment": "linux-ibm package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000070",
						"comment": "linux-lowlatency package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000040",
						"comment": "linux-oracle package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000050",
						"comment": "linux-raspi package in noble is affected and may need fixing."
					}
				]
			}
		]
	}
}
