{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.noble:def:2024359940000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-35994 on Ubuntu 24.04 LTS (noble) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:firmware: qcom: uefisecapp: Fix memory related IO errors and crashes Itturns out that while the QSEECOM APP_SEND command has specific fields forrequest and response buffers, uefisecapp expects them both to be in asingle memory region. Failure to adhere to this has (so far) resulted ineither no response being written to the response buffer (causing an EIO tobe emitted down the line), the SCM call to fail with EINVAL (i.e., directlyfrom TZ/firmware), or the device to be hard-reset. While this issue can betriggered deterministically, in the current form it seems to happen rathersporadically (which is why it has gone unnoticed during earlier testing).This is likely due to the two kzalloc() calls (for request and response)being directly after each other. Which means that those likely returnconsecutive regions most of the time, especially when not much else isgoing on in the system. Fix this by allocating a single memory region forboth request and response buffers, properly aligning both structs insideit. This unfortunately also means that the qcom_scm_qseecom_app_send()interface needs to be restructured, as it should no longer map the DMAregions separately. Therefore, move the responsibility of DMA allocation(or mapping) to the caller.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-35994",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-35994"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-20 10:15:00 UTC",
			"cve": {
				"text": "CVE-2024-35994",
				"href": "https://ubuntu.com/security/CVE-2024-35994",
				"public": "20240520"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000000",
						"comment": "linux package in noble is affected. An update containing the fix has been completed and is pending publication."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000010",
						"comment": "linux-aws package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000030",
						"comment": "linux-azure package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000040",
						"comment": "linux-gcp package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000020",
						"comment": "linux-gke package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000070",
						"comment": "linux-ibm package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000080",
						"comment": "linux-lowlatency package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000050",
						"comment": "linux-oracle package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000060",
						"comment": "linux-raspi package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000090",
						"comment": "linux-oem-6.8 package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000100",
						"comment": "linux-intel package in noble is affected. An update containing the fix has been completed and is pending publication."
					}
				]
			}
		]
	}
}
