{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.noble:def:2024358040000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-35804 on Ubuntu 24.04 LTS (noble) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: KVM:x86: Mark target gfn of emulated atomic instruction as dirty When emulatingan atomic access on behalf of the guest, mark the target gfn dirty if theCMPXCHG by KVM is attempted and doesn't fault. This fixes a bug where KVMeffectively corrupts guest memory during live migration by writing to guestmemory without informing userspace that the page is dirty. Marking the pagedirty got unintentionally dropped when KVM's emulated CMPXCHG was convertedto do a user access. Before that, KVM explicitly mapped the guest page intokernel memory, and marked the page dirty during the unmap phase. Mark thepage dirty even if the CMPXCHG fails, as the old data is written back onfailure, i.e. the page is still written. The value written is guaranteed tobe the same because the operation is atomic, but KVM's ABI is that allwrites are dirty logged regardless of the value written. And moreimportantly, that's what KVM did before the buggy commit. Huge kudos to thefolks on the Cc list (and many others), who did all the actual work oftriaging and debugging. base-commit:6769ea8da8a93ed4630f1ce64df6aafcaabfce64",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-35804",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-35804"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-05-17 14:15:00 UTC",
			"cve": {
				"text": "CVE-2024-35804",
				"href": "https://ubuntu.com/security/CVE-2024-35804",
				"public": "20240517"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000000",
						"comment": "linux package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000010",
						"comment": "linux-aws package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000030",
						"comment": "linux-azure package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000040",
						"comment": "linux-gcp package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000020",
						"comment": "linux-gke package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000070",
						"comment": "linux-ibm package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000080",
						"comment": "linux-lowlatency package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000050",
						"comment": "linux-oracle package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000060",
						"comment": "linux-raspi package in noble is affected and may need fixing."
					}
				]
			}
		]
	}
}
