{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.noble:def:2024386050000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-38605 on Ubuntu 24.04 LTS (noble) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: ALSA:core: Fix NULL module pointer assignment at card init The commit81033c6b584b (\"ALSA: core: Warn on empty module\") introduced a WARN_ON()for a NULL module pointer passed at snd_card object creation, and it alsowraps the code around it with '#ifdef MODULE'. This works in most cases,but the devils are always in details. \"MODULE\" is defined when the targetcode (i.e. the sound core) is built as a module; but this doesn't mean thatthe caller is also built-in or not. Namely, when only the sound core isbuilt-in (CONFIG_SND=y) while the driver is a module(CONFIG_SND_USB_AUDIO=m), the passed module pointer is ignored even if it'snon-NULL, and card->module remains as NULL. This would result in themissing module reference up/down at the device open/close, leading to arace with the code execution after the module removal. For addressing thebug, move the assignment of card->module again out of ifdef. The WARN_ON()is still wrapped with ifdef because the module can be really NULL when allsound drivers are built-in. Note that we keep 'ifdef MODULE' for WARN_ON(),otherwise it would lead to a false-positive NULL module check. Admittedlyit won't catch perfectly, i.e. no check is performed when CONFIG_SND=y.But, it's no real problem as it's only for debugging, and the condition ispretty rare.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-38605",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-38605"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-06-19 14:15:00 UTC",
			"cve": {
				"text": "CVE-2024-38605",
				"href": "https://ubuntu.com/security/CVE-2024-38605",
				"public": "20240619"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000000",
						"comment": "linux package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000010",
						"comment": "linux-aws package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000030",
						"comment": "linux-azure package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000040",
						"comment": "linux-gcp package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000020",
						"comment": "linux-gke package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000070",
						"comment": "linux-ibm package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000080",
						"comment": "linux-lowlatency package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000050",
						"comment": "linux-oracle package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000090",
						"comment": "linux-oem-6.8 package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000060",
						"comment": "linux-raspi package in noble is affected and needs fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000100",
						"comment": "linux-intel package in noble is affected and needs fixing."
					}
				]
			}
		]
	}
}
