{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.noble:def:2021471830000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2021-47183 on Ubuntu 24.04 LTS (noble) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved:scsi: lpfc: Fix link down processing to address NULL pointer dereferenceIf an FC link down transition while PLOGIs are outstanding to fabric wellknown addresses, outstanding ABTS requests may result in a NULL pointerdereference. Driver unload requests may hang with repeated \"2878\" logmessages.The Link down processing results in ABTS requests for outstanding ELSrequests. The Abort WQEs are sent for the ELSs before the driver had setthe link state to down. Thus the driver is sending the Abort with theexpectation that an ABTS will be sent on the wire. The Abort request isstalled waiting for the link to come up. In some conditions the driver mayauto-complete the ELSs thus if the link does come up, the Abort completionsmay reference an invalid structure.Fix by ensuring that Abort set the flag to avoid link traffic if issued dueto conditions where the link failed.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2021-47183",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2021-47183"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-04-10 19:15:00 UTC",
			"cve": {
				"text": "CVE-2021-47183",
				"href": "https://ubuntu.com/security/CVE-2021-47183",
				"public": "20240410"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000000",
						"comment": "linux package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000010",
						"comment": "linux-aws package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000030",
						"comment": "linux-azure package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000040",
						"comment": "linux-gcp package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000020",
						"comment": "linux-gke package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000070",
						"comment": "linux-ibm package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000080",
						"comment": "linux-lowlatency package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000050",
						"comment": "linux-oracle package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000060",
						"comment": "linux-raspi package in noble is affected and may need fixing."
					}
				]
			}
		]
	}
}
