{
	"class": "vulnerability",
	"id": "oval:com.ubuntu.noble:def:2024269180000000",
	"version": "1",
	"metadata": {
		"title": "CVE-2024-26918 on Ubuntu 24.04 LTS (noble) - medium",
		"description": "In the Linux kernel, the following vulnerability has been resolved: PCI:Fix active state requirement in PME polling The commit noted in fixes addeda bogus requirement that runtime PM managed devices need to be in theRPM_ACTIVE state for PME polling. In fact, only devices in low power statesshould be polled. However there's still a requirement that the deviceconfig space must be accessible, which has implications for both thecurrent state of the polled device and the parent bridge, when present.It's not sufficient to assume the bridge remains in D0 and cases have beenobserved where the bridge passes the D0 test, but the PM state indicatesRPM_SUSPENDING and config space of the polled device becomes inaccessibleduring pci_pme_wakeup(). Therefore, since the bridge is already effectivelyrequired to be in the RPM_ACTIVE state, formalize this in the code andelevate the PM usage count to maintain the state while polling thesubordinate device. This resolves a regression reported in the bugzillabelow where a Thunderbolt/USB4 hierarchy fails to scan for an attached NVMeendpoint downstream of a bridge in a D3hot power state.",
		"affected": {
			"family": "unix",
			"platform": "Ubuntu 24.04 LTS"
		},
		"reference": {
			"source": "CVE",
			"ref_id": "CVE-2024-26918",
			"ref_url": "https://www.cve.org/CVERecord?id=CVE-2024-26918"
		},
		"advisory": {
			"severity": "Medium",
			"rights": "Copyright (C) 2024 Canonical Ltd.",
			"public_date": "2024-04-17 16:15:00 UTC",
			"bug": [
				"https://bugzilla.kernel.org/show_bug.cgi?id=218360",
				"https://bugzilla.redhat.com/show_bug.cgi?id=CVE-2024-26918"
			],
			"cve": {
				"text": "CVE-2024-26918",
				"href": "https://ubuntu.com/security/CVE-2024-26918",
				"public": "20240417"
			}
		}
	},
	"notes": {},
	"criteria": {
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000000",
						"comment": "linux package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000010",
						"comment": "linux-aws package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000030",
						"comment": "linux-azure package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000040",
						"comment": "linux-gcp package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000020",
						"comment": "linux-gke package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000070",
						"comment": "linux-ibm package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000080",
						"comment": "linux-lowlatency package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000050",
						"comment": "linux-oracle package in noble is affected and may need fixing."
					},
					{
						"test_ref": "oval:com.ubuntu.noble:tst:201245420000060",
						"comment": "linux-raspi package in noble is affected and may need fixing."
					}
				]
			}
		]
	}
}
